{
    "descriptions": {
        "list": [
            "QuickMount installation hardware is designed to cut down installation time considerably, eliminating most pain-points installers experience today with drop-in sinks",
            "Designed with an innovative twisted shape to perfectly rotate 90 degrees into the correct positioning during tightening to securely clamp the sink to the countertop using the provided installation tool",
            "QuickMount clips can be pre-installed into the sink channel wherever necessary to help reduce gaps around sink edges and adapt to countertop imperfections",
            "This hardware is also 50% longer than the current stud, allowing it to accommodate a wider variety of countertop depths and materials",
            "Soundshield noise protection is sound deadening and inhibits condensation",
            "Top mount or undermount installation",
            "Spot Resist stainless finish on faucet makes cleanup easy by resisting fingerprints and water spots",
            "Includes drain assembly and soap/lotion dispenser included for fully coordinated convenience",
            "QuickMount mounting hardware for top-mount installation; under-mount installation clips not included"
        ]
    },
    "specs": [
        {
            "title": "Series Name",
            "spec": "Kelsa"
        },
        {
            "title": "Commercial/Residential",
            "spec": "Residential"
        },
        {
            "title": "Material",
            "spec": "Stainless steel"
        },
        {
            "title": "Sink Mount Type",
            "spec": "Drop-in or undermount"
        },
        {
            "title": "Corner Installation",
            "spec": 0
        },
        {
            "title": "Fixture Color Family",
            "spec": "Stainless steel"
        },
        {
            "title": "Fixture Finish",
            "spec": "N/A"
        },
        {
            "title": "Manufacturer Color/Finish",
            "spec": "Stainless Steel"
        },
        {
            "title": "Number of Basins",
            "spec": "2"
        },
        {
            "title": "Bowl Configuration",
            "spec": "Double equal bowl"
        },
        {
            "title": "Depth of Bowl 1 (Inches)",
            "spec": "9"
        },
        {
            "title": "Depth of Bowl 2 (Inches)",
            "spec": "9"
        },
        {
            "title": "Depth of Bowl 3 (Inches)",
            "spec": "0"
        },
        {
            "title": "Width (Inches)",
            "spec": "33"
        },
        {
            "title": "Length (Inches)",
            "spec": "22"
        },
        {
            "title": "Weight (lbs.)",
            "spec": "31.3"
        },
        {
            "title": "Sink Gauge",
            "spec": "18"
        },
        {
            "title": "Minimum Cabinet Size",
            "spec": "36-in"
        },
        {
            "title": "Cutout Below Counter Height (Inches)",
            "spec": "9"
        },
        {
            "title": "Cutout Width (Inches)",
            "spec": "32.375"
        },
        {
            "title": "Cutout Length (Inches)",
            "spec": "21.375"
        },
        {
            "title": "Number of Faucet Holes",
            "spec": "2"
        },
        {
            "title": "Max Flow Rate",
            "spec": "1.5 GPM (5.7 LPM)"
        },
        {
            "title": "Heat Resistance in Degrees F",
            "spec": "600+"
        },
        {
            "title": "Noise Insulation",
            "spec": 1
        },
        {
            "title": "All-in-One Kit",
            "spec": 1
        },
        {
            "title": "Faucet Included",
            "spec": 1
        },
        {
            "title": "Manufacturer Faucet Finish",
            "spec": "Stainless Steel"
        },
        {
            "title": "Drain Included",
            "spec": 1
        },
        {
            "title": "Drain Location",
            "spec": "Offset"
        },
        {
            "title": "Mounting Hardware Included",
            "spec": 1
        },
        {
            "title": "Items Required for Assembly",
            "spec": "Teflon tape, basin wrench, pliers, screwdriver, adjustable wrench, flashlight"
        },
        {
            "title": "UL Safety Listing",
            "spec": 0
        },
        {
            "title": "CSA Safety Listing",
            "spec": 1
        },
        {
            "title": "ETL Safety Listing",
            "spec": 0
        },
        {
            "title": "NSF Safety Listing",
            "spec": 1
        },
        {
            "title": "Warranty",
            "spec": "Limited lifetime"
        },
        {
            "title": "Drainboard Included",
            "spec": 0
        },
        {
            "title": "Trough",
            "spec": 1
        },
        {
            "title": "Number of Sinks",
            "spec": "Double sink"
        },
        {
            "title": "Apron Height",
            "spec": "N/A"
        },
        {
            "title": "Lowe's Exclusive",
            "spec": 1
        },
        {
            "title": "UNSPSC",
            "spec": "30181500"
        },
        {
            "title": "Type",
            "spec": "Drop-in or undermount"
        },
        {
            "title": "Compatible with Garbage Disposals",
            "spec": 1
        }
    ],
    "reviews": [
        {
            "images": [
                {
                    "smallName": "7ef3ce8e-8356-5361-b054-9e43b7557e73",
                    "largeName": "33c19968-e771-54d9-ba1c-6825e361839d"
                },
                {
                    "smallName": "25a12b1d-723f-5336-a87a-15b97da165df",
                    "largeName": "e6e698ec-ba75-5d7e-97b8-9bb228348d25"
                }
            ],
            "title": "\"Nice sink/Faucet combo-\"",
            "rating": 4,
            "date": "02/09/2017",
            "recommended": true,
            "text": "This is a nice sink faucet combo and installation was easy. The minimum cutout requirements are correct and can't be any smaller than stated. I had to cut tile to allow enough space (not an easy thing) to install. I would have rated 5 stars except for two things:1-The left side of the sink pools water in front of the drain (does not drain to the hole)2-The faucet head drops when pressure (shut off) is released about an inch or more.I will try a few things to adjust this, but is not a deal breaker for me. It is a nice sink and easy to clean and keep bright. As you can see in the photo, the head drops down when pressure is released (shut off).",
            "author": "TheCarpenter",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 13,
                "no": 5
            }
        },
        {
            "images": [
                {
                    "smallName": "bc610eb4-468c-564c-91fd-0970ce98f7d4",
                    "largeName": "707ac0c6-d7fb-5422-92ce-4301fffa3533"
                }
            ],
            "title": "\"Shape of Sink is an issue\"",
            "rating": 3,
            "date": "01/14/2017",
            "recommended": true,
            "text": "I love the sink and faucet; however, I apparently have a warped sink.  The left side doesn't drain completely and water settles in the back of the basin.  It's frustrating to have an updated, beautiful sink, but I have to wipe it out every time I use it.  I already have water stains in that area just because I've failed to wipe out the sink.  I assume there was an issue in manufacturing.  Otherwise, the rating would be higher.  I'm sure I could remove the sink and return it.  Over time, I may wish I had done it.  Some people may think it's not a big deal.  To me, it is.  A simple hand wash turns into extra time because I wash my hands, and then have to wipe out the sink.  I'll attempt to wash my hands on the right side to prevent this.",
            "author": "dba",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 70,
                "no": 10
            }
        },
        {
            "title": "\"Moen Kelsa Sink\"",
            "rating": 3,
            "date": "07/12/2017",
            "recommended": null,
            "text": "Sink looks good but I have a problem with water standing in the left basin up near the left front of it.  I had read reviews and saw that others had that problem so I  mentioned it to my installer.   After he left, I checked and sure enough, the water was standing there.  When I asked about it they said there was no way to level it to make it drain properly.  I asked if maybe they could raise the front a little.  I was told that the the sink would leak since it was caulked.  Seems like there should be some fix for it, but since I have no expertise, I do not know what options I have. Any suggestions out there? It's a pretty expensive sink for me to have to wipe down everytime I use it.",
            "author": "Sarahcat",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 54,
                "no": 7
            }
        },
        {
            "images": [
                {
                    "smallName": "7d441b43-7fed-58f5-a497-de959885821f",
                    "largeName": "f5e613b2-2b27-58fa-a145-bfb7b59f135c"
                }
            ],
            "title": "\"Buyer Beware\"",
            "rating": 1,
            "date": "07/03/2017",
            "recommended": false,
            "text": "Sounded like a great deal that my son and I started the install when we got home.  Made all the cuts as per directions but when we went to place it in the counter we noticed the front edge of the sink was bowed.  Took it back to the store but this time opened three more boxes and every one had the same issue.  Some were even bowed on the back edge too.  Some had a wavy appearance toward the middle.  Decided on a Franke which had a much better edge.  So, my advice is open the box and check it first.  On another note we had to purchase a separate faucet as the Franke sink did not come with one.  The faucet was Moen as well.  Got it fully installed, went to do the leak check and the retractable hose had a pin hole leak in it.  Brand new faucet sealed in the box with a defective hose.  I honestly though Moen was better.  Lowes did exchange that part too",
            "author": "F4GWW",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 31,
                "no": 4
            }
        },
        {
            "images": [
                {
                    "smallName": "ecc66ef6-7d0e-527e-96c8-1453fccd80e4",
                    "largeName": "637d25f9-09ab-513a-828e-5f91c12cc43b"
                }
            ],
            "title": "\"It Come With a Bow\"",
            "rating": 3,
            "date": "08/30/2017",
            "recommended": false,
            "text": "Sink and faucet look fantastic but as others have said it has a slight bow in the middle.  I've never seen this in any sink I've installed.  I laid a four ft. level across the sink just to make sure it wasn't my counter top that was off.  The bow can be pulled down but the clips that are supply are too flimsy. I instead used round washers to secure the sink.  A sink for this price shouldn't have this problem.  Once installed it looks great.",
            "author": "DWC",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 22,
                "no": 3
            }
        },
        {
            "images": [
                {
                    "smallName": "8f2f68db-241a-5b7b-af0c-6730b7a0e336",
                    "largeName": "807c67ca-9902-5014-aaed-0891f985a3e4"
                },
                {
                    "smallName": "19deb972-eb32-5a96-bf86-953a90cdd664",
                    "largeName": "f047c00a-08bf-59dc-ab17-58e0bb38a6c3"
                },
                {
                    "smallName": "5db8eb58-302e-5edb-9a9a-88fff7fcb633",
                    "largeName": "ea376fed-6e3d-50b2-b9b1-ae7c6cae797b"
                }
            ],
            "title": "\"Noticed a Defect after installation.\"",
            "rating": 3,
            "date": "12/04/2018",
            "recommended": true,
            "text": "Pretty sure the installation didn't ripple one of the sides of the bowls but I didn't open the box before installation to check it.   It's a pretty penny to have a defect in it. Very nice looking sink tho.",
            "author": "Ayeager81",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice, very happy.\"",
            "rating": 5,
            "date": "02/02/2016",
            "recommended": true,
            "text": "After my son helped me get the old two ton cast iron sink out of the thirty year old counter the hard work was done. The feature I like most about the new sink is the flat bottom: things don't tip over. Also, the sound deadening is quite -but not totally - effective. It is a stainless steel sink.My wife likes the fact that 13 x 9 casserole dishes sit flat in the larger basin. Good flow from the faucet in either spray or flow mode. Pleasantly surprised that the pull out mode selector has a switch rather than a push button.My only disappointment is that the sink/faucet combo that I originally ordered was no longer available and it took two weeks and an extra $150.00 to reorder the almost identical model. It happens.I'm lovin' it.",
            "author": "Electro",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 102,
                "no": 9
            }
        },
        {
            "title": "\"Nice sink; the instructions need to corrected\"",
            "rating": 4,
            "date": "07/03/2016",
            "recommended": true,
            "text": "I bought this a month ago and finally found a few hours of free time to install it. I unpacked everything and laid it out beforehand and to my dismay found that a part was missing from the faucet kit (part D - Bracket).   I repacked everything back into the box and brought it back to Lowe's to exchange it.  The plumbing staff decided they would pull the bracket from another box of this item, but found that the \"bracket\" was missing from that box too.  Together we put the faucet on the sink and concluded that the \"bracket\" really isn't needed; the instructions are incorrect.  So I wasted about an hour and a half because the instructions for this product aren't correct.   Other than that, the sink and the faucet are first class; we really like the combination.  It would get five stars except for the faulty instructions.",
            "author": "FelixinTulsa",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 155,
                "no": 6
            }
        },
        {
            "title": "\"Very happy!\"",
            "rating": 5,
            "date": "03/02/2016",
            "recommended": true,
            "text": "I am very happy with this Moen Kelsa sink / faucet combination! Installation was easy, instructions were very good. I like the good quality of the components of this sink / faucet kit. The sinks are huge, lots of room for washing large pots and cutting boards. Water pressure is great! Better than our old faucet. We love the clean look of this sink / faucet combination. And finally we really like the built in soap dispenser, which can be easily refilled from the top. Great product!",
            "author": "Fusion12",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 151,
                "no": 17
            }
        },
        {
            "images": [
                {
                    "smallName": "44e741f3-6051-563e-8aa6-b2566b2778d6",
                    "largeName": "52b62159-077f-58c4-9127-8a17e6b25424"
                }
            ],
            "title": "\"6 months and cracking\"",
            "rating": 1,
            "date": "04/30/2017",
            "recommended": false,
            "text": "6 months old and see a crack near soap dispenser, will not purchase another Moen.",
            "author": "ejbailey1968",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 31,
                "no": 8
            }
        },
        {
            "title": "\"Quality 18 gauge sink and faucet\"",
            "rating": 5,
            "date": "01/26/2017",
            "recommended": null,
            "text": "Went together like clock work. Had to read how the under sink clamps worked a couple of times because this was my first sink installation. At age 77 I am not as nimble working under the counter but completed the job on 2 hours and everything has continued to perform 100%. Really nice quality for the money.",
            "author": "Dick",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 73,
                "no": 4
            }
        },
        {
            "images": [
                {
                    "smallName": "06f379ec-2388-5824-8465-b9d8cb94e620",
                    "largeName": "92377cf3-6831-5c74-a014-c1677a92437a"
                }
            ],
            "title": "\"Scratches!\"",
            "rating": 2,
            "date": "03/24/2019",
            "recommended": false,
            "text": "This sink is not three months old and scratched up! I do not have cast iron pans and only use silicone utensils. It started scratching immediately. I now have mats in the sink, which are a pain to wash. Meanwhile in my utility room I have a twenty year old non-name brand sink with no scratches. Very disappointed in the quality of this Moen sink. I don't blame Lowe's but Moen should do better.",
            "author": "GSJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Great Choice\"",
            "rating": 5,
            "date": "06/28/2016",
            "recommended": true,
            "text": "I just bought this sink 4 days ago, I had it installed (undermount on granite countertops). It looks great! I am liking the depth and the water pressure from the faucet. The faucet is a lot different from what I had so it will take some getting used to. I fell in love with this sink when I first saw it. I like the material and how big it is.",
            "author": "Chicanita",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 52,
                "no": 7
            }
        },
        {
            "title": "\"Excellent product!\"",
            "rating": 5,
            "date": "08/29/2016",
            "recommended": true,
            "text": "Had my old sink removed and this one installed. Would have done it myself but glad a plumber did, ran into some issues with the size of the sink opening. However, the price was right and it works like a champ. My wife is happy...........",
            "author": "Lars",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 43,
                "no": 3
            }
        },
        {
            "images": [
                {
                    "smallName": "5909c2e6-2d8c-5a33-baf8-4cf53659787d",
                    "largeName": "24e2ada1-5cff-5a93-8497-20ae230be92f"
                }
            ],
            "title": "\"Moen Drop In\"",
            "rating": 4,
            "date": "01/11/2019",
            "recommended": null,
            "text": "This sink and faucet combo was very easy to install myself. It is a major improvement over our previous 22ga stainless sink. The sink is quieter, much deeper and maximizes usable space. The faucet is nicely finished and does it's job. The only reason for a 4 star rather than the 5 is that the sink does scratch quite easily. We have used it for about two weeks now and are already noticing scratches at the basin from light/normal use, but I supposed that's to be expected with items that are used as often as sinks. Overall, I would recommend this to anyone looking for a new sink!",
            "author": "SpokaneDIYguy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"One nice sink, soap dispenser and faucet!!\"",
            "rating": 5,
            "date": "03/08/2017",
            "recommended": true,
            "text": "I installed the sink in a drop in mode and their quick-connect fasteners worked out nicely. I'd like to remind customers to register their product with Moen because of the lifetime warranty (original owner). I enjoy already the soap dispenser which fills from the \"top\", a very handy feature. Needless to say that the 3 way faucet, fill, spray and hold features will be very useful for the large pots and pans.",
            "author": "Greg",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 9,
                "no": 0
            }
        },
        {
            "title": "\"Great sink / generic directions\"",
            "rating": 5,
            "date": "11/26/2018",
            "recommended": true,
            "text": "Love the sink and faucet!  This was a replacement sink for us. The directions were a bit iffy at times. We finally called Moen direct about missing parts and learned the directions were not specific for THIS sink and the ‘missing' part wasn't needed for this particular sink. This project took 6 hours because 1) our old sink was 7” and this one is 9” therefore we needed to do a little additional plumbing 2) we decided to change the way our dishwasher was vented which meant an additional trip to Lowe's and 3) I'm really picky so my husband likes to do things slowly so they're done right LOL!",
            "author": "CaseyB",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Scratches easily\"",
            "rating": 4,
            "date": "02/03/2017",
            "recommended": false,
            "text": "This is a really nice looking sink but after one month the bottom is totally scratched.  Not sure how but we had our last sink for ten years and it wasn't scratched like this.",
            "author": "Kris",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 57,
                "no": 6
            }
        },
        {
            "title": "\"Happy Wife, Happy Life!!!\"",
            "rating": 5,
            "date": "03/07/2018",
            "recommended": true,
            "text": "We could not be happier with this sink!  At 68 yrs. old, I can safely say Plumbing and I do NOT get along...at least until now.  I replaced the kitchen sink that was here when we bought this home.  From the time that the old sink was removed, to the time we turned the water back on was 2 1/4 hrs.   The sink is absolutely flawless.  Directions are a little confusing, but very manageable.  The edges were \"level\".  Checked this because of some of the reviews noting edges that were bowed.  The 10 clips that are included worked without a hitch.  The plastic/nylon \"nut tightener\" should probably be an extra 2\" long...it would make installation even easier.  But the one that is presently including in the parts is manageable.  The pulldown faucet is just what my wife wanted.  The water supply lines are braided and long enough to connect to a standard water line negating having to purchase a separate set of braided lines as on some of the other faucets.  Some of the earlier reviews noted some \"uneven bowl bottoms.\"  Both bowls on our sink are very level.  At least on this sink, water spotting/stains don't seem to be a problem.  The wife noticed a little spotting initially but we \"upped\" the water softener setting and no more spots.  We like this sink enough that we're considering buying another one for an aunt.  I can't think of anything, at least with our experience, that would not recommend this to others.",
            "author": "JustUs",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 15,
                "no": 0
            }
        },
        {
            "title": "\"Love Faucet, Sink Not So Much\"",
            "rating": 3,
            "date": "04/02/2018",
            "recommended": false,
            "text": "Bought this because of the Moen name and Moen has let me down.  I love the faucet, but the sink is not of Moen quality.  It has now been installed for about 3 months and every time I use it I think that I need to post a review.  It was not hard to install.  That is good.  The faucet is wonderful.  That is good.  The sink, not so much.  It got scratches all over it right away.  I mean on day two of having a new sink and using it gently, it had scratches.  The scratches continue to occur.  It also gets a white film on the sink that I have to constantly wipe off.  I have tried using glass cleaner, Perfect Stainless Steel and other products to no avail.  It always looks like it has this film on it.  I have never had a sink that is this deep and I love that part.  Ultimately, a sink is a tool so it is bound to have some wear show.  I just didn't expect it to be this much or this fast. When it is time to get a new sink (you know, 25 years down the road when this one wears out) I will not be looking for a Moen sink.  Maybe a Moen facuet, but this sink is a disappointment.",
            "author": "Patti",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 10,
                "no": 0
            }
        },
        {
            "title": "\"Smart design and engineering\"",
            "rating": 5,
            "date": "10/30/2016",
            "recommended": true,
            "text": "Just installed the Moen Kelsa sink & faucet myself (amateur but a few decades as a homeowner), replacing an acrylic sink and Moen faucet assembly. A couple of surprises during the install; (a) the instructions say to use a support bracket for mounting the faucet to the sink if the \"deck\" is less than 1/2\" thick, but the bracket isn't included in the faucet materials. Good news is you don't need it anyway. (b) The opening in the countertop needed widening (I chose the drop-in method). The Quickmount system mounting rails and clips have to be pretty close to the edge of the sink so they can grab the underside of the countertop. a cleverly-designed mounting screw actually rotates the clip from parallel to the edge (to stay clear of the edge) to perpindicular as it is tightened, but even so, the opening needs to be only 1/4\" from the sink lip. Good news is that I had my trusty Ryobi jigsaw, and just enough room around the countertop supports to do the job. (Solid surface counter, maybe 1/2\" thick (wear your mask!). (c) With the mounting clips completely tightened, didn't come close enough to the underside of the countertop to secure the sink to the countertop. I was also a bit concerned about putting that kind of point-pressure (two \"teeth\" on each of ten clips) on the solid surface. So I cut some small pieces of wood (maybe 2\" long, 1/2\" square) to fit between the mounting clips and the counter underside. Worked fine! (d) The bigger and deeper left-hand basin meant that the garbage disposer  (which we've mounted on the left side) was 2\" lower and maybe 3\" further back than in our old sink (the drain hole is not in the center of the basin). So I had to rig some changes in the drain plumbing. All told, though, a tolerable job. Love the pull-down spray, flatter lip and reduced dish clatter compared to the old acrylic (which was surprisingly noisy).",
            "author": "ifisch",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 52,
                "no": 5
            }
        },
        {
            "title": "\"Seconds to install?\"",
            "rating": 4,
            "date": "08/31/2016",
            "recommended": true,
            "text": "Not the sink's fault, but \"Seconds to Install\" was far from true. The hole was 1/4\" too small. The drain had to be cut back. The cute little install bolts had issues with a second layer of wood in the cabinet, and also with the from cabinet lip that was too close to the edge. Had to modify all mount bolts. One stripped the threads on the way up, and one was un-reachable. A couple days and an extra trip to town instead of \"just seconds.\" Faucet went on easily, but had to replace the taps because they were too large. The soap container is hard to fill without removing the bottle. I'll work on a straw or something to make it easier.",
            "author": "ggfossen",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great product package\"",
            "rating": 4,
            "date": "02/23/2018",
            "recommended": true,
            "text": "I bought this to replace my rusty enamel sink. The double sink kit came with everything you need for installation. Just make sure you have caulk/sealant and plumber putty on hand to complete the work. A drawing for dropin cut out would make it easier to cut open the countertop.  Some gripes are that the sink warp or not flat in the midlle between 2 sinks. I'm afraid to bend it nor the steel are too strong as well (18 gauge). Also, it is sharp and could cut you during handling. Love the spot resistance of the faucet. Wish that spot resistance is feature on the sink as well. Also wish there is an option for touchless faucet. Overall, very happy with tge product.",
            "author": "Tom K88",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Beautiful and functional\"",
            "rating": 4,
            "date": "04/23/2018",
            "recommended": true,
            "text": "I bought this about 2 weeks ago trading up from a 7 inch deep sink with a leaky faucet and feel it was worth every penny. Buying the bundle was cheaper then each individual piece and it was easy to install. That being said it does not include plumbers putty, calking for around the basin or any kind of plumbing so we had to make multiple trips back to lowes to get the job done. Also it is advertised to have anti print or water drop resistant coating and honestly it needs thoroughly rinsed and dried in order to make it look clean doesn't seem like the coating helps with water spots. It is however very quiet and the facet is incredible. I would buy again in a heartbeat.",
            "author": "Sholler2016",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice sink\"",
            "rating": 5,
            "date": "02/16/2016",
            "recommended": true,
            "text": "The combo makes it nice the Moen professionals took the guess work out of trying to pick the right faucet with the right sink.",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 54,
                "no": 20
            }
        },
        {
            "title": "\"Moen very nice faucet and good sink\"",
            "rating": 4,
            "date": "02/25/2017",
            "recommended": true,
            "text": "Yes, the product is very pleasing to the eye. The faucet looks nice and works very well. Sink is spacious. My only issue mow that we have installed the new sink/faucet combo is that the sink shows many water, soap, and other marks too easily and needs wiped often.\nI spent 2 hours reading the manual on what we can and cannot use to clean the sink, and admit a lot of research went into the write-ups. I have abided by all the rules. So, the sink is beautiful but maybe we should have looked at more brushed stainless or ceramic sink from Moen.\nContractor said he only had trouble with the locking clips under the sink.",
            "author": "Debra",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "38531a73-cbc4-581d-b663-bb6711468902",
                    "largeName": "acd50242-e3a6-5d83-884a-8a7fee718cbe"
                }
            ],
            "title": "\"The best.\"",
            "rating": 5,
            "date": "09/12/2018",
            "recommended": true,
            "text": "Exellent and easy install.",
            "author": "Sabel",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Product description not all clear\"",
            "rating": 3,
            "date": "06/13/2018",
            "recommended": false,
            "text": "I have been using the sink for a month now.... Not happy w it. The bottom is scratched and has stains and watter spots that do not go away.... This is my forever home remodeling and I wonder if in a couple of yr I will need to replace the sink due to it looking deteriorated?  What can I do? Who can help me Moen or Lowes? I bought it because of the Moen brand and that it was a Lowes exclusive but  the quality does not reflects the brands.:(",
            "author": "Ivonne",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "2307b198-e21f-5975-8cbe-76df3ed34dba",
                    "largeName": "5941ab18-272f-51b4-b82b-bb46de29b7fc"
                }
            ],
            "title": "\"Truly satisfied\"",
            "rating": 5,
            "date": "04/23/2019",
            "recommended": true,
            "text": "Love the depth of this sink, with the pull out spray faucet and the soap dispenser. It's ergonomically designed too. Highly recommended!!!",
            "author": "Pheelow",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"Seems good\"",
            "rating": 4,
            "date": "02/14/2016",
            "recommended": true,
            "text": "I'm writing this review now, even though I haven't installed the sink and faucet yet just to try to help other Lowes customers, since there is only one other review, and most Lowes don't have this installed for the customers to see yet. I was obsessing over getting a nice sink and faucet myself, so I know what a pain it is to shop for them.We got this all one one set, not because we necessarily wanted to get an all in one set, but because I could not find the sign I wanted anywhere at an affordable price. We wanted an 18 gauge sink with a larger bowl on one side, and we needed one that had two holes. One for the faucet, and one for our air button for our garbage disposal. There was a similar set at Home Depot made by Glacier Bay, and we really wanted to get that one, but the faucet seemed cheap in the store, so we looked at the online reviews, and it got basically all 1 stars for either being damaged or warped out of the box, and the faucet just being plain junk.We had been looking at Lowes as well, and my local store did not even have this model in stock yet. If you've been to Lowes to look at sinks lately, you will probably notice quite a few sinks are on clearance and no longer in stock. They said they're doing a reset of the faucets shortly, but who knows when that means, and I needed a sink sooner than that. So we stopped in at another Lowes while we were traveling, and I saw this one for $379. I figured with the higher price than the other all in one sinks, and also being a Moen, this could be a bit nicer than others we had seen. I first tried to find reviews on Lowes, then on the internet in general, and I guess this is such a new model, there are hardly any to be found. Just one other one Lowes website when I posted this review, and a few on the Moen website. Not really a lot to go on, so I tried to find a similar faucet, and very similar looking models at Home Depot, and Lowes were either $199, or $219, so I figured I'd give it a shot.As I said, I haven't installed it yet, because my countertops are not installed yet, but I opened it, and the difference I can see between the faucet on the other all in one I considered and this one are night and day. This seems to be very nice quality, and the sink also seems to be well built. It's 18 gauge, so that's an immediate plus.I will update this post as soon as I have it installed, but as I said, I just wrote this review to try to help other customers who may question the quality of an all in one set they that cannot see in the store yet, or are buying online. I'd definitely give it a try.",
            "author": "paulimusmaximus",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 50,
                "no": 25
            }
        },
        {
            "title": "\"Moen 33 x 22 drop in sink\"",
            "rating": 5,
            "date": "04/10/2017",
            "recommended": true,
            "text": "Easy install. Great looking and like the ease of the switch from running to spray on the faucet.",
            "author": "Rich",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "54e6a29e-a7dd-5b95-90e3-dabd41113691",
                    "largeName": "ebb13e69-7ae1-559c-a815-800f13902cc2"
                }
            ],
            "title": "\"Minor flaws in the finish\"",
            "rating": 4,
            "date": "10/04/2018",
            "recommended": true,
            "text": "I like the quality and the looks of the sink and faucet. There are some minor flaws in the finish but they do not affect the integrity of the sink. I looked at 2 others and they also had flaws.",
            "author": "Christine",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "feb89bfd-6b41-5c97-8c5b-52cd0904906f",
                    "largeName": "5f7b481f-e6a3-5641-8623-585b9d579d2a"
                }
            ],
            "title": "\"Stainless sink\"",
            "rating": 4,
            "date": "03/12/2019",
            "recommended": true,
            "text": "The sink is beautiful and my wife really likes it however for some reason it was an 1/8” larger than the opening and we had to cut the opening larger even though it read “Drop in”",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Looking Sink and Faucet\"",
            "rating": 5,
            "date": "09/16/2016",
            "recommended": true,
            "text": "We remodeled our kitchen and chose this kit for our sink and faucet. I love the way it looks and it goes well with our counter tops. Very functional with the deeper sink. The only down side is how the sink shows water spots. We live in an area with hard water and I can see I will be having to clean the sink often to keep it looking nice. By the time the remodel was finished, there was already a scratch. Don't know how it happened, but hope that won;t be a problem with regular use. Our contractor recommended Moen to us because of the excellent warranty they offer.",
            "author": "pippin",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "02bf4e07-166b-52d1-8ca8-c7ff181acff2",
                    "largeName": "546a22c7-9141-5fc2-8391-3abf2eaf11b8"
                }
            ],
            "title": "\"Nice sink\"",
            "rating": 4,
            "date": "08/13/2018",
            "recommended": true,
            "text": "Arrived slightly bent corners but able to straighten, otherwise nice sink.",
            "author": "Troy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "0b1aedff-0a8d-5556-adc8-72c1b71cf692",
                    "largeName": "32fa3c65-2246-5d76-a8f4-ebf5b36e34d1"
                }
            ],
            "title": "",
            "rating": 5,
            "date": "01/12/2019",
            "recommended": true,
            "text": "Easy install!  Live it!",
            "author": "Resa",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"18 gauge victory.\"",
            "rating": 5,
            "date": "01/02/2017",
            "recommended": null,
            "text": "I bought this sink kit because it came with everything to replace my drop-in. Because the counter I have is barely long enough to fit the sink, the secure clamp system was a bit of work to get tightened down but the special tightening tool that came with it worked like a charm. I was impressed with the faucet that came with the kit as it did not need plumbers tape to make a water tight seal and the quick connect spigot hose was detachable so I was able to undo my mistake easily. When will I learn to read the instructions before I put it together?",
            "author": "Daddy of 2",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Leaking nightmare\"",
            "rating": 1,
            "date": "09/17/2018",
            "recommended": false,
            "text": "There is contradiction in the instructions. On page 2 it instructs to install faucet and drain fittings and accessoriesaccording to manufacturer's instructions, which include sealing the drain basket with plumbers putty. Page 4 has a drain basket diagram that has different parts than the one provided by the drain manufacturer and says not to use sealant. A rubber o-ring comes with it so then you have to decide to follow page 4 or page 2. I called Moen and was told it shouldn't matter and to go ahead and use the plumbers putty. Big mistake. After a couple of months it leaked like crazy. Now I have to figure out how to get one of these o-rings. The second issue is that water pools up in the sink away from the drain as the drain hole is not in the lowest area. Thirdly, the finish is not very scratch resistant. I could have bought a unit at half this cost if I wanted this kind of quality.",
            "author": "TJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Worst Design Ever\"",
            "rating": 1,
            "date": "09/06/2016",
            "recommended": false,
            "text": "I can only say that if I could give this a zero or negative rating, I would.  First of all, the cabinets above which I was trying to install this sink were white.  I say were, because I'm not sure they will ever be again.  The hardware that comes with the sink turns one's hands black, and I mean black.  Touch anything, and it will be black too!  Secondly, and more importantly, there was such a reverse bow to the middle of the sink, that it was destroying the sink and the countertop trying to pull the middle down flush with the countertop.  I was using a 1/2\" deep well socket with a 10\" ratchet, and you would have thought I was putting in a 3\" lag bolt with the amount of force I was applying to get it flush.  I checked the countertop to make sure it wasn't bowed, and it was perfectly straight.  Maybe I got a defective unit, but I don't have the time to find out.  I wasted an entire evening fooling with it, and had to make the decision to return it.  I'm not a contractor, but a very accomplished do-it-yourselfer having remodeled four houses, built an entire room addition, and installed upwards of ten sinks.  Everyone can have a bad experience with a product, and I was the one that had it with this one.  In my opinion, don't waste your money.  The Quickmount system is a JOKE.  There is nothing quick about it in comparison to your standard top mount hardware.  I went with Moen because they usually make quality products, but this was not one. I plan to give the push-in type a shot.",
            "author": "LongtimeDIYer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 43,
                "no": 48
            }
        },
        {
            "title": "\"Great product-but...\"",
            "rating": 4,
            "date": "09/11/2017",
            "recommended": true,
            "text": "The faucet of this combo is taller than we would have preferred as we have a cabinet above the sink area, but our options seemed limited. We liked the fact that it was 18-gauge stainless steel and really liked the larger and deeper bowls. However, I was hoping the 18-gauge would not scratch so easily. The bottom of each bowl already has marks made by the sink protector and dish rack (both have plastic coated \"feet\"). I am concerned how much worse it will get, when it has scratch marks already after only a few weeks of use.",
            "author": "JM",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Not recommended for Undermount\"",
            "rating": 1,
            "date": "03/10/2019",
            "recommended": false,
            "text": "We bought this sink as it was advertised as under mount or drop in. The counter contractor didn't recommend undermount due to the design which would lead to the sealant being visible.  If you want undermount, go for a sink made specifically for it.  We had to return it. If it was to be a drop in, it would be a five star.",
            "author": "JR",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Sink Purchase\"",
            "rating": 4,
            "date": "03/02/2019",
            "recommended": null,
            "text": "I love this sink, the size, the faucet and how it looks.  Really nice.  The only drawback is how easily it scratches.  I have a few scratches I can't scour away in the bowl I use to wash dishes and I am really careful.   I wash dishes by hand.  I will be getting a couple of those mats to put in the bowls.",
            "author": "vhall67",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"White Film on sink\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "I bought this sink and after installation there was a white film that wouldn't wash away. I noticed the plumber used a white caulking on both drains  Also, it looked like I had black scratches.. I then used Acetone, finger nail polish, to dissolve the white film which was a fine plastic coating.  Also, the scratches disappeared which told me that was caulking too.   Sink looks beautiful.  Most plumbers use a gray plumber gel on drains, so this doesn't happen. A few of the reviews had this problem of white film.",
            "author": "BEZnowski",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Sick has scratches!\"",
            "rating": 3,
            "date": "05/26/2019",
            "recommended": false,
            "text": "I love the faucet and the shape/size of the sink.  I've had the sink for 2 weeks and it has so many scratches and water stains on it.  These will not come out.  This is from normal dishes, nothing extravagant.  And I have soft water.  It looks old already.",
            "author": "Sheri",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Wife loves it\"",
            "rating": 5,
            "date": "07/01/2016",
            "recommended": true,
            "text": "Our new bathtub spigot from Moen looks and works great! It wasn't a perfect match for the obsolete model it replaced, but I swapped out the new shower diverter knob for the old one, which matches our bath style better and fits and works just as well.\n\nHopefully the new diverter will last longer than the old one. . . it leaked a lot of water after 10 years, which may have contributed to the corrosion on the spigot threads which eventually broke. The new attachment method looks like an improvement!",
            "author": "Hubby",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love my new sink/faucet combo\"",
            "rating": 5,
            "date": "02/14/2018",
            "recommended": true,
            "text": "Bought a week ago. I'm really loving it. Sprayer comes out easily and just as smooth going back in. The sink and faucet was easy to put together as well. Love how nice it looks. We really like the different size basins. Only really need bigger side when husband is home. Smaller size is perfect for my child and me when cleaning up. Sprayer does not spray hard like some sprayers do. So far I love it. Gave 5 stars for durability right now. If it breaks anytime soon will have to edit that rating.",
            "author": "Ag23",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"great sink, Moen quality control not so great\"",
            "rating": 3,
            "date": "10/13/2018",
            "recommended": true,
            "text": "First off, we love this sink.  My wife wanted this specific one, so I went to get it for her.That's where the problems started.  Sink #1 had a crease in the right hand basin, in the far right top corner.  It also had a dent that suspiciously looked like the loose mounting hardware baggy had slammed into it with some force.Returned that one.Sink #2.. it had a visible indention down the center of the entire sink.  Also, it had visible scuff marks and low spots around the faucet and soap dispenser holes.  Returned it.Sink #3...  it is not perfect, I can still see a small crease/dent in the center of it towards the front.  Also, the soap dispenser opening has a dent in it, as-if it was grabbed with needle nose pliers. I can live with that because it is covered by the dispenser.Long story short, believe the other posts about the dents/bends/etc on this.  I stuck with it because of the \"Made in the USA\" stamp on it, but also because my wife wanted it and nothing else.  But, beware, finding one in good shape is not an easy task.  I would have checked it in the store, but I honestly wasn't expecting such issues.  I didn't believe the reviews.  Lesson learned.",
            "author": "Mark",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Very Nice Sink\"",
            "rating": 4,
            "date": "01/26/2017",
            "recommended": true,
            "text": "I bought the Moen Kelsa for exactly the same reason as the ad slogan: \"For looks and for life.\" It was a heavier gauge steel than the others. It has a beautiful finish, much nicer than my bar sink of another brand. My only complaint is the handle. Even though I'm right handed, it would be more convenient if the handle were on the left side. Also could not install soap dispenser because of the way cabinet was built. Working on a workaround on that.",
            "author": "Homeowner",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great sink & faucet\"",
            "rating": 5,
            "date": "05/01/2017",
            "recommended": true,
            "text": "Great sink & faucet from Moen. I had to call them for a missing part - at my door in 2 days with zero hassle.  Couldn't ask for better customer service! Installation of the sink was complicated by my kitchen.  Sink is on a diagonal, with 45 degree dead space on either side of the sink cabinet. Both my old sink and new sink needed some of this space to fit. I had to open up more access space on both sides of the sink cabinet, and make partial covers for the bigger holes.  Everything was v-e-r-y tight, and I barely fit into sink cabinet to work (and I'm not that big!). Could not use some of the special Moen installation clips - tight space and/or access - so mounting through the countertop was a combination of clips and silicon, but it's rock-solid.  Hint: Put a safety cord on the special Moen wrench for the clips, so if you drop it in the dead space, you can get it back without removing everything and starting over.Moen suggests keeping an 8\" x 8\" space clear for the sink sprayer retraction system - a sliding weight on the hose.  Can't do that because of the supply plumbing placement, so will fabricate an open-top box for these materials to slide up and down.  Otherwise, it's moving copper shut-off valves.After the tough sink installation, the faucet was a breeze.  If your installation is as tight as mine, consider paying for installation.",
            "author": "FloridaHomeowner",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Nice Sink\"",
            "rating": 4,
            "date": "11/25/2017",
            "recommended": true,
            "text": "Sink and faucet have been in use about a month now, and they work very well.  Love the pull down sprayer and just the overall look.  The sink is also heavy guage which is nice.  My only complaint is that I find these deep sinks to be just too deep.  It hurts my back to reach down that far.  That said, this appears to be the new depth and it is handy for large pots and pans.  No complaints otherwise. Would definitely recommend.",
            "author": "Dina",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I bought this for the features\"",
            "rating": 5,
            "date": "12/04/2017",
            "recommended": true,
            "text": "I bought this to replace an older sink in a home that I just bought and installed it myself.  It was pretty much a drop in, but I had to make some adjustments in the counter top hole which was not really a surprise.  The one problem that I did have was that the faucet supply lines were about 4 inches too short, but that was not hard to overcome.  The sink and faucet look really nice and I am pleased with how it turned out.",
            "author": "David10",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good looking sink\"",
            "rating": 5,
            "date": "02/12/2016",
            "recommended": true,
            "text": "Sink and faucet look great installed. My wife loves her new faucet with the sprayer that comes out of the spout. We used to have the spray on the side in the old sink. I have installed sinks before and have to say Moen has something right with using the tool for the faucet and the sink clips. It was pretty easy tightening down the sink to counter top. I also like that I could buy a sink, faucet and drains in one box.",
            "author": "Gerry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Not a Good Combo for the Money\"",
            "rating": 3,
            "date": "11/11/2018",
            "recommended": false,
            "text": "I had an emergency and needed a sink quickly so I grabbed this combo. It seemed a bit pricy but had little time to shop for individual items. The sink is nice, strong 18 guage steel with nice finish. Installation was easy. The strainer baskets seem very cheaply made considering the price of the combo. Instructions with kit refered to a seal that was supposed to be included but wasn't. Drain basket box had different instructions. I have a lot of issues with the faucet. I does look nice and the retracting mechanism works quite well. Installation was very easy. The faucet must have some type of flow restrictor because I don't get nearly the flow rate I had before in my previous faucet which was less than 10 years old. I lowered my overall home water pressure because I have plastic water lines and trying to prevent the inevitable. I tested my faucet and it is 1.2 gal per minute and the max rating is 1.5. This is not a lot of water flowing. Now the sprayer is my least favorite. There are about 20 high pressure streams that when they hit something splash water everwhere. You have to wipe around the sink on the countertop after using it. I'd prefer more pressure on the stream and less pressure on the spray. And the other reviewer is correct that there are references to parts that are not included in the installation guide. Overall, it's a decent system but not at all worth the $369 price, I would be happy at $269. I would not buy this again knowing the quality of the faucet and strainer baskets even at $269. I would get a better faucet for sure, and probably strainer baskets also.",
            "author": "tomk1945",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Great Product\"",
            "rating": 5,
            "date": "04/29/2016",
            "recommended": true,
            "text": "Because of my age, a friend installed it for me with a little assistance on my part. The installation was easy, written directions were spot on and easy to follow, everything fit with no adjustments and/or unexpected surprises. The final product is what I expected from a company with a history of doing what's right. Both of our bathroom's as well as kitchen have Moen products, and we have had no issues.",
            "author": "Thom",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"What a waste of time and money!\"",
            "rating": 1,
            "date": "06/14/2018",
            "recommended": false,
            "text": "So I get the sink and faucet installed into my counter top, modify my drain lines to accommodate the offset drains, and then proceed to hook up the water supply lines. Here is where this whole thing falls off the rails. The water supply lines are too short to reach my valves! Now my valves are directly below the faucet and mounted to the floor of my cabinet. Moen has produced a faucet with hoses that will not reach the bottom of a standard height cabinet. I couldn't believe it.Anyway, I called Moen to see if they offer longer hoses. A customer rep informed me that their faucets come with \"standard length hoses\" and they do not offer any alternative. She told me that I would have to acquire and install an extension of some sort to adapt their faucet to my use. To summarize, \"it isn't our problem.\" That's just what you want to hear from a company who just took you for a few hundred bucks.So be warned. I'm still trying to decide if I pack up the whole thing and return it, look for another faucet or try to find a way to adapt my supply lines. Either way, I have no functioning kitchen sink until I can resolve this myself.",
            "author": "Al",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 6
            }
        },
        {
            "title": "\"Somewhat Disappointed\"",
            "rating": 4,
            "date": "01/27/2016",
            "recommended": false,
            "text": "We reviewed the specifications and asked the dealer lots of questions about the \"self-contained\" complete kitchen sink kit.Much to our surprise when the installer tried to put it in where the old sink was is did not fit. Got any idea how hard it is to make the hole bigger in a granite hard counter top?The dimensions did not tell us that there was a full size flange around the bottom of the sink, It was supposed to be a drop-in unit.Once the hole was large enough (hours) the sink fit perfectly.Then the faucet instructions were not even for the same faucet that was in the kit. Did not even look similar.Had to use trial and terror to install the faucet.The faucet is a single lever with a built in sprayer and it is of very lite material. Doesn't seem really sturdy.All this said,It is gorgeous to the eye and my wife loves it.A pretty great outcome considering all the installation hassles!!",
            "author": "naybored",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Not exactly what I expected...\"",
            "rating": 3,
            "date": "01/29/2019",
            "recommended": false,
            "text": "The sink is a nice size and the faucet works pretty well, however it drips for a few minutes after you turn off the water. My biggest complaint is that the sink scratches WAY TO EASY!!! We have had the sink installed for a couple months now and after washing our crock pot, we noticed that it scratched the sink. Other pots and pans have scratched it as well.",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A Neat Bundle\"",
            "rating": 5,
            "date": "02/28/2017",
            "recommended": true,
            "text": "Whart a clever idea - to package a faucet with the sink! At first I thought why is this sink so much more expensive, but then I realized that it came with the faucet, and it was the better bargain.\n\nBut for being a packaging nightmare, the only improvement would be to have the faucet already mounted on the sink.\n\nIt looks great; it works great.",
            "author": "Tim Wilson",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent product\"",
            "rating": 5,
            "date": "02/18/2017",
            "recommended": true,
            "text": "Ordered and received in a timely manner. Impressed by the quality and appearance of this product. Wife loves the deeper sinks and the pulldown faucet. Installation was to an existing island and required extra cutout due to the large size of this unit. That is not a negative on the sink just a fyi. A very nice product to refurbish your kitchen with.",
            "author": "storeman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Faucet was Broken\"",
            "rating": 2,
            "date": "05/14/2017",
            "recommended": false,
            "text": "I had the sink installed before the faucet, so it wasn't until everything was in, that I learned the faucet had a leak. I couldn't take it back because the sink was already attached to the counter so I had to locate and buy a new faucet cartridge in order to stop the leak. Other than that it works well now. Very frustrating installation though.",
            "author": "Matt G",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Greatest sink kit\"",
            "rating": 5,
            "date": "10/09/2016",
            "recommended": true,
            "text": "Over all the displays, I picked Moen because I knew it was a good quality sink and faucet. My father always told me to purchase Moen because of the lifetime warranty and the quality. The style is very classic so it will fit into my older kitchen and it will transform into my new kitchen when we remodel. Love my new sink and faucet!!",
            "author": "Blondie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Deep Stainless Steel Sink\"",
            "rating": 5,
            "date": "04/05/2019",
            "recommended": true,
            "text": "Well made, low sound and brighten up my small kitchen.",
            "author": "Cash",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"Deep sink\"",
            "rating": 4,
            "date": "12/16/2016",
            "recommended": true,
            "text": "I bought my first stainless and so afraid I'm gonna mess it up with spots or cause it to rust. I like to soak with bleach and it says not to in instruction. The edges have scratched from pot bottoms and pottery dish bottoms scooting from counter to sink. Changed my washing side because it's built different than my other 60/40 sink. 40 side is wider and 60 side is not as long for my draining tray. You're not to leave anything it it for long so that makes me have to remove the divider cover, sink mats,and dish drainer after doing dishes. I'm not sure if I like the faucet. It pulls down and you push a button to spay. This part is good but the hot water is up and out and if you want cold you turn down and out. That lets water drip below on the rim so always wiping to prevent spots. . My water pressure is not as large a stream so takes longer to fill. My carpenter did have to enlarge cut out from previous sink.\nIn all its nice looking and I'll become use to it.",
            "author": "Memaw",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice and easy.\"",
            "rating": 5,
            "date": "01/21/2017",
            "recommended": true,
            "text": "This item was a complete kit, everything I needed was in the box and the instructions were easy to understand. It is nice when you don't have to make extra runs to the store because you needed something you didn't think of. The unit works very smooth. This is a top of the line product that even I was able to afford.",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Faucet is Awesome\"",
            "rating": 4,
            "date": "10/09/2017",
            "recommended": true,
            "text": "Faucet is wonderful. Sink is well made. If I could improve it I'd give a ?5 degree slope front to back so that the water would drain better. I'd also wish for some type of \"backsplash\" feature behind the faucet across the back to keep water from pooling behind the lip........even 3-4 inches would likely be enough.",
            "author": "Headtexan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice stainless steel double sink\"",
            "rating": 5,
            "date": "06/09/2016",
            "recommended": true,
            "text": "Beautiful, extremely durable and spacious! The soap dispenser is a nice feature and is very easy to fill. I love the goose neck faucet and the water runs very smoothly on both stream and spray. It also has a pause feature, which is very nice when you have to move the sprayer from one sink to the other.",
            "author": "Sonya",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink\"",
            "rating": 5,
            "date": "01/23/2017",
            "recommended": true,
            "text": "The installation of the sink went very well and it looked great after it was installed. It seems to show marks from dishes easier than I hoped but it still looks nice. It polishes up nicely and shines. We had previously purchased a sink with 20 gauge but this sink with 18 gauge looks much more durable.",
            "author": "Anonymous",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"nice product\"",
            "rating": 5,
            "date": "09/11/2017",
            "recommended": true,
            "text": "good quality but when is installing a new sink ever something to get excited about. Just the normal confined space, used my own ratchet, extension and socket to get a better reach rather that the tool provided (nice try though). Clips provided are much better than what I have had to use previously.",
            "author": "sinkinstaller",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Quality, Excellent Value!\"",
            "rating": 5,
            "date": "07/20/2017",
            "recommended": true,
            "text": "I purchased the sink-faucet combo when remodeling a very old kitchen (1960??) in my mountain home. Elegant design, well-made, and good value. I love the pull down, flexible faucet and deep sinks. (The old faucets were Moen, too, installed in 1990, still working and donated to the Habitat Restore.)",
            "author": "Mountain Lady",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Happy Wife, Happy Life\"",
            "rating": 5,
            "date": "01/26/2017",
            "recommended": true,
            "text": "Our home was built in 1994 and had the original kitchen sink and on its 2nd faucet. This was the perfect sink and faucet that she had been wanting, the 9 inch deep sinks are fantastic and the single faucet is so versatile. The installation went really smooth. She's happy which means I'm happy.",
            "author": "JLG Habu",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Moen kitchen sink\"",
            "rating": 5,
            "date": "07/01/2019",
            "recommended": true,
            "text": "Easy to assemble. Some problem with hole opening. Does not leave any room for error. Old sink opening was not cut straight so we had to shave off about a quarter inch of cabinet top in order for the attachment brackets to fit and bring the sink flush with the counter top.",
            "author": "PHIC",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very  nice combination.\"",
            "rating": 4,
            "date": "02/27/2019",
            "recommended": true,
            "text": "I had sink and faucet installed on Feb 22. The pull down feature takes a little time to\nget used to.  It would be so much better if the tube had a feature that would allow it\nto be stopped lower in the sink. I am doing this using a clothes pin next to where the tube exits.",
            "author": "James 14",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Mr\"",
            "rating": 4,
            "date": "03/14/2017",
            "recommended": true,
            "text": "We have found the Moen Kelsey to exceed our expectations. We needed a Stainless steel sink that could easily handle larger pots with our large family.\n . The faucet with the 3 way spray switch is very useful.. Plan on drying the sink with a cloth to maintain the finish.",
            "author": "Greg",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Wonderful\"",
            "rating": 5,
            "date": "05/25/2016",
            "recommended": true,
            "text": "Love, love this sink and faucet.. Looks great and fits the deepest, longest and widest pans I have. Appreciate one sink being longer than the other. The faucet is so easy to use and the depth of the sink reduces the splash zone when using the spray setting on the nozzle.",
            "author": "stelgut",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Momma's gift\"",
            "rating": 4,
            "date": "03/11/2019",
            "recommended": true,
            "text": "This sink replaced one that was there. A gift for momma and she loves it. The two different  size and the pull out faucet. Solid, not  thin materials. Well worth the price. Easy to install only had to make adjustments to the line due to it was install in an older home.",
            "author": "WHITEHEAD",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"product with taste\"",
            "rating": 5,
            "date": "10/12/2016",
            "recommended": true,
            "text": "sink and faucet look really great. My wife and I love it. Had only one problem and it was with the clips. I found that they were too large for my counter. I solved it using my old clips, from there on everything else went without a hitch. Again great sink and faucet",
            "author": "bill",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/17/2019",
            "recommended": true,
            "text": "I purchased the Moen sink with faucet on Mar. 2,2019. I was lucky to have a very helpful Lowes employee named Vern to help me decide, my husband was unable come with me to help decide. The plumber came and installed it with no problems.  I love my sink and faucet.",
            "author": "Sharon",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Great all Inclusive deal\"",
            "rating": 5,
            "date": "05/23/2017",
            "recommended": true,
            "text": "I really like the fact that EVERYTHING is included, no going back and forth to the store for things. My only beef is that the quick mount system was a pain in the rear to connect to the front of my sink because there was no overhang for it to grab a hold of.",
            "author": "Scott",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent Product\"",
            "rating": 5,
            "date": "07/08/2017",
            "recommended": true,
            "text": "Just what I've always needed!! I was a little leary of the differnt sized sinks at first but have come to love them. Also the soap dispenser is a godsend. Great for a little squirt on the glasses to keep them clean!!! I love my new sing and spicket!!",
            "author": "KitchenLady",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"SINK COMBO\"",
            "rating": 4,
            "date": "04/12/2018",
            "recommended": true,
            "text": "We purchased the sink and faucet combo on the recommendation of the gentleman who was doing the work on remodeling our kitchen.  He stated it was a good deal for the cost.  It does look very nice and I like the looks of the faucet.",
            "author": "Giggee",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love my New Sink!\"",
            "rating": 5,
            "date": "01/26/2017",
            "recommended": true,
            "text": "It was time for an update and I was faced with lots of choices. Glad I chose this Moen sink with attractive faucet and hand soap dispenser. It is beautiful and really updates the look of my kitchen. It was reasonably priced, too.",
            "author": "Deborah",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink & Faucet\"",
            "rating": 5,
            "date": "11/02/2018",
            "recommended": true,
            "text": "We bought the sink and faucet from Lowe's, and we thought the price was a great deal for the combo.  My husband installed the sink over the weekend with the help of the template and instructions.  We love the sinks and faucet.",
            "author": "mary1959",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink - Faucet Combo\"",
            "rating": 4,
            "date": "11/27/2016",
            "recommended": true,
            "text": "Very. happy with this product. We wanted a sink with equal sized basins with a good depth. Good quality and looks great.\n\nTime will tell on the durabhility and reliability but right now we are quite happy with the product.",
            "author": "Luke",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Easy installation\"",
            "rating": 5,
            "date": "04/21/2019",
            "recommended": true,
            "text": "Quality product. A lot of sinks are thin 22 gauge, some are better 20 gauge this one is 18 gauge which is even thicker. Installation is easy,just be sure to per-plan out the plumbing underneath, which is true of any sink.",
            "author": "Willis",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Well made product.\"",
            "rating": 5,
            "date": "05/05/2016",
            "recommended": true,
            "text": "Purchased it Apr 5th and had it installed two days ago. So far so good. I have purchased Moen products in the past and have always been happy with them. Bottom line, you get what you pay for. By cheap, get cheap product.",
            "author": "Georgge",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great quality\"",
            "rating": 5,
            "date": "12/04/2016",
            "recommended": true,
            "text": "I have never purchased a all in one sink with faucet before. The quality of the faucet is extremely nice. We bought this for a beach house to replace a rusted cast iron sink. The stainless steel looks really nice.",
            "author": "lovestofish",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"All in one , great deal\"",
            "rating": 3,
            "date": "05/02/2016",
            "recommended": true,
            "text": "Loves the look of sink and faucet. Bigger than expected. Only thing I'm noticing, it's starting to scratch? Even though I'm careful., there's starting to be scratches on bottom. Not sure if I should use sink mat.",
            "author": "Jenn1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Classy Looking Kitchen Sink & Faucet\"",
            "rating": 5,
            "date": "04/22/2017",
            "recommended": true,
            "text": "I am very pleased with the quality and the classy look of this stainless steel sink in my kitchen. Very expensive looking presentation! This was a great addition to my kitchen remodeling project. I just love it.",
            "author": "Kitchen Gnome",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Installation Could be Easier\"",
            "rating": 4,
            "date": "02/04/2016",
            "recommended": true,
            "text": "We love the sink and faucet but the installation could have been easier. The clips that came with the sink are pretty difficult to use in a tight space and it took quite a while to actually get them into place.",
            "author": "hauckta",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Price/Nice looking\"",
            "rating": 4,
            "date": "06/09/2019",
            "recommended": null,
            "text": "We just installed Kelsa sink and I love the deep basins/soap dispenser and pull out faucet.  My only concern is the sink and hope it does not require alot of upkeep in regards to shine/luster and scratches.",
            "author": "amto",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"hanging faucet\"",
            "rating": 4,
            "date": "05/30/2019",
            "recommended": true,
            "text": "Have had for a year. Love the depth of sinks and the fact that it pulls down but i hate that the sink scratches easily and the faucet comes down and wont always stay in ace. Overall, i would purchase again",
            "author": "TJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best sink ever!!!\"",
            "rating": 5,
            "date": "11/05/2016",
            "recommended": true,
            "text": "This replaced my old stainless steel sink which was 35 years old, and I thought was a quality product. This Morn is a wonderful sink and so much better. I love the soap dispenser and the pull down sprayer.",
            "author": "Anastasia",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Beautiful addition to Kitchen\"",
            "rating": 4,
            "date": "11/18/2018",
            "recommended": true,
            "text": "I am very happy with my purchase and it fit quite well.  The only thing I upgraded because I didn'tthink they were good enough was the baskets for the drains - they were not as classy as the sink itself.",
            "author": "Angela",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love my new kitchen!\"",
            "rating": 5,
            "date": "05/18/2016",
            "recommended": true,
            "text": "I really like the spray nozzle. Easy to use pause & change spray type. Love the idea of a soap dispenser. Only in a week, but love it. Did not install myself, so can't speak of that.. A little pricey!",
            "author": "D",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent Quality\"",
            "rating": 5,
            "date": "01/30/2018",
            "recommended": true,
            "text": "Bought this as a replacement for the previously installed sink/faucet. Construction quality is first rate with no flaws noted. Faucet controls make it easy to regulate water temperature. Nicely done!",
            "author": "ToroTeacher",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Moen hits a Home Run\"",
            "rating": 5,
            "date": "02/10/2016",
            "recommended": true,
            "text": "Great product combination package. The sink and faucet look great and were pretty easy to install as a replacement for our old sink and faucet. The faucet was an easy 5 min. install and works great.",
            "author": "DTS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great sink combo\"",
            "rating": 5,
            "date": "10/16/2017",
            "recommended": true,
            "text": "I love my new Moen sink and faucet. The sink depth is great, it's quiet and the faucet is awesome. Very pleased with the purchase. We had a professional do the install so I can't review that.",
            "author": "Meemaw",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"not happy with sink\"",
            "rating": 1,
            "date": "06/04/2016",
            "recommended": false,
            "text": "my sink has been in my kitchen for 6 weeks. there are rust stains on surface it appears to have been made of inferior stainless steel.not happy will be contacting Moen customer serv.",
            "author": "tony",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Product\"",
            "rating": 5,
            "date": "07/12/2017",
            "recommended": true,
            "text": "Nice product. Plumber had difficulty with installation due to cabinet and counter issues. Once he fixed those, installation of the sink and faucet wen quickly and smoothly.",
            "author": "jody",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice Sink\"",
            "rating": 5,
            "date": "03/15/2017",
            "recommended": true,
            "text": "Sink and faucet look great. Had an issue as the instructions to install the drains that came with the sink did not match the box the drains came in. Needed plumbers putty.",
            "author": "Karen M",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink and Fauchet\"",
            "rating": 5,
            "date": "03/28/2017",
            "recommended": true,
            "text": "A new sink was needed and my wife and I looked at many. We decided on the Moen all in one complete. The choice was the best we could have made. Moen makes great products.",
            "author": "Jet21",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Looks good, works good\"",
            "rating": 5,
            "date": "03/05/2016",
            "recommended": true,
            "text": "It was just installed yesterday so, I cannot make any long range comments. It look really good and I like the features and the fact that it was assembled in the USA!",
            "author": "HogHead",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"FAUCET SEEMS OF POOR QUALITY\"",
            "rating": 3,
            "date": "12/03/2016",
            "recommended": false,
            "text": "I believe the stainless steel sink is a good piece but for the life of me I can not understand why you chose to cheapen the deal with such a poor quality faucet.",
            "author": "Larry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"love it\"",
            "rating": 5,
            "date": "01/23/2017",
            "recommended": true,
            "text": "This sink was exactly what I wanted and more. I wanted the larger sink on one side, but I did not realize I was also getting a deeper sink and a great faucet.",
            "author": "CADB",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Kitchen\"",
            "rating": 4,
            "date": "03/05/2016",
            "recommended": true,
            "text": "Faucet installed very easy ! Looks great with the matching sink. Have not had it long enough to commit on quality but Moen speaks for it's self in that area.",
            "author": "John",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Moen stainless steel doublesink and faucet\"",
            "rating": 5,
            "date": "02/17/2019",
            "recommended": true,
            "text": "This is a nice sink and faucet combination for the money. It was on sale and that made it even better. We haven't put it in yet but am sure we will like it.",
            "author": "Barbie71",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Double Well S/S Kitchen Sink w/Faucet\"",
            "rating": 5,
            "date": "03/12/2018",
            "recommended": true,
            "text": "I bought this sink/faucet last week and so far, am very happy with it.  Installation was straight forward and very routine and it looks nice in my kitchen.",
            "author": "Lanzam",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Durable and well built\"",
            "rating": 4,
            "date": "02/26/2018",
            "recommended": true,
            "text": "I would've given this a 5 Star overall rating but the anchors for the sink with the twisted bolt we're a massive pain, otherwise love the sink and faucet.",
            "author": "Tmwhiteaker",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink\"",
            "rating": 5,
            "date": "02/09/2019",
            "recommended": null,
            "text": "This sink was easy to install and feels sturdy.  The sink has a nice look to it and plenty of space on each side to accommodate dirty and clean dishes.",
            "author": "Joe",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great\"",
            "rating": 5,
            "date": "07/18/2016",
            "recommended": true,
            "text": "Had professional install and he was amazed that everything he needed was in the box; exception was sealant. Easy install he said and it looks amazing",
            "author": "sister",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink and Fauchet\"",
            "rating": 5,
            "date": "03/28/2017",
            "recommended": true,
            "text": "A new sink was needed and my wife and I looked at many. We decided on the Moen all in one complete. The choice was the best we could have made. Moen makes great products.",
            "author": "Jet21",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Looks good, works good\"",
            "rating": 5,
            "date": "03/05/2016",
            "recommended": true,
            "text": "It was just installed yesterday so, I cannot make any long range comments. It look really good and I like the features and the fact that it was assembled in the USA!",
            "author": "HogHead",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"FAUCET SEEMS OF POOR QUALITY\"",
            "rating": 3,
            "date": "12/03/2016",
            "recommended": false,
            "text": "I believe the stainless steel sink is a good piece but for the life of me I can not understand why you chose to cheapen the deal with such a poor quality faucet.",
            "author": "Larry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"love it\"",
            "rating": 5,
            "date": "01/23/2017",
            "recommended": true,
            "text": "This sink was exactly what I wanted and more. I wanted the larger sink on one side, but I did not realize I was also getting a deeper sink and a great faucet.",
            "author": "CADB",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Kitchen\"",
            "rating": 4,
            "date": "03/05/2016",
            "recommended": true,
            "text": "Faucet installed very easy ! Looks great with the matching sink. Have not had it long enough to commit on quality but Moen speaks for it's self in that area.",
            "author": "John",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Moen stainless steel doublesink and faucet\"",
            "rating": 5,
            "date": "02/17/2019",
            "recommended": true,
            "text": "This is a nice sink and faucet combination for the money. It was on sale and that made it even better. We haven't put it in yet but am sure we will like it.",
            "author": "Barbie71",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Double Well S/S Kitchen Sink w/Faucet\"",
            "rating": 5,
            "date": "03/12/2018",
            "recommended": true,
            "text": "I bought this sink/faucet last week and so far, am very happy with it.  Installation was straight forward and very routine and it looks nice in my kitchen.",
            "author": "Lanzam",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Durable and well built\"",
            "rating": 4,
            "date": "02/26/2018",
            "recommended": true,
            "text": "I would've given this a 5 Star overall rating but the anchors for the sink with the twisted bolt we're a massive pain, otherwise love the sink and faucet.",
            "author": "Tmwhiteaker",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink\"",
            "rating": 5,
            "date": "02/09/2019",
            "recommended": null,
            "text": "This sink was easy to install and feels sturdy.  The sink has a nice look to it and plenty of space on each side to accommodate dirty and clean dishes.",
            "author": "Joe",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great\"",
            "rating": 5,
            "date": "07/18/2016",
            "recommended": true,
            "text": "Had professional install and he was amazed that everything he needed was in the box; exception was sealant. Easy install he said and it looks amazing",
            "author": "sister",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"New Sink & Faucet\"",
            "rating": 5,
            "date": "05/21/2017",
            "recommended": true,
            "text": "My old sink wasn't that old but poorly made. I respect the Moen name and easily found sink and faucet combination I liked",
            "author": "nonny",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Heebanator\"",
            "rating": 4,
            "date": "07/25/2016",
            "recommended": true,
            "text": "Replaced a new faucet in our new home with this one due to other being lesser quality.Great quality and easy to install.",
            "author": "Anonymous",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very Nice Product\"",
            "rating": 5,
            "date": "10/31/2016",
            "recommended": true,
            "text": "This is a really nice sink and faucet combination. It wasn't that hard to install and the instruction were very good.",
            "author": "Budster97",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"What a sink!!\"",
            "rating": 5,
            "date": "02/28/2018",
            "recommended": true,
            "text": "Absolutely the best sink/faucet unit I've seen! My plumber said it's one of the best looking sinks he has installed!",
            "author": "DaveD123",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome sink/faucet combo\"",
            "rating": 5,
            "date": "03/05/2018",
            "recommended": true,
            "text": "We live our new moen sink/faucet combo! Not only was it a good deal but it is great quality and a beautiful sink!!",
            "author": "Photoash82",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Sink\"",
            "rating": 5,
            "date": "10/03/2018",
            "recommended": true,
            "text": "Easy upkeep and beautiful stainless with matching faucet. Good deal and retails on line for over double the price.",
            "author": "Cindy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Looks\"",
            "rating": 5,
            "date": "12/03/2016",
            "recommended": true,
            "text": "The Kelsa Sink kit looks and works great. Had a professional install as they had to enlarge the counter top cutout",
            "author": "DeltaJoe",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"So far so good\"",
            "rating": 5,
            "date": "03/01/2019",
            "recommended": true,
            "text": "I've had this set for about 2 weeks now and I love it.  It looks good and work perfect.  Definitely recommended",
            "author": "Doctor",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very very good\"",
            "rating": 5,
            "date": "11/21/2018",
            "recommended": true,
            "text": "Old sink done it's time. After looking at many models we settled on this. It is just wonderful. Thanks moen",
            "author": "Tony 1960",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best Built Kitchen Sink\"",
            "rating": 5,
            "date": "11/29/2017",
            "recommended": true,
            "text": "Great-made Kitchen sink. Durable, Design is beautiful. Noise Reduction. Easy to install. Faucet is a plus.",
            "author": "TaeMee",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Deep sink\"",
            "rating": 5,
            "date": "12/27/2018",
            "recommended": true,
            "text": "We need a deep sink in our kitchen. This one fit the bill. It comes with all hardware at a great price.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I love it\"",
            "rating": 5,
            "date": "02/03/2017",
            "recommended": true,
            "text": "Great sink/faucet combo.I didn't realize how much I would like the pull down spout until I used it.",
            "author": "Hondo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice 18 gauge sink set\"",
            "rating": 5,
            "date": "09/12/2018",
            "recommended": true,
            "text": "Replaced the old nasty looking porcelain sink in the house, it went in easy and looks beautiful!",
            "author": "nhusted",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Not easier\"",
            "rating": 5,
            "date": "04/02/2017",
            "recommended": true,
            "text": "Clips were not that user friendly and sink baskets were not the ones shown in instructions.",
            "author": "Chipmunk",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"very satisfied\"",
            "rating": 5,
            "date": "06/30/2017",
            "recommended": true,
            "text": "I love my new faucet and sink. It looks wonderful with my new appliances i just purchased.",
            "author": "lori22",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great all in one sink!\"",
            "rating": 5,
            "date": "12/21/2018",
            "recommended": true,
            "text": "Was very pleased on the quality not only the sink but the faucet exceeded my expectations!",
            "author": "Robert",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Real Nice\"",
            "rating": 5,
            "date": "01/17/2017",
            "recommended": true,
            "text": "Great sink .. looks durable and stylish ! Finish is shiny and looks so good in my kitchen",
            "author": "LR",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome Products Presentation\"",
            "rating": 5,
            "date": "07/21/2017",
            "recommended": true,
            "text": "Excellent Product information and perfect DIY instructions provided! Thank you very much.",
            "author": "Andres(Andy)",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Looks Great; Works Great\"",
            "rating": 5,
            "date": "03/28/2018",
            "recommended": true,
            "text": "This is a quality product. I may consider replacing all of my bathroom faucets with Moen.",
            "author": "Finovite",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Well built. Sturdy sink\"",
            "rating": 5,
            "date": "11/10/2018",
            "recommended": true,
            "text": "I like the rail mounts along the bottom edge of the sink. Makes installation very easy.",
            "author": "bholly",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Moen Kelsa All in One Sink Kit -\"",
            "rating": 5,
            "date": "10/27/2018",
            "recommended": true,
            "text": "Super easy to install.  Love that it is all in one!  Everything you need is in the box.",
            "author": "Pearl",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Not what they used to be for quality\"",
            "rating": 3,
            "date": "04/02/2016",
            "recommended": null,
            "text": "We were getting a new counter top installed, and I figured might as well update the sink at the same time.\n\nTo start off with there were items missing from the box, I had to call the support line and request they send out the missing mount kit for the faucet, glad that I at least checked the items in the box ahead of time instead of waiting for the day the counter was to be installed. On installation day when I went to install the sink it turned out that the sink was bowed about 3/16 of an inch both front to back and side to side, with the center point being high. Not sure if that was by design or not, but it made it impossible with the provide number of mounting clips to get the sink to pull down to the counter and seal. Fortunately for me the mounting clips from the old sink fit the clip tracks under the sink and I was able to add them in to supplement the supplied clips for the new sink. It took all 10 of the supplied clips and 8 of the old clips to get the sink to pull down flush with the counter top.\n\nMOEN, if the bow in the sink is intentional for the purpose of getting the corners of the sink to be tight to the counter top I suggest that you double the number of supplied clips to 20.",
            "author": "PapaT",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Moen Kelsa Sink/Faucet Combination\"",
            "rating": 5,
            "date": "07/22/2016",
            "recommended": true,
            "text": "Awesomely easy to install and is everything we wanted in a sink/faucet combination.",
            "author": "Dave",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good value\"",
            "rating": 4,
            "date": "07/10/2017",
            "recommended": true,
            "text": "product was a complete package and installation was easy. Stainless does scratch.",
            "author": "Gary",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Me\"",
            "rating": 4,
            "date": "11/14/2016",
            "recommended": true,
            "text": "Quality construction.made in the USA. First install of a sink ever. Quite easy.",
            "author": "Rich",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"God Looking\"",
            "rating": 5,
            "date": "11/28/2017",
            "recommended": true,
            "text": "I purchased the sink with the faucet.  It works great and is verry attractive.",
            "author": "TAXPATH",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"wonderfulproduct\"",
            "rating": 5,
            "date": "07/19/2016",
            "recommended": true,
            "text": "just recently was installed. has a nice classic look to it and a nice design",
            "author": "ikie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"excellent\"",
            "rating": 5,
            "date": "03/14/2017",
            "recommended": true,
            "text": "very pleased with this sink. looks wonderful and was very easy to install.",
            "author": "nacter",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Value\"",
            "rating": 4,
            "date": "11/04/2017",
            "recommended": true,
            "text": "Instructions were good.  Good Price point.  Nice to have all in one kit.",
            "author": "vclay",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works wonderful\"",
            "rating": 5,
            "date": "01/19/2018",
            "recommended": true,
            "text": "We are very pleas with the quality, the way it operates and the it looks",
            "author": "Juan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Sink all in one\"",
            "rating": 5,
            "date": "05/03/2016",
            "recommended": true,
            "text": "My plumber told us to get a Moen, said you can NOT go wrong with a Moen",
            "author": "Linda",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"The Best Sink\"",
            "rating": 5,
            "date": "08/13/2016",
            "recommended": true,
            "text": "It functions well, as a complete kit. All the stuff needed is included.",
            "author": "Davy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great sink and faucet combo\"",
            "rating": 5,
            "date": "03/28/2018",
            "recommended": true,
            "text": "Just installed last week but love it !  Looks nice in my kitchen.",
            "author": "koko",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Style\"",
            "rating": 5,
            "date": "01/23/2018",
            "recommended": true,
            "text": "Was looking for a sink that one side was bigger.  This was great",
            "author": "Sandy43",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"picked because of previous satisfaction\"",
            "rating": 5,
            "date": "05/03/2017",
            "recommended": null,
            "text": "Purchased pickedMoen because of previous satisfaction with Moen",
            "author": "jhrjr",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"love the look\"",
            "rating": 5,
            "date": "12/28/2017",
            "recommended": true,
            "text": "Bought this week very happy with the change in looks of kitchen",
            "author": "Tori",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great\"",
            "rating": 5,
            "date": "10/08/2016",
            "recommended": true,
            "text": "Exactly what we wanted and at a great price. Easy to install.",
            "author": "Blessed",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Beautiful product\"",
            "rating": 5,
            "date": "12/25/2017",
            "recommended": true,
            "text": "I am impressed with the quality and simplicity of the product",
            "author": "larrythetarheel",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"5726A\"",
            "rating": 5,
            "date": "02/13/2018",
            "recommended": true,
            "text": "excellent craftmenship great accesorieseasy installation",
            "author": "george the chief",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great sink\"",
            "rating": 5,
            "date": "06/12/2019",
            "recommended": true,
            "text": "This is my first morning sink and I love it. Very nice",
            "author": "Regina",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"good value\"",
            "rating": 4,
            "date": "03/12/2018",
            "recommended": true,
            "text": "Moen kit has everything I need for a new sink install.",
            "author": "sl11",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very good product\"",
            "rating": 4,
            "date": "08/04/2016",
            "recommended": true,
            "text": "Good solid complete sink, easy install, looks great!!",
            "author": "ucoft",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great stainless\"",
            "rating": 5,
            "date": "11/23/2017",
            "recommended": true,
            "text": "Just bought it and had it installed but great so far",
            "author": "KenEarl",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great service\"",
            "rating": 5,
            "date": "05/07/2016",
            "recommended": true,
            "text": "Great product very efficient and easy installation.",
            "author": "Miley",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"nice to have sink and facet together!\"",
            "rating": 4,
            "date": "12/30/2017",
            "recommended": true,
            "text": "bought and had it installed .. nice sink and facet!",
            "author": "Mandy58",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Product\"",
            "rating": 5,
            "date": "07/21/2017",
            "recommended": true,
            "text": "Nice looking sink and faucet at a reasonable price",
            "author": "FL Res",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "12/03/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jattie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/05/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Pete",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/17/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Keno",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/04/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "PD",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/09/2017",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "dbvilla",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "12/04/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Armani",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/01/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "L",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "images": [],
            "title": "\"Not as good as I was hoping.\"",
            "rating": 3,
            "date": "10/01/2018",
            "recommended": false,
            "text": "Just had the sink-faucet combo installed and overall I'm mildly pleased but not overly excited. The sink combo looks nice and works well but with a few somewhat minor flaws.First, the damage after unpacking it, we found a few minor scratches on the left side of the sink and to the right of the faucet that are annoying but nothing can be done about that.... and also (very annoying) the left front corner of the sink was bent. Whether this was due to shipping or was packaged this way there is no way of telling. Was hoping once the sink was dropped into place and tightened down it would straighten out, but the bend is still visible. Probably should have returned it to Lowe's but I did not.Second, the flaws I am noticing... When I turn off the faucet, it will continue to drip water, with what seems to be a build up in the faucet head for the next 15 or so seconds, leaving a puddle of water in the sink that needs to be wiped up, where it should have an immediate seal as soon as the water is turned off.The SS also leaves streaks which are really hard to come out when wiping down the sink. I was hoping the 18 gage would be a good grade of SS but this just doesn't seem to be a better grade.I was hoping for better and aside from my complaints the sink and faucet look nice and perform to what can be expected, but really nothing more.I installed this with a new Insinkerator garbage disposal, also from Lowes, and that works very well. If I had to do this over, I would look to a stand alone sink and faucet of better grade and quality. So saving a little money on the combo was nice but overall not worth it for me.",
            "author": "Peter",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        }
    ],
    "reviewStats": {
        "reviewCount": 174,
        "percentRecommended": "82",
        "averageStars": "4.4",
        "starCounts": {
            "five": 111,
            "four": 39,
            "three": 15,
            "two": 2,
            "one": 7
        }
    },
    "questions": [
        {
            "question": "\"Does the pull down faucet have both steam and spray?\"",
            "author": "Anonymous",
            "date": "02/29/2016",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "11/09/2018",
                    "text": "Hello and thank you for your interest in Moen products. The Moen Kelsa 22-in x 33-in Stainless Steel Double-Basin Drop-In Or Undermount 2-Hole Residential Kitchen Sink All-in-One Kit provides a dual function spray wand. The pulldown wand features a focused water stream and an aerated showering spray option. If you have additional questions, please feel free to call us at 800-289-6636.",
                    "helpful": {
                        "yes": 5,
                        "no": 0
                    }
                },
                {
                    "author": "steve",
                    "date": "10/10/2017",
                    "text": "Yes",
                    "helpful": {
                        "yes": 14,
                        "no": 1
                    }
                },
                {
                    "author": "Electro",
                    "date": "03/06/2016",
                    "text": "Yes. And it switches; you don't have to hold a button.",
                    "helpful": {
                        "yes": 25,
                        "no": 2
                    }
                },
                {
                    "author": "Fusion12",
                    "date": "03/02/2016",
                    "text": "Yes it does.",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "02/29/2016",
                    "text": "Yes, the faucet has both stream and spray features.",
                    "helpful": {
                        "yes": 10,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"The faucet drops down when the pressure is shut off. How can I adjust this so the spray head stays in place once the water is shut off?\"",
            "author": "TheCarpenter",
            "date": "02/09/2017",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "06/28/2018",
                    "text": "Hello TheCarpenter and thank you for your interest in Moen products. The hose weight needs an adjustment on the hose. The hose has a label where the hose weight should be located on the hose. For further assistance, please feel free to call us at 800-289-6636. Our current business hours are Monday through Thursday from 9:00 am – 5:30 pm, and Friday 9:00 am – 4:30 am (Eastern Time).",
                    "helpful": {
                        "yes": 8,
                        "no": 0
                    }
                },
                {
                    "author": "TheCarpenter",
                    "date": "02/10/2017",
                    "text": "I solved this problem by moving the weight to the \"white\" mark on the spray hose. It works great now. Nothing in the instructions said this, but it works perfectly now.",
                    "helpful": {
                        "yes": 15,
                        "no": 2
                    }
                },
                {
                    "author": "Electro",
                    "date": "02/09/2017",
                    "text": "Sounds like you need to move the weight closer to the spray head.",
                    "helpful": {
                        "yes": 7,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"Is there Insert racks for both sides of sink?\"",
            "author": "Mo",
            "date": "12/04/2016",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "10/05/2018",
                    "text": "Hello Mo and thank you for your interest in Moen products. The Moen Kelsa 22-in x 33-in Stainless Steel Double-Basin Stainless Steel Drop-In 2-Hole Residential Kitchen Sink All-in-One Kit basin measure 14x18x9 and 14x16x9 with recessed drain openings. The GA782B sink grid would fit the right-hand bowl. If you have additional questions, please feel free to call us at 800-289-6636. Our current business hours are Monday through Friday from 8:00 am - 7:00 pm (Eastern Time).",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                },
                {
                    "author": "Karen",
                    "date": "02/21/2017",
                    "text": "Not Moen specific but I've found a lot of great options online including telescoping racks that fit over the sink instead of in it. Various sizes and finishes.",
                    "helpful": {
                        "yes": 5,
                        "no": 3
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "12/07/2016",
                    "text": "No, there is not insert racks for both sides of the sink.",
                    "helpful": {
                        "yes": 8,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Can you replace the faucet, if and when it breaks or gets old? Or is it attacjed permanently?\"",
            "author": "flex",
            "date": "06/14/2016",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "12/20/2018",
                    "text": "Hello flex and thank you for your interest in Moen products. The Moen Kelsa 22-in x 33-in Stainless Steel Double-Basin Drop-In or Undermount 2-Hole Residential Kitchen Sink All-in-One Kit includes the pulldown faucet which uses the Moen 113173 mounting hardware. The hardware can be removed using the Moen 118305 installation tool. If the faucet becomes irreparable, the faucet can be removed and replaced. If you have additional questions, please feel free to call us at 800-289-6636. Our current business hours are Monday through Friday from 8:00 am - 7:00 pm (Eastern Time).",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                },
                {
                    "author": "TheCarpenter",
                    "date": "02/09/2017",
                    "text": "Yes, but if it breaks, contact MOEN and they should send replacement parts for free.",
                    "helpful": {
                        "yes": 7,
                        "no": 4
                    }
                },
                {
                    "author": "none",
                    "date": "07/18/2016",
                    "text": "Yes. Just like almost every other sink.",
                    "helpful": {
                        "yes": 8,
                        "no": 6
                    }
                }
            ]
        },
        {
            "question": "\"How tall is faucet?\"",
            "author": "Anonymous",
            "date": "06/02/2016",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "11/09/2018",
                    "text": "Hello and thank you for your interest in Moen products. The Moen 21538 Kelsa 22-in x 33-in Stainless Steel Double-Basin Drop-In Or Undermount 2-Hole Residential Kitchen Sink All-in-One Kit faucet has a height of 16-1/16”. If you have additional questions, please feel free to call us at 800-289-6636. Our current business hours are Monday through Friday from 8:00 am - 7:00 pm (Eastern Time).",
                    "helpful": {
                        "yes": 4,
                        "no": 1
                    }
                },
                {
                    "author": "Electro",
                    "date": "06/02/2016",
                    "text": "From the sink top to the top of the goose-neck measures 16-1/4\". From the sink bottom to the pull-out sprayer bottom measures 17-1/2\".",
                    "helpful": {
                        "yes": 20,
                        "no": 2
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "06/02/2016",
                    "text": "The faucet, from the sink base, is 16 1/16 inches tall.",
                    "helpful": {
                        "yes": 5,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Where is the hole for the dishwasher aerator?\"",
            "author": "Anonymous",
            "date": "02/23/2016",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "09/28/2018",
                    "text": "Hello and thank you for your interest in Moen products. The Moen Kelsa 22” x33” Stainless Steel Double-Basin Stainless Steel Drop-In 2-Hole Residential Kitchen Sink All-in-One Kit has a hole for a soap dispenser which can be removed to accommodate the Air Gap for your disposer. If you have additional questions, please feel free to call us at 800-289-6636. Our business hours are 8:00 am – 7:00 pm Monday through Friday (EST).",
                    "helpful": {
                        "yes": 1,
                        "no": 2
                    }
                },
                {
                    "author": "JD",
                    "date": "12/31/2016",
                    "text": "There is none, But you have the option to switch out the soap dispenser with an aerator also carried at Lowes. The unit matches up with configuration so you would never know the difference.",
                    "helpful": {
                        "yes": 21,
                        "no": 2
                    }
                },
                {
                    "author": "Electro",
                    "date": "02/23/2016",
                    "text": "I am not sure how it is not the flexible tube that connects the dishwasher to the disposal. Never saw a sink with that hole.",
                    "helpful": {
                        "yes": 5,
                        "no": 28
                    }
                }
            ]
        },
        {
            "question": "\"What is the gauge of the stainless steel on the item #748622. Also I would like to know the item # of the faucet that comes with it, if sold individu\"",
            "author": "Anonymous",
            "date": "02/09/2016",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "09/28/2018",
                    "text": "Hello and thank you for your interest in Moen products. The Moen Kelsa 22” x 33” Stainless Steel double-Basin Stainless Steel Drop-In 2-Hole Residential Kitchen sink All-in-One Kit has a sink that is 18 Gauge Stainless Steel. The faucet is the Kelsa and is not sold separately. If you have additional questions, please feel free to call us at 800-289-6636. Our business hours are 8:00 am – 7:00 pm Monday through Friday (EST).",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "02/12/2016",
                    "text": "The sinks gauge is 18.",
                    "helpful": {
                        "yes": 27,
                        "no": 3
                    }
                },
                {
                    "author": "Electro",
                    "date": "02/09/2016",
                    "text": "I just installed one in my kitchen, and I believe it was 18 gauge, which was easily confirmed by clicking on the specifications tab. The only faucet that looks/sounds identical to this one is Lowe's item 297431. My wife and I both love the faucet.",
                    "helpful": {
                        "yes": 7,
                        "no": 4
                    }
                }
            ]
        },
        {
            "question": "\"what are the bowl sizes\"",
            "author": "Anonymous",
            "date": "10/01/2018",
            "answers": [
                {
                    "author": "CommunityAnswer",
                    "date": "10/09/2018",
                    "text": "This product has two basins with the following dimensions: 14 width x 9 depth x (left side) front to back 18 x (right side) 16 front to back in inches.",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                },
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "10/02/2018",
                    "text": "Hello and thank you for your interest in Moen products. The Kelsa 22-in x 33-in Stainless Steel Double-Basin Stainless Steel Drop-In 2-Hole Residential Kitchen Sink All-in-One Kit has to different bowl sizes. The left bowl size is 14”x18”x9” and the right bowl size is 14”x16”x9”. If you have additional questions, please feel free to call us at 800-289-6636. Our current business hours are Monday through Friday from 8:00 am - 7:00 pm (Eastern Time).",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"what are the height dimensions of the faucet\"",
            "author": "curious",
            "date": "02/25/2018",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "05/25/2018",
                    "text": "Hello curious and thank you for your interest in Moen products. The Moen Kelsa 33-in x 22-in Double-Basin Stainless Steel Drop-in or Undermount 2-Hole Residential Kitchen Sink All-In-One Kit faucet is specified at a spout height of 16-1/16” inches with an outward reach of 7-7/8” inches. If you have additional questions, please feel free to call us at 800-289-6636.",
                    "helpful": {
                        "yes": 8,
                        "no": 0
                    }
                },
                {
                    "author": "Electro",
                    "date": "02/25/2018",
                    "text": "Countertop to highest point of gooseneck: 16” Countertop to bottom of pullout swiveling spigot: 8-1/2”",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Is the wash bowl and soap dispenser available on the left side\"",
            "author": "Jim",
            "date": "11/18/2017",
            "answers": [
                {
                    "badgeName": "cf555a9b-f46d-5449-9e46-d7dfb5a60c3d",
                    "author": "Moen",
                    "date": "12/29/2017",
                    "text": "Hello Jim and thank you for your interest in Moen products. The Moen Kelsa 33-in x 22-in Double-Basin Stainless Steel Drop-in or Undermount 2-Hole Residential Kitchen Sink All-In-One Kit is only available with the wash bowl and dispenser on the right side. If you have additional questions, please feel free to call us at 800-289-6636. Our normal business hours are Monday through Friday from 8:00 am - 7:00 pm (Eastern Time).",
                    "helpful": {
                        "yes": 6,
                        "no": 0
                    }
                },
                {
                    "author": "Electro",
                    "date": "11/18/2017",
                    "text": "No.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        }
    ]
}