{
    "descriptions": {
        "overview": "This CRAFTSMAN V20 13-in String Trimmer/Edger features a high efficiency motor for powerful performance. The string trimmer is powered by a high performance 4.0 AH lithium ion battery, providing the runtime to complete up to a 1/3 acre property, and compatibility across other V20 CRAFTSMAN tools. The string trimmer features a push button feed system allowing you to control the line feed with the push of a button, a 13-in cutting swath with single 0.080-in twisted line to help you get the job done quickly, 2 speed settings letting you choose more power or more runtime, an ergonomic telescoping pole featuring a turn to edge capability, and an adjustable auxiliary handle for better ergonomics and control. Part of the VERSATRACK™ Wall Organization System. Backed by CRAFTSMAN 3 year limited warranty, 90 day money back guarantee.",
        "list": [
            "Part of the V20 Cordless System",
            "Part of the VERSATRACK™ Wall Organization System",
            "2 Speed Settings - Letting you choose more power or more runtime",
            "Ergonomic Telescoping Pole - Featuring turn to edge capability",
            "Push Button Feed System - Allowing you to control the line feed with the push of a button, a 13-in cutting swath with single 0.080-in twisted line",
            "Up to 45 Minutes per charge",
            "Compatible with the VERSATRACK™ Wall Organization System; Hanging hook is an integrated part of the tool, ready for use right out of the box",
            "Includes CMCST910 13-in string trimmer/edger, CMCB402 V20 MAX 4.0 AH battery, V20 MAX lithium ion charger, spool, auxiliary handle and guard"
        ]
    },
    "specs": [
        {
            "title": "Adjustable Height",
            "spec": 1
        },
        {
            "title": "Battery Included",
            "spec": 1
        },
        {
            "title": "Battery Recharge Time (Hours)",
            "spec": "2"
        },
        {
            "title": "Battery Voltage",
            "spec": "20-volt max"
        },
        {
            "title": "Best Use",
            "spec": "Up to 1/2 acre"
        },
        {
            "title": "Brushless",
            "spec": 0
        },
        {
            "title": "Commercial/Residential",
            "spec": "Residential"
        },
        {
            "title": "Cutting Swath (Inches)",
            "spec": "13"
        },
        {
            "title": "Edger Capable",
            "spec": 1
        },
        {
            "title": "Fast Charger Included",
            "spec": 1
        },
        {
            "title": "Line Feed",
            "spec": "Automatic"
        },
        {
            "title": "Number of Batteries Included",
            "spec": "1"
        },
        {
            "title": "Package Contents",
            "spec": "13-in string trimmer, V20 MAX 4.0 AH battery, V20 MAX charger, instruction manual"
        },
        {
            "title": "Recommended Line Diameter (Inches)",
            "spec": "0.08"
        },
        {
            "title": "Series Name",
            "spec": "V20"
        },
        {
            "title": "Shaft Length (Inches)",
            "spec": "45"
        },
        {
            "title": "Shaft Type",
            "spec": "Straight"
        },
        {
            "title": "Single or Dual Line Feed",
            "spec": "Single"
        },
        {
            "title": "Sub-Brand",
            "spec": "N/A"
        },
        {
            "title": "Warranty",
            "spec": "3-year limited"
        },
        {
            "title": "Weight (lbs.)",
            "spec": "6.7"
        },
        {
            "title": "UNSPSC",
            "spec": "27112700"
        },
        {
            "title": "ETL Safety Listing",
            "spec": 0
        },
        {
            "title": "Lowe's Exclusive",
            "spec": 0
        },
        {
            "title": "CA Residents: Prop 65 Warning(s)",
            "spec": "Yes"
        },
        {
            "title": "CSA Safety Listing",
            "spec": 1
        },
        {
            "title": "UL Safety Listing",
            "spec": 1
        }
    ],
    "reviews": [
        {
            "title": "\"Shocked\"",
            "rating": 5,
            "date": "06/14/2019",
            "recommended": true,
            "text": "So, I was a bit skeptical about purchasing a battery operated trimmer, unsure if it would be powerful enough to do a thorough job, but so far I am glad I did! Take note that I have only used it one time, but I was immediately surprised. I don't have the biggest yard, however the battery lasted all the way through the job, about 40 minutes. I am pretty sure it wasn't fully charged as well. I placed it on the charger out of the box while I mowed. Once I was done the charger was still flashing, indicating it wasn't fully charged yet. The line advance feature via button works great. I did have to remove the spoil once because the string included was a bit tangled. No complaints.",
            "author": "adjohn327",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 23,
                "no": 0
            }
        },
        {
            "title": "\"Perfect for my little yard\"",
            "rating": 5,
            "date": "04/07/2019",
            "recommended": true,
            "text": "I have a small from yard maybe about 10' x 12' but I had weeds about a foot and half tall. I went to the store to look for a gas trimmer but I saw these battery trimmers and I though this will be great (no gas mixing, priming, and pull string start). I was a little worried that it only had one string trimmer but it worked great. And the automatic string feeder was awesome. I opted for the 4AH version since the battery will hopefully last a little longer. The trimmer does have 2 speed hi and low and the battery did last awhile on low speed. I did the whole yard and battery was indicating about half. Then I switched it to high to use the edger and then it died pretty quickly. But O/A it worked great for me and it did the job.",
            "author": "Joe",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 53,
                "no": 8
            }
        },
        {
            "title": "\"Perfect for the average homeowner\"",
            "rating": 5,
            "date": "03/30/2019",
            "recommended": true,
            "text": "Overall, I am pretty impressed with this trimmer. Battery life was great, I was able to mow about 1/3 acre yard on two charges. The trimmer has more than enough power for use, I usually was able to keep it in \"low\" and occasionally would switch it to high just for a couple of seconds to take down heavier brush. The edger function works wonderfully for a average homeowner, but I would not use the edger for professional landscaping. Great edition to my craftsman tools!",
            "author": "Nathan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 93,
                "no": 1
            }
        },
        {
            "title": "\"Trimmer with 4ah battery\"",
            "rating": 5,
            "date": "04/02/2019",
            "recommended": true,
            "text": "I purchased the Craftsman trimmer with the 20V 4 ah battery. I chose the larger capacity battery after reading other reviews.  The larger capacity battery allowed me to trim my entire yard without having to recharge the battery. My yard trimming area covers almost an acre and reports on smaller battery capacity needed recharge on larger lots. I also like the string push button feed.",
            "author": "JamesStrassburg",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 71,
                "no": 1
            }
        },
        {
            "title": "\"Surprised\"",
            "rating": 5,
            "date": "03/06/2019",
            "recommended": true,
            "text": "Was skeptical about a battery powered trimmer, usually use a gas one. When my gas trimmer gave out and looked for a new one, I saw some reviews on this one, went to Lowes and checked it out. It works just as good as my gas trimmer did. I like that it needs no gas and the battery lasts long enough for me to trim the yard 4-5 times without recharging ( I have a small to medium size yard).",
            "author": "Dallas",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 100,
                "no": 8
            }
        },
        {
            "title": "\"Awesome product!\"",
            "rating": 4,
            "date": "04/07/2019",
            "recommended": true,
            "text": "Really gets the job done, well. Extremely light and really eats away at those weeds. Only issue I have it, it's kinda short even extending it all the way and the battery doesn't last very long but it's no big deal, still gets the job done!",
            "author": "Lola",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 33,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman V20 Cordless String Trimmer\"",
            "rating": 4,
            "date": "04/14/2019",
            "recommended": true,
            "text": "Great buy for the money. I have several tools that use the V20 batteries and they are all interchangeable (2.0 AH & 4.0 AH). The battery that comes with the trimmer gave me approx. 25 mins. before it was drained. Love the push button string release and swivel head features. This trimmer is great for maintaining a small yard on a weekly basis.",
            "author": "WLS",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 34,
                "no": 2
            }
        },
        {
            "title": "\"Very Happy with this so far\"",
            "rating": 5,
            "date": "03/20/2019",
            "recommended": null,
            "text": "Bought this a month ago and have loved it. Great run time and love the controls.",
            "author": "Brian",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 48,
                "no": 1
            }
        },
        {
            "title": "\"Easy to handle\"",
            "rating": 5,
            "date": "03/30/2019",
            "recommended": true,
            "text": "This product is very easy to put together, very easy to use. The adjustable handle slight weight. Battery means you're not stuck with a cord or messing with gasoline.",
            "author": "Laurajeanike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 41,
                "no": 2
            }
        },
        {
            "title": "\"Plenty of power\"",
            "rating": 5,
            "date": "04/24/2019",
            "recommended": true,
            "text": "Plenty of power for what it needs to do around the house. I have about a 1/4 lot complete with fencing and bushes and it works great.",
            "author": "Matthew",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 14,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman Cordless String Trimmer\"",
            "rating": 4,
            "date": "04/19/2019",
            "recommended": true,
            "text": "Craftsman Cordless Trimmer very easy too use and does a great job, even in tall weeds. Only issue I had was string advance didn't always work but would recommend product.",
            "author": "Becky",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 20,
                "no": 1
            }
        },
        {
            "title": "\"Craftsman weed trimmer, 20 volt.\"",
            "rating": 5,
            "date": "04/21/2019",
            "recommended": true,
            "text": "Easy to set up. String works very good on my tough grass! Changing the direction of the trimmer from trimmer to edger was easy and effective. I like the 20 volt battery it lasts a long time.",
            "author": "Marie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 12,
                "no": 0
            }
        },
        {
            "title": "\"Does the job\"",
            "rating": 5,
            "date": "04/13/2019",
            "recommended": true,
            "text": "got this one to replace another battery operated trimmer that I was unhappy with. This is definitely a step up.  Honestly not that ergonomic but gets the job done. Honestly I was sold on it because of the push button line feed. A lot of the other brands make you either bang it on the ground or have an \"auto\" feature that rarely works as desired.  I am very happy with this model.",
            "author": "suwatechie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 25,
                "no": 5
            }
        },
        {
            "title": "\"Nice Heavy Duty Trimmer\"",
            "rating": 5,
            "date": "04/01/2019",
            "recommended": true,
            "text": "Very happy with this trimmer on its first few uses.  Great power, lasts much longer than my older unit, another brand.",
            "author": "cparksjr",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 13,
                "no": 0
            }
        },
        {
            "title": "\"As advertised\"",
            "rating": 5,
            "date": "04/24/2019",
            "recommended": true,
            "text": "Works excellent, I'm cleaning land and it can handle just about anything. I can't clear with bigger equipment.",
            "author": "Cash",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 13,
                "no": 0
            }
        },
        {
            "title": "\"Quality Craftsman Product\"",
            "rating": 5,
            "date": "04/08/2019",
            "recommended": true,
            "text": "Replaced an older Troy-Bilt trimmer that was similar and had served me well, but this is a big step up in features without a big increase in price. My experience with Craftsman products (approx. 40 years) leads me to expect that this product will also serve me well for a long time.",
            "author": "DIYGuy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 19,
                "no": 2
            }
        },
        {
            "title": "\"Awesome weed eater\"",
            "rating": 5,
            "date": "04/15/2019",
            "recommended": true,
            "text": "Powerful enough to cut down the toughest weeds but still lightweight and easy to use.",
            "author": "Nata",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 13,
                "no": 0
            }
        },
        {
            "title": "\"Great tool!\"",
            "rating": 5,
            "date": "04/20/2019",
            "recommended": true,
            "text": "Easy to operate and the battery lasts a long time! I have had no issues at all.",
            "author": "Will",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 12,
                "no": 0
            }
        },
        {
            "title": "\"Best\"",
            "rating": 5,
            "date": "05/20/2019",
            "recommended": true,
            "text": "The best Battery  weed eater and i have had 3 of them . Battery last long & recharges quickly in  about 1hr. . It works like a gas one  !!!",
            "author": "Larry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 11,
                "no": 0
            }
        },
        {
            "title": "\"No more cord!\"",
            "rating": 5,
            "date": "06/11/2019",
            "recommended": true,
            "text": "I'm not a fan of gas trimmers.  I keep them simple, plug it in and go, nothing more.  However, when I looked that buying replacement trimmer line was going to run $50 EACH for my eleven year old plug in weed-eater, I figured I'd better get \"up to date\".  I was surprised that there aren't any more corded trimmers; however, this cordless,battery operated Craftsman fit the bill.  Pretty much the same specs as my reliable Weed-Eater, I hope this one lasts as long.  To be sure, I even picked up a few refill spools!  Excellent purchase at the right price, no complaints!",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"No more cord!\"",
            "rating": 5,
            "date": "06/11/2019",
            "recommended": true,
            "text": "I'm not a fan of gas trimmers.  I keep them simple, plug it in and go, nothing more.  However, when I looked that buying replacement trimmer line was going to run $50 EACH for my eleven year old plug in weed-eater, I figured I'd better get \"up to date\".  I was surprised that there aren't any more corded trimmers; however, this cordless,battery operated Craftsman fit the bill.  Pretty much the same specs as my reliable Weed-Eater, I hope this one lasts as long.  To be sure, I even picked up a few refill spools!  Excellent purchase at the right price, no complaints!",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"What is not to like!\"",
            "rating": 5,
            "date": "04/20/2019",
            "recommended": true,
            "text": "Total assembly took about 5 minutes, charge the battery pack (that took about 6 hours for first charge). Slide the battery pack in the unit and off you go. No gas, no oil, no pulling on string to start, no maintenance. if you buy the leaf blower at some point you get another battery and charger, same type.",
            "author": "Earle",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 12,
                "no": 1
            }
        },
        {
            "title": "\"It's Perfect!\"",
            "rating": 5,
            "date": "05/17/2019",
            "recommended": true,
            "text": "I'm a stay at home mom of 2 boys. 7 and just turned 1. Its hard to get yardwork done sometimes; it's hard to get anything done! This makes it super easy! No gas, no power cords, battery lasts on entire yard, front and back and sides. Can use it again the next day on the same charge doing other cutting. (We do have a fairly small yard but still) It's much easier, cleaner, and safer.",
            "author": "KKC",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 6,
                "no": 0
            }
        },
        {
            "title": "\"Works great\"",
            "rating": 5,
            "date": "04/17/2019",
            "recommended": true,
            "text": "No cords no gas just Plug in your battery and go....I also use it to trim my bushes!",
            "author": "Lawrence",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 16,
                "no": 1
            }
        },
        {
            "title": "\"Great Price\"",
            "rating": 5,
            "date": "04/20/2019",
            "recommended": true,
            "text": "I needed a trimmer for what little grass I have, it works great and last a long time. String easy to change.",
            "author": "MitchInYuma",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 10,
                "no": 0
            }
        },
        {
            "title": "\"Very Disappointed\"",
            "rating": 3,
            "date": "04/18/2019",
            "recommended": false,
            "text": "I purchased this Cordless Trimmer about 10 days ago.  The charge on the battery lasts less than a n hour. When I called the store they confirmed that it only lasted about 45 - 50 minutes.  This information should be included on the box.  I would not have purchased it if I had known that.  I need one that would last about 1 1/2 hours.  I have a good sized lot and lots of trees 2 out buildings and 2 cement areas to go around.  I also find that a second battery costs $99.99 plus tax.  So I'll be getting a different one. I gave 3 stars because it does do a good job of trimming, as long as the battery lasts.",
            "author": "VMR",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 12,
                "no": 34
            }
        },
        {
            "title": "\"Works well except for the line advance feature\"",
            "rating": 3,
            "date": "05/27/2019",
            "recommended": null,
            "text": "Bought this unit from Lowe's and less than a few days later the line advance would not work.  Returned the unit for a replacement; the same model, and the line advance will not work.  For a while I could manually pull a little bit of line out when I needed it but finally that method has also stopped.  Other than the line advance issue it's a great string trimmer with plenty of power and adequate battery life.",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 8,
                "no": 1
            }
        },
        {
            "title": "\"Great Product\"",
            "rating": 5,
            "date": "06/21/2019",
            "recommended": true,
            "text": "I bought this weed eater today, charged the battery and have used it.  This trimmer is awesome.  I replaced an industrial gas style trimmer that was a pain to use, not self feeding, had to cut lines to attach... an overall a piece of junk.  The Craftsman trimmer rocks, I live in the country with nasty thistles, tumbleweeds, thick wild vegetation, and this trimmer sliced through the weeds  like they were a blade of grass.  I also like the push button line dispenser opposed to ground tap feeds and the ability to adjust the length.  As a female user this was quite easy and pleasant to operate.",
            "author": "Nightmare",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Nice Weed Eater\"",
            "rating": 4,
            "date": "05/17/2019",
            "recommended": true,
            "text": "Works good for a battery operated weed eater. Longer battery life than expected. Doesn't work well on big weeds.",
            "author": "Andy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 9,
                "no": 0
            }
        },
        {
            "title": "\"Worth every penny\"",
            "rating": 5,
            "date": "05/06/2019",
            "recommended": true,
            "text": "Works as expected and very powerful. Battery lasts long enough for trimming 1/4 acre house. Love that the battery pack can be used on similar Craftsman products.",
            "author": "Kevin",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 8,
                "no": 0
            }
        },
        {
            "title": "\"Worth every penny\"",
            "rating": 5,
            "date": "05/06/2019",
            "recommended": true,
            "text": "Works as expected and very powerful. Battery lasts long enough for trimming 1/4 acre house. Love that the battery pack can be used on similar Craftsman products.",
            "author": "Kevin",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 8,
                "no": 0
            }
        },
        {
            "title": "\"Easy, and gets the job done\"",
            "rating": 5,
            "date": "05/18/2019",
            "recommended": true,
            "text": "I am a new homeowner and have never had or needed lawn care equipment before. I saw this beauty sitting on the shelf. It was priced within my budget. I got home and set it up (took like 3 mins). It works. Easy. Fast. Efficient.",
            "author": "rocky",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 7,
                "no": 0
            }
        },
        {
            "title": "\"Works Well\"",
            "rating": 5,
            "date": "05/11/2019",
            "recommended": true,
            "text": "Just purchased today.  Charged battery for about 2 hours and battery charging unit then showed it was fully charged.  Was then able to complete all trimming in about 30 minutes without any power issues.  Also had the power to cut down high weeds on back hillside without issue.",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 6,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman v20 trimmer\"",
            "rating": 5,
            "date": "05/22/2019",
            "recommended": true,
            "text": "Was really skeptical of buying a battery powered trimmer. I was surprised of the power and longevity of this machine. It chewed threw thick overgrown daylilies.",
            "author": "Brad",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 7,
                "no": 0
            }
        },
        {
            "title": "\"Easy to use\"",
            "rating": 5,
            "date": "05/21/2019",
            "recommended": true,
            "text": "I don't have a very big yard but I have already trimmed and edged twice, all on the original charge!No mixing gas & oil!!",
            "author": "Rob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 7,
                "no": 0
            }
        },
        {
            "title": "\"Weed Eater Review\"",
            "rating": 5,
            "date": "05/01/2019",
            "recommended": true,
            "text": "It works great!  No complaints at all!  Easy to use and cuts my medium to large lot without running out of power",
            "author": "Cam",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "title": "\"Lightweight and quiet\"",
            "rating": 4,
            "date": "07/08/2019",
            "recommended": true,
            "text": "We bought this trimmer just a couple weeks ago and we like it a lot.  The only issue is that it does not have a swivel head but it really isn't that big of a problem.  The adjustable handle and telescoping shaft are great features.  Also, very quiet trimmer...nice surprise",
            "author": "Ryan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/03/2019",
            "recommended": true,
            "text": "IT is lightweight and does a good job of wacking weeds",
            "author": "Gomomma",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 4,
                "no": 0
            }
        },
        {
            "title": "\"Great lightweight trimmer\"",
            "rating": 4,
            "date": "06/12/2019",
            "recommended": true,
            "text": "Good deal at low price.  Bought one last week to try had good power easy to use.  Doesn't have power of one I needed to replace due to that company  discontinuing model but still does great job on regular grass, tall grass and weeds and briars.  I have 8 acres fenced in and use to keep fence line cleared.  Liked enough I bought second trimmer yesterday to have second battery.  I get good 45 min on single charge.",
            "author": "Joyce",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman Battery powered weed trimmer\"",
            "rating": 5,
            "date": "07/08/2019",
            "recommended": true,
            "text": "this thing is da bomb!!!! it's light weight, got the powerof a gas trimmer. I LOVE IT!",
            "author": "Jack",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice Product so Far !\"",
            "rating": 5,
            "date": "07/03/2019",
            "recommended": null,
            "text": "Has all the features needed for the average sized suburban home lot. Only thing i am concerned about is how long will the push button line advance system function properly. Had this same line feed system on a B&D trimmer and it did not last long rendering the product useless. IMO if this unit had the easy load feed line system of the Ryobi with the old bump head line advance this Craftsman would be perfect for the average homeowner. Really like the lighter weight of this unit also.",
            "author": "RonF",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Excellent for home owner gardening\"",
            "rating": 5,
            "date": "05/05/2019",
            "recommended": true,
            "text": "I have always used gas trimmer they usually last about 3-4 years using at home.  Decided to try battery power and eliminate gas mess",
            "author": "Dennis",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 5,
                "no": 1
            }
        },
        {
            "title": "\"Perfect for girls\"",
            "rating": 5,
            "date": "06/14/2019",
            "recommended": true,
            "text": "Battery last long enough to do around the house flower beds driveway and fence. It's light it's quiet it's perfect.",
            "author": "Nik",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Great Trimmer\"",
            "rating": 5,
            "date": "06/09/2019",
            "recommended": true,
            "text": "Very easy to maneuver, light weight (not in performance).  Much better than my 2 cycle gas model.  Thank you.",
            "author": "Roger",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Perfect trmmer\"",
            "rating": 5,
            "date": "06/05/2019",
            "recommended": null,
            "text": "Does just what I need .not not made for tough weeds.lightwieght,no gas,no pulling a cord.",
            "author": "2boatman",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"This is a review about a trimmer\"",
            "rating": 5,
            "date": "06/23/2019",
            "recommended": true,
            "text": "This trimmer enabled me to trim my lawn and cut grass in areas in which my lawn mower could not reach. It has a cool battery. You can hit a button on the battery to see the charge level. I like that. It also has ample battery life. The lithium-ion battery ensures maximum power for the duration of use. I tried to weed wack a large weed, however, it didn't cut it. Instead, shrapnel from the weed rocketed toward my leg. It hurt and I was bleeding. I cannot deduct a star though, because it was user error. I just wanted to see if it could cut the beast. 10/10 would buy again.",
            "author": "Tyler",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"So far, so good!\"",
            "rating": 4,
            "date": "04/25/2019",
            "recommended": true,
            "text": "The battery life is more than adequate for trimming around our house and 1/3 acre. I wouldn't want the speed/power to be any lower. I have to run it on high all of the time, but it's adequate.",
            "author": "DrakingBad",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 16,
                "no": 13
            }
        },
        {
            "title": "\"Awesome Unit\"",
            "rating": 5,
            "date": "06/03/2019",
            "recommended": true,
            "text": "Bought one today and it performed like a dream. Did my whole yard and still had plenty of battery left. Low power even cuts tuff high grass with no problems. best investment I have made in awhile.",
            "author": "weedwacker",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Grandma's Garden\"",
            "rating": 5,
            "date": "07/04/2019",
            "recommended": true,
            "text": "So, I have a large garden area, fenced to keep deer out. The boxes are easy to weed, but the areas around them were overtaking the area and my watermelon mounds. Hubby has a gas eater, but he's got a lot to do. I'm 66 and wanted a lightweight, easy start eater/edger and got this one as my birthday present to me. LOVE IT!!! Works like a champ and is super light and easy to use. DID I SAY I LOVE IT?",
            "author": "Texasgranny",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"String feed button issues\"",
            "rating": 1,
            "date": "06/19/2019",
            "recommended": false,
            "text": "I bought this unit based on the favorable reviews and my previous experience with Craftsman products. Seemed like a nice unit, I let the battery charge fully and then tried to use it. It handled well but when the line wore down I tried to use the line feed button to let out more string but I could not get it to work. I tried both high and low speed, and different angles in case it needed something special like being pointed up or down. After a couple dozen tries I re-read the manual to make sure that I was not doing something stupid and checked online but it should have worked based on how I was using it. Took it back and the store let me exchange it for another one of the same type then I tried the same process again with the same results. After two units with the same problem I returned the second one as well. Can't recommend this unit based on this problem.",
            "author": "Tary",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"String feed button issues\"",
            "rating": 1,
            "date": "06/19/2019",
            "recommended": false,
            "text": "I bought this unit based on the favorable reviews and my previous experience with Craftsman products. Seemed like a nice unit, I let the battery charge fully and then tried to use it. It handled well but when the line wore down I tried to use the line feed button to let out more string but I could not get it to work. I tried both high and low speed, and different angles in case it needed something special like being pointed up or down. After a couple dozen tries I re-read the manual to make sure that I was not doing something stupid and checked online but it should have worked based on how I was using it. Took it back and the store let me exchange it for another one of the same type then I tried the same process again with the same results. After two units with the same problem I returned the second one as well. Can't recommend this unit based on this problem.",
            "author": "Tary",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman Trimmer with Edger\"",
            "rating": 5,
            "date": "06/04/2019",
            "recommended": true,
            "text": "Very powerful trimmer.  Battery lasted throughout my trimming project. Very pleased with this cordless trimmer.",
            "author": "Ralph",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Not as advertised\"",
            "rating": 2,
            "date": "05/03/2019",
            "recommended": false,
            "text": "On my first use the line feed system broke inside the line spool.  Very disappointed.  The battery life seemed fine, however I'm going to return it tomorrow and go with the next size up..  Quite surprised at a Craftsman product failing like that.",
            "author": "DCIII",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 8,
                "no": 8
            }
        },
        {
            "title": "\"Great trimmer for me!\"",
            "rating": 5,
            "date": "06/15/2019",
            "recommended": true,
            "text": "I bought this yesterday, charged the battery today and I am so happy with this trimmer.  I am a 64 year old female. I cannot use the large gas trimmer my husband has. This did the job. The battery lasted at least 45 minutes, it cut through some tall grass around my shed. Easy to put together and manage.  Very, very happy with my purchase. It was on SALE!!!",
            "author": "RBS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Trimmer power\"",
            "rating": 3,
            "date": "04/30/2019",
            "recommended": false,
            "text": "The trimmer was advertised on the box to last 45 minutes with full charge, best I got was 20 minutes so I returned it",
            "author": "Ray",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 7,
                "no": 6
            }
        },
        {
            "title": "\"Quick and easy\"",
            "rating": 5,
            "date": "05/24/2019",
            "recommended": null,
            "text": "No more lugging cords around. Easy to use and I love it!",
            "author": "Carisab",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 1
            }
        },
        {
            "title": "\"Craftsman V20 volt string trimmer\"",
            "rating": 5,
            "date": "06/13/2019",
            "recommended": true,
            "text": "After giving the battery a full charge, I worked in areas in my yard where normally I would either run out an 100' extension cord or fire up my gas trimmer. The pleasant surprise was not only the ease of the cordless trimmer, but the long  running time I got on the battery to complete the job. That alone saved me time.",
            "author": "Ted",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Line feed not working\"",
            "rating": 3,
            "date": "06/03/2019",
            "recommended": false,
            "text": "I have use this trimmer about 1 month, it is good for the work I wanted it for. However when I put a new pre-wound spool of line on, the line feed would not work. I checked for cross over line and yes it is the correct size for this trimmer. Disappointing !",
            "author": "Kman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 2
            }
        },
        {
            "title": "\"Broken right out of the box\"",
            "rating": 1,
            "date": "05/08/2019",
            "recommended": false,
            "text": "I bought a Kobalt electric trimmer earlier in the day, only to find that it was broken right out of the box. I exchanged it that same day for this craftsman. Lo and behold, this weed wacker is broken, too! The line would continue to feed every time the reel would spin. I called Craftsman and they assured me that it was broken and that I needed to return it. I won't be buying any more trimmers from Lowe's.",
            "author": "Aaron",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 6,
                "no": 19
            }
        },
        {
            "title": "\"Easy Breezy\"",
            "rating": 4,
            "date": "06/25/2019",
            "recommended": true,
            "text": "Love this Craftsman product, very light weight and easy to handle. The battery stayed fully charged to complete my yard. Its battery powered for me on everything going forward. Hoping for battery powered lawn mover next year. No more mixing gas for me",
            "author": "Sidekick",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Happy with purchase\"",
            "rating": 5,
            "date": "07/04/2019",
            "recommended": true,
            "text": "Bought this trimmer/edger on sale for $99. I wondered at first why it stopped working after an hour of use and then I realized I picked up the 2 AH battery from a different craftsman V20 series. This comes with a 4 AH battery and lasts until I was done with trimming and edging. I'm planning on buying the 3 pack refill line for it and just re-spool those with shakespeare line. Overall I am happy with this purchase. Although I wish the edger is more of a roller kind rather than the wire.",
            "author": "SHOcruiser",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Mid-Range Trimmer\"",
            "rating": 5,
            "date": "06/01/2019",
            "recommended": true,
            "text": "I figured I'd spend a bit more than I'd planned due to the fact that this trimmer was on sale...of course, the only way I knew it was on sale was looking online...in the store, it was listed at full price...I checked with customer service, and they said the sale price was correct...however, when I checked out, it rang up full price, which I got changed. So, watch sales prices closely.  Now, to the product itself...I've been using a Troy Bilt gas trimmer for several years...at one point, I even spent an extra $40 for the electric starter, but it's still a pain to not only start, but keep going...I knew I didn't want another trimmer with a cord, so I bit the bullet, and bought this one.  First impression...it works great, very easy to use, the push button line extender works just as advertised, the guide works well...overall, I couldn't ask for more.  We'll give it a good Summer's use on our new yard, and I'll revisit the review in the Fall.",
            "author": "Jim",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 2
            }
        },
        {
            "title": "\"Great for small yards\"",
            "rating": 5,
            "date": "06/17/2019",
            "recommended": true,
            "text": "I have used this five times now and it's great for small yards including a private fence I'm not sure if you have to buy the preloaded cartridges which would be 20 each but I love it so far no pulling a string five million times",
            "author": "Emanuel",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Works great, powerful, quiet\"",
            "rating": 4,
            "date": "06/12/2019",
            "recommended": true,
            "text": "As a weed eater it works great, although when the line get too long it causes it to bog down, and it automatically feeds line when hitting heavier items which cause it to spit line out. As an edger, it works fantastic",
            "author": "Jeni",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Don't Recommend\"",
            "rating": 1,
            "date": "04/21/2019",
            "recommended": false,
            "text": "Potentially the worst trimmer I've ever used.  The line just feeds out whether you want it to or not.  The blade isn't sharp enough to cut the line so it just wraps around gear and jams.  After a frustrating two days of trying to make it work, i'm going to return it and spend a little more for something better.",
            "author": "Gil",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 8,
                "no": 19
            }
        },
        {
            "title": "\"G's opinion...\"",
            "rating": 5,
            "date": "06/24/2019",
            "recommended": true,
            "text": "I am very satisfied with this string trimmer from Craftsman.  It has all the power I need and is very easy to use.  It is very well built and the battery is fine for my needs.",
            "author": "Gary",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman string trimmmer\"",
            "rating": 3,
            "date": "06/29/2019",
            "recommended": false,
            "text": "The line feed feature does not work properly. It will work every once in awhile, however, it is not consistent. I am returning mine with frustration.",
            "author": "None",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"good power, battery life\"",
            "rating": 5,
            "date": "06/08/2019",
            "recommended": true,
            "text": "best if used after overnight charge.  cut through thick weeds w/o issue.good balance and materials used to construct!",
            "author": "radano1959",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"The best trimmer\"",
            "rating": 5,
            "date": "06/09/2019",
            "recommended": true,
            "text": "Have used it in 3 different houses and every time the battery its long lasting it gets the job done and it's easy.",
            "author": "Chief",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Easy to use\"",
            "rating": 5,
            "date": "06/09/2019",
            "recommended": null,
            "text": "This is easy to use and compatible with like craftsman batteries and works great very east to clean and maintain.",
            "author": "Nathanwegner",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"20V Craftsman Trimmer\"",
            "rating": 5,
            "date": "06/17/2019",
            "recommended": true,
            "text": "I have enjoyed using this product, battery lasts as described so I will purchase 1 more so I can have a swap out.",
            "author": "Uli",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"light and powerful\"",
            "rating": 5,
            "date": "06/10/2019",
            "recommended": true,
            "text": "Got for the wife and she loves it. Very easy to use and light which she likes. Cuts like a gas one.",
            "author": "pat",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Safety first!\"",
            "rating": 3,
            "date": "06/08/2019",
            "recommended": false,
            "text": "I recently purchased a 20V Max String Trimmer/Edger Model CMCST910 from Lowe's. The second time I used it, I was hit in the nose (which caused bleeding) and the next time in the chin when using the Line Feed Button with a piece of the twist nylon line. I called Craftsman service and talked to Samantha about this. She verified that this had not happened to anyone before. Be aware of this and make sure you are wearing safety glasses. I just returned mine to Lowe's.",
            "author": "313Charlie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 5
            }
        },
        {
            "title": "\"Bummer\"",
            "rating": 2,
            "date": "06/09/2019",
            "recommended": false,
            "text": "I can't account for the other reviews, but I can tell you this trimmer SUCKS!!! Out of the box it ran 15 minutes. Thinking it was not fully charged I placed the battery in the charger for an hour. Still...it only lasted 15 minutes. What? I then placed it in the charger over night. Next day I again timed it. 15 minutes like clock work, it stopped. I took it back to Lowes in Boise where I bought it. I was told it would get nearly 45 minutes per charge. NO WAY!!!.",
            "author": "Jerry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 6
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/16/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Wnd",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "04/22/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Sammy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"junk\"",
            "rating": 1,
            "date": "06/15/2019",
            "recommended": false,
            "text": "it broke the first time i used it it just kept spooling line out",
            "author": "clif",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 3
            }
        },
        {
            "title": "\"Great product for a homeowner.\"",
            "rating": 5,
            "date": "06/20/2019",
            "recommended": true,
            "text": "I bought this for a newly purchased suburban house with a .2 acre lot.  I really like it.  It has 2 cutting speeds, high and low.  I generally use the high speed for everything.  So far, I've used it 4 times.  I've used it along my sidewalks, along the driveway, along the road, and at the edge of the pond that backs up to my lot.  It cuts everything I need it to cut.  I like the fact that there's no gas to mix or air filters to change, and it's a lot quieter than the Stihls my landscape crew uses--but this is not a product I'd use for my job.  So far, I've only charged the battery once, I'm really impressed by the battery life.PROS: Lightweight, strong, quiet, versatile, super long charge time for average residential jobs, handle changes length to accommodate different size people, no gas to mix.CONS: No shoulder strap or convenient strap mounting points.",
            "author": "tenbravo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Awesome trimmer for the homeowner\"",
            "rating": 5,
            "date": "07/01/2019",
            "recommended": true,
            "text": "I had been lugging around a commercial strength trimmer for years.  It was heavy, loud, smelled badly, and was difficult to keep running. Furthermore, it was way more trimmer than I needed for simple yard work around the house.I have only used this one for two weeks, but so far I love it.  Lightweight, not loud, and does an excellent job of trimming short lawn grass.  This is probably not the right choice for tall, weedy grass or for commercial mowers who need something to use all day.  But for the homeowner who needs a trimmer for about 15-20 minutes a week, it's perfect.The only negative I will point out is that the shaft, even when fully extended (it's adjustable), is still a bit short for taller users.  I am six feet tall, and have to bend over a bit more than I'd like.  That being said, I still have no plans to go back to the larger, gas powered trimmer.",
            "author": "TeaSea",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Cheap junk\"",
            "rating": 1,
            "date": "07/02/2019",
            "recommended": null,
            "text": "Ordered online through lowes, arrived quick, but right out of box did not work. Would run for about 3 seconds and cut out.  Thought it was battery, so I charged overnight. Tried again next day,same thing. String also kept dispensing, when it would run that is... local store didnt have this model in stock, started warranty claim with craftsman, has been 2 weeks, havent heard anything... will be returning to store",
            "author": "G",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Line feed does not advance.\"",
            "rating": 4,
            "date": "07/06/2019",
            "recommended": false,
            "text": "I spend more time taking apart the spool assembly to avance the line than actually trimming.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works for my yard size\"",
            "rating": 5,
            "date": "06/21/2019",
            "recommended": true,
            "text": "After fighting this season with a 15- year old gas trimmer that served me well, I just couldn't get it to run.  Cleaned carb, replaced fuel lines, etc.  No luck, just frustration.  Was ready for a change and this Craftsman 20V trimmer works for my yard size (standard .25 acre lot).  Charged battery out of the box and went to town.  Have used it about 5 times before battery finally gave out. Each use was about 35 minutes.  Also, finally ran out of the line that it came with. Low setting for power has been adequate for trimming, which is probably why the battery has lasted so long.  The edger feature isn't that great and it works better in regular mode and angling it at the edge of the lawn.  The telescoping handle makes adjusting easy.  Very pleased with it so far and have begun a transition to other Craftsman 20V tools.  And when the old gas lawn mower finally gives out, I'll transition to a cordless mower.",
            "author": "RG",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/02/2019",
            "recommended": true,
            "text": "I bought one and I really liked the way it worked. I had never had a battery trimmer. The string advance did not work as it should. I know sometimes things like that happens. I took it back to the store and got another one. I charged the battery and the next day tried the string advance and it worked like it was supposed to. Since then it has worked great.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Edger\"",
            "rating": 5,
            "date": "06/08/2019",
            "recommended": true,
            "text": "I have a zero lot line home and needed something to trim along the house/deck/driveway. I wanted something battery powered so I didn't have to fuss with mixing gas or the maintenance that can come with gas powered items. The edger works great, is super lightweight, and the battery gets multiple uses before needing to be recharged. Very happy with my purchase.",
            "author": "907mom",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman V20 String Trimmer\"",
            "rating": 5,
            "date": "07/05/2019",
            "recommended": true,
            "text": "The Craftsman trimmer is excellent, battery life easily covers my yard needs. The 2 speed feature is nice, the low speed works well for my needs.The .080 string is stronger than my old 65",
            "author": "ObeJuan23",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "07/05/2019",
            "recommended": true,
            "text": "The trimmer is lightweight and easy to use.  The first one was returned because string would not advance but second one works fine.",
            "author": "Freedom",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/14/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Russ",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Light weight and easy to use\"",
            "rating": 5,
            "date": "07/01/2019",
            "recommended": true,
            "text": "This weed eater does just as it promises.  It is light weight and easy to use.  It cuts down the weeds and edges the sidewalk with ease.  The rechargeable battery is nice because there are no cords to trip you up or the heavy gas smell that accompanies other trimmers.",
            "author": "JBravo",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Townhouse area\"",
            "rating": 5,
            "date": "06/28/2019",
            "recommended": true,
            "text": "very pleased with the cutting width at this price. I have a end unit townhouse. The 20V has been adequate for our trimming around the back and side of the unit. 20V is adequate for our needs, I had considered a 40V, but not worth the additional expense for our needs.",
            "author": "Corey",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/18/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "River",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "06/06/2019",
            "recommended": null,
            "text": "There is no review to accompany this rating.",
            "author": "Cassie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Craftsman cordless trimmer\"",
            "rating": 5,
            "date": "06/30/2019",
            "recommended": true,
            "text": "One of the best buys that I have made. Easy to handle and easy to use. Battery lasts at an hour or more with continuous use and recharges very quickly. I have already recommended it to friends and family members.",
            "author": "Georgette",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Battery powered weed eater\"",
            "rating": 5,
            "date": "06/25/2019",
            "recommended": true,
            "text": "Love this product! Holds a charge for a good amount of time and works wonderful!!No more pulling and fighting to crank a gas powered one. Lightweight so even females can use it, and it adjusts to your height!! \\",
            "author": "Sally",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Exactly what I had hoped it would be!\"",
            "rating": 5,
            "date": "07/04/2019",
            "recommended": true,
            "text": "This was my first battery operated trimmer and I don't think I will ever go back to using a plugin again!!",
            "author": "Tw22",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I like it a lot\"",
            "rating": 5,
            "date": "06/24/2019",
            "recommended": true,
            "text": "So far it has worked great! I haven't had to add new line yet so don't know how hard or easy that will be? Also I haven't had it very long to know how the battery will last, but so far I am very happy with it!",
            "author": "Akitalover",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/15/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "c",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Great edging and trimmer\"",
            "rating": 5,
            "date": "06/29/2019",
            "recommended": true,
            "text": "I wanted something light and easy to use but get the same results and this craftsman edging and trimmer the best I ever had the only thing battery needs charge before I get everything finished.",
            "author": "Darlene",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great weed whip!!\"",
            "rating": 5,
            "date": "06/17/2019",
            "recommended": true,
            "text": "I am really enjoying this craftsman string trimmer. The battery lasts a long time, and the automatic string advancer saves a lot of time!! I think everyone should own one.",
            "author": "Mikie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great machine\"",
            "rating": 5,
            "date": "06/15/2019",
            "recommended": true,
            "text": "Have 1/2 acre, As a small woman , pulling a gas weed eater is not easy, decided to try this.  I love It .  Can do my entire property in one charge .  10 stars for me !",
            "author": "Kelly",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice light weight trimmer\"",
            "rating": 5,
            "date": "06/23/2019",
            "recommended": true,
            "text": "This trimmer is light weight and does a good job. Battery life was good. I like push button string advance . I have had others and this is the best for the money.",
            "author": "Rich",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"cuts (to the) quick\"",
            "rating": 4,
            "date": "06/24/2019",
            "recommended": true,
            "text": "Picked up at store.  got 40min's cut time on first charge.  GOT 35 ON 2ND CHARGE.  Great not to have GAS NOISE or lugging about danged EXTENSION CORDS",
            "author": "leichester",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Eatit\"",
            "rating": 5,
            "date": "06/29/2019",
            "recommended": true,
            "text": "Best battery operated tool for eating those weeds. Chomp chomp. Seriously it's really light really simple to handle and powerful.",
            "author": "Seymour",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great purchase!\"",
            "rating": 5,
            "date": "06/15/2019",
            "recommended": true,
            "text": "Works great! The battery life is as long as needed. After buying lower end tool, it is well worth every penny!",
            "author": "Lulu",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman V20 20 volt Max13 in Trimmer Edger\"",
            "rating": 5,
            "date": "06/03/2019",
            "recommended": true,
            "text": "Have not used it myself, but my grandson is very happy with it. He says it does a good job and easy to handle.",
            "author": "Grammy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 5
            }
        },
        {
            "title": "\"CRAFTSMAN V20 20-volt Max 13-in Straight Cordless\"",
            "rating": 5,
            "date": "06/06/2019",
            "recommended": true,
            "text": "Charged it once, did our entire front and back yard! Wonderful.So good, I went and bought a second one!",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 2
            }
        },
        {
            "title": "\"Excellent\"",
            "rating": 4,
            "date": "06/17/2019",
            "recommended": null,
            "text": "Very convenient and light weight. Easy to use and setup. Battery last much longer than I expected!",
            "author": "Jwmoorear",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"20V weed eater/trimmer\"",
            "rating": 5,
            "date": "06/26/2019",
            "recommended": true,
            "text": "Lite weight and adjustable. Dual speed with finger tip line feed. Great for around the house.",
            "author": "gotoguy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Kelley",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Fair Purchase\"",
            "rating": 4,
            "date": "06/15/2019",
            "recommended": true,
            "text": "The handles are adjustable. They are very convenient to adjust the length of the arm.",
            "author": "Wilfredo",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 3
            }
        },
        {
            "title": "\"Craftsman battery operated weed wacker\"",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "This is my 2nd Craftsman weed wacker. It does everything I need on my 1/4 acre!!",
            "author": "Patty",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman battery operated weed wacker\"",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "This is my 2nd Craftsman weed wacker. It does everything I need on my 1/4 acre!!",
            "author": "Patty",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "07/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jesse",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"New yard tool\"",
            "rating": 4,
            "date": "06/16/2019",
            "recommended": true,
            "text": "Great longer life than old battery trimer.  why a 4 star can not adjust handle",
            "author": "dave",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/22/2019",
            "recommended": true,
            "text": "Works great. I was able to trim an acre on one charge.  Very nice product.",
            "author": "Billy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/08/2019",
            "recommended": true,
            "text": "Easy to assemble, lightweight, and plenty of battery life for my needs.",
            "author": "alanbalk",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great product cheap price\"",
            "rating": 5,
            "date": "06/26/2019",
            "recommended": true,
            "text": "Great value!!  Easier to use then corded and less mess/fumes then gas.",
            "author": "Bibimus",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great trimmer\"",
            "rating": 5,
            "date": "06/28/2019",
            "recommended": true,
            "text": "runs just like a gaser but at half the weight and vibrations",
            "author": "tyler",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "06/29/2019",
            "recommended": true,
            "text": "Love this unit but wish the battery charge lasted longer.",
            "author": "Wayne",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Craftsman  cordless weed wacker\"",
            "rating": 5,
            "date": "06/15/2019",
            "recommended": true,
            "text": "Outstanding price and very easy to use and is light weight",
            "author": "Pappy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Cut the weeds\"",
            "rating": 5,
            "date": "05/27/2019",
            "recommended": true,
            "text": "Works great! Does what we bought it for.",
            "author": "Charlie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 3
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/01/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/29/2019",
            "recommended": false,
            "text": "There is no review to accompany this rating.",
            "author": "Sue",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/28/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Kev",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/28/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Robert",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Pj",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/26/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "andy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/26/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Diane",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/01/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "jerry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/12/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/12/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/07/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "JohnD",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Don",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "05/19/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Amy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/26/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Barbara",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/31/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Dan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/01/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Andree",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/15/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/20/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "karen",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "06/09/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "TEX",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/20/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Vince",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/16/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "ettie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/23/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "adam",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "06/23/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "TJ",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/27/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Mark",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/16/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Charles",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"I LOVE this Trimmer! Leave gas and cords behind!\"",
            "rating": 5,
            "date": "06/15/2019",
            "recommended": true,
            "text": "After years of struggling with gas trimmers and dragging cords for electric ones, I decided I'd try a battery powered one. The thought of leaving all that hassle behind was appealing. After reading others comments I decided to purchase this one. After charging the battery for 2 hours I gave it a go. This was the first trimming of the year so the weeds and grasses were thick. I'm a 5' 4\" older woman and loved the option to be able to adjust the shaft length and handle position. I found that because the battery pack end is small, I could tuck it under my arm comfortably. I love that the handle has 45 degree corners so that you can use all three sides depending on your maneuverability needs. I need to trim up a hillside and found I could rest the shaft/battery along the bottom of my forearm for added leverage. The power is good on low and even better on high. I tried not to use high much—and didn't really need it—to conserve the battery. It tore through everything really well. The line rarely needed to be advanced and when it did, having the button to push to extend the line was awesome and conveniently located and easy to push! So glad to be done with stopping every 30 seconds to advance the line manually because those auto advancers suck. I also like that it's lightweight and not loud. I used to wear ear protection, but don't feel the need with this one. The charge lasted about 15-20 minutes, which was fine I just did other stuff while it charged and then got back to it. I may get a second battery so I can't get the job done sooner when I need to. I feel like I could be a poster child I like this trimmer so much!",
            "author": "mtndwelr",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        }
    ],
    "reviewStats": {
        "reviewCount": 148,
        "percentRecommended": "84",
        "averageStars": "4.6",
        "starCounts": {
            "five": 112,
            "four": 22,
            "three": 6,
            "two": 2,
            "one": 6
        }
    },
    "questions": [
        {
            "question": "\"Had model CMCST910 cordless trimmer about a month, after I changed the line spool, the line feed doesn't work. Any suggestions?\"",
            "author": "Anonymous",
            "date": "06/03/2019",
            "answers": [
                {
                    "author": "Charlie",
                    "date": "07/08/2019",
                    "text": "The exact same thing happened to me. Worked well for during the factory installed spool. Changed it out with a pre-packed spool from Lowe's. Failure. Wasted over an hour with CS on hold then after another 25mins the Rep from Craftsman told me they couldn't help. She said to take it back. I did and Lowes gave me a new one (Thank you Lowes) but this unit spits out line everytime I stop the timmer. It's a defect and the only warranty is to drag the thing back to lowes. Do not waste time calling that 1-888 number on the manual.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "Kman",
                    "date": "06/04/2019",
                    "text": "Yes, thank you , I have done those things and it didn't work.",
                    "helpful": {
                        "yes": 8,
                        "no": 4
                    }
                },
                {
                    "author": "Frank",
                    "date": "06/03/2019",
                    "text": "Check your line to see if you might have cross it or you put on the wrong size. It is best to buy and use preloaded spools.",
                    "helpful": {
                        "yes": 5,
                        "no": 2
                    }
                },
                {
                    "author": "Frank",
                    "date": "06/03/2019",
                    "text": "Check to see if you put the new line in right. Do not cross or put line in loos. Buy the full spools.",
                    "helpful": {
                        "yes": 1,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"How long will this run on a full charge?\"",
            "author": "Anonymous",
            "date": "02/23/2019",
            "answers": [
                {
                    "author": "Mike",
                    "date": "05/28/2019",
                    "text": "I always use mine on high setting; low setting will make it run longer but with less power. On high I usually get close to the 45 minutes as advertised. Simple solution which works for me is to buy a second battery (about $30) and have it on charge while I use the first battery.",
                    "helpful": {
                        "yes": 14,
                        "no": 0
                    }
                },
                {
                    "author": "Jon",
                    "date": "05/08/2019",
                    "text": "I just bought one. Last 7min on high. I will be returning mine",
                    "helpful": {
                        "yes": 16,
                        "no": 4
                    }
                },
                {
                    "author": "Barbara",
                    "date": "03/26/2019",
                    "text": "Book states 45 minutes.",
                    "helpful": {
                        "yes": 10,
                        "no": 13
                    }
                }
            ]
        },
        {
            "question": "\"Is any trimmer cord included with this\"",
            "author": "Anonymous",
            "date": "05/30/2019",
            "answers": [
                {
                    "author": "Frank",
                    "date": "06/03/2019",
                    "text": "Yes",
                    "helpful": {
                        "yes": 12,
                        "no": 0
                    }
                },
                {
                    "author": "Frank",
                    "date": "06/03/2019",
                    "text": "Yes it comes with a full spoll & you can buy replacement spolls or Loose line.",
                    "helpful": {
                        "yes": 5,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Does this use the same v20 batteries as the craftsman cordless drill and other v20 cordless tools?\"",
            "author": "Anonymous",
            "date": "04/25/2019",
            "answers": [
                {
                    "author": "Frank",
                    "date": "06/03/2019",
                    "text": "Check each tool, they might be different, this is a 20 V four amp. battery.",
                    "helpful": {
                        "yes": 4,
                        "no": 6
                    }
                },
                {
                    "author": "Mike",
                    "date": "05/27/2019",
                    "text": "Not sure about the Craftsman cordless drill, but this uses a different battery from the Black& Decker 20 V system. This uses a physically larger 4 MAH battery.",
                    "helpful": {
                        "yes": 0,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"Just bought a craftsman trimmer/edger today and the push button line feed wouldn't work from the start. I keep having to remove the cover and manually\"",
            "author": "Anonymous",
            "date": "06/22/2019",
            "answers": [
                {
                    "author": "Anonymous",
                    "date": "07/08/2019",
                    "text": "Same problem. Defect in the design. Nobody can help you, I have wasted hours trying to resolve this problem. It will never work properly. On my second one and sadly I am going to have to return it.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"does this come with a charger also\"",
            "author": "Anonymous",
            "date": "05/26/2019",
            "answers": [
                {
                    "author": "Frank",
                    "date": "06/03/2019",
                    "text": "Yes",
                    "helpful": {
                        "yes": 14,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"How much does it weigh\"",
            "author": "Anonymous",
            "date": "05/26/2019",
            "answers": [
                {
                    "author": "Mike",
                    "date": "05/28/2019",
                    "text": "Per the online specifications; the unit weighs 6.7 lbs. which seems about right from my experience with this trimmer.",
                    "helpful": {
                        "yes": 13,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Does this battery work with the 20v craftsman bolt on tools as well?\"",
            "author": "Anonymous",
            "date": "05/21/2019",
            "answers": [
                {
                    "author": "Frank",
                    "date": "06/03/2019",
                    "text": "You need to check each one.",
                    "helpful": {
                        "yes": 1,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"Can I use a higher volt battery?\"",
            "author": "Anonymous",
            "date": "04/16/2019",
            "answers": [
                {
                    "author": "CommunityAnswer",
                    "date": "04/18/2019",
                    "text": "No, you cant use a higher volt battery",
                    "helpful": {
                        "yes": 8,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Does the string feed and cut off every time you pull the trigger?\"",
            "author": "Anonymous",
            "date": "04/10/2019",
            "answers": [
                {
                    "author": "Keith",
                    "date": "05/03/2019",
                    "text": "Just bought this and used for the first time. Feeder does not work and will be returning.",
                    "helpful": {
                        "yes": 31,
                        "no": 6
                    }
                }
            ]
        }
    ]
}