{
    "descriptions": {
        "overview": "The RK3441K compact circular saw can essentially replace a mulcher's or professionals need for a full-size 7-1/4 In. circular saw. This saw was born to cut wood, especially 2 In. final lumber materials. This saw weighs only 5 lbs, so it is easy to transport and maneuver (especially overhead). The slim, infeed grip design provides great comfort, balance, and control. The 41/2 In. blade cuts 2X4s in a single pass and is about 50% lighter than conventional 71/4 In. circular saws. Plus, the lightweight saw's left-sided blade design provides remarkable cut-line visibility. The saw's 4-1/2 In. blade has a kerf that is less than half the thickness of larger 7-1/4 In. circular saw blades. Since this smaller, thinner blade takes much less effort and motor strain to cut through the material, the 5 Amp to 3500 rpm saw can match the performance of full-size circular saws. The saw's maximum cutting depth at 90° is 1-11/16 In. and the bevel capacity at 45° is 1-1/8 In.. the saw also features a dust extraction port and a 1-1/4 In. vacuum adapter for dust collection and a clean work environment.",
        "list": [
            "Powerful 5-amp motor delivers up to 3,500-RPM for a range of cutting applications",
            "Carbide-tipped blade",
            "0°-45° Bevel capacity allows for a variety of cuts",
            "5.0-Lb design is easy to manage",
            "Arbor-lock button for easy blade changes",
            "Slim-line grip design for comfort, balance and control",
            "Easy-set depth-gauge lever provides quick setup and cutting adjustments",
            "Includes rip fence for increased accuracy"
        ]
    },
    "specs": [
        {
            "title": "Amps",
            "spec": "5"
        },
        {
            "title": "Bevel Capacity (Degrees)",
            "spec": "45"
        },
        {
            "title": "Cord Length (Feet)",
            "spec": "10"
        },
        {
            "title": "Shoe Material",
            "spec": "Steel"
        },
        {
            "title": "Fence Included",
            "spec": 1
        },
        {
            "title": "Bevel Stop",
            "spec": 0
        },
        {
            "title": "Dust Collection",
            "spec": 1
        },
        {
            "title": "Depth Control",
            "spec": 1
        },
        {
            "title": "Dust Blower",
            "spec": 0
        },
        {
            "title": "Dust Chute",
            "spec": 0
        },
        {
            "title": "Dust Chute Diameter(OD) (Inches)",
            "spec": "4.5"
        },
        {
            "title": "Laser Guide",
            "spec": 0
        },
        {
            "title": "Work Light",
            "spec": 0
        },
        {
            "title": "Brake",
            "spec": 0
        },
        {
            "title": "Blade Material",
            "spec": "Carbide-tipped"
        },
        {
            "title": "Blade Side",
            "spec": "Left"
        },
        {
            "title": "Arbor Diameter",
            "spec": "3/8-in"
        },
        {
            "title": "Weight (lbs.)",
            "spec": "5"
        },
        {
            "title": "Case Type",
            "spec": "N/A (no case)"
        },
        {
            "title": "Series Name",
            "spec": "N/A"
        },
        {
            "title": "UL Safety Listing",
            "spec": 0
        },
        {
            "title": "CSA Safety Listing",
            "spec": 0
        },
        {
            "title": "ETL Safety Listing",
            "spec": 1
        },
        {
            "title": "Warranty",
            "spec": "3-year limited"
        },
        {
            "title": "Maximum Depth at 45 Degrees (Inches)",
            "spec": "1.125"
        },
        {
            "title": "Maximum Depth at 90 Degrees (Inches)",
            "spec": "1.68"
        },
        {
            "title": "Horsepower",
            "spec": "0"
        },
        {
            "title": "Voltage",
            "spec": "120"
        },
        {
            "title": "UNSPSC",
            "spec": "27112700"
        },
        {
            "title": "Maximum Speed (RPM)",
            "spec": "3500"
        },
        {
            "title": "Saw Blade Diameter",
            "spec": "4-1/2-in"
        },
        {
            "title": "Spindle Lock",
            "spec": 0
        },
        {
            "title": "Worm Drive",
            "spec": 0
        },
        {
            "title": "CA Residents: Prop 65 Warning(s)",
            "spec": "Yes"
        }
    ],
    "reviews": [
        {
            "title": "\"Engineers should redesign this tool\"",
            "rating": 2,
            "date": "11/29/2016",
            "recommended": false,
            "text": "Bought last  year to fix up my trailer. Being disabled, I thought it would be ideal for any job. Well NO. the engineers should make the grip diameter smaller. 2. the on safety switch should be on top not on the side. 3. Blades bind and kick back when I am to the end of the cut 2x4 and 1 1/2 inc wood rails even 1/4 in plywood and even in a jig. I have changed out the blade. made sure it was in correctly and even guided it with 2 hands still binds and kicks back. I do like the smallness of the tool. \nI am looking for a smaller rotter saw. Until they fix these problems I do not recommend this saw.  Not a Happy woodworker on this on.",
            "author": "LABiker777",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great saw!\"",
            "rating": 5,
            "date": "02/11/2016",
            "recommended": true,
            "text": "I bought this saw from the large blue home improvement store on impulse. I have owned a circular saw for many years and have always hated it. I would use a handsaw just to keep from heaving that monster around. This little saw can do anything the large one can do and more due to its smaller size. I have made floor cut outs with it (3/4 OSB plywood), cut laminate flooring with it, I even removed some old cabinets with it sawing (unknown at the time) through the klix cabinet connectors with no problems. If my blade is dull I can't tell it. I run it one handed with no trouble. If the circular saws both you this is the saw for you.",
            "author": "review01",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Where has this thing been all my life?\"",
            "rating": 5,
            "date": "09/07/2015",
            "recommended": true,
            "text": "Completely Awesome. In the 2 weeks that I have had it I have cut Corian countertops with it, I have cut tons of plywood and a few 2x4's but the most amazing thing is the cooktop cutout that I did in a 3/4\" thick Quartz countertop. I would probably not use it for a production saw on granite but if you have a granite cut to make from time to time this will get it done.The dust collection is very good, which is one of the most important features to me because all of the work that I do is in kitchens, in lived in homes and maintaining the mess is key.I love it and would recommend it to anyone. It's awesome.",
            "author": "Countertop Repair Shop",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good for small projects.\"",
            "rating": 4,
            "date": "02/22/2019",
            "recommended": true,
            "text": "Definitely not good for bigger projects. I tried to cut up multiple pieces of 4x2 plywood and it started binding after about 30 minutes. I will say it had a very even, smooth cut. I just think it is better for very short, quick cuts. Also, make sure and attach some kind of dust collection. This thing spits sawdust everywhere.",
            "author": "Jennifer",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 10,
                "no": 3
            }
        },
        {
            "title": "\"Effective for its intended use and very comfortabe\"",
            "rating": 5,
            "date": "01/14/2016",
            "recommended": true,
            "text": "I bought this saw about a month ago from Lowe's and have used it on 2x4's, as well as 45 degree miter cuts on baseboard trims. It is very comfortable to hold and wotk with with good line of view of the cut. Seems very sturdy and heavy duty.While it is not a complete replacement of a full size circular saw in terms of accuracy, power, and depth of cut, it used for what it is intended for it is very effective. This saw is now my first go to saw for everyday use as most of my applications do not need cabinet building accuracy. It is small, powerful enough, and easy to pull out quickly, use and put away.",
            "author": "Flacon",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Handy lil tool\"",
            "rating": 5,
            "date": "02/16/2019",
            "recommended": true,
            "text": "Needed a basic saw that didn't take up a whole lot of space - mainly for some 1” and 2x4 boards. Perfect for my needs- but would probably recommend a chop saw for more accurate cuts and using for bigger projects",
            "author": "Huch",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 4,
                "no": 0
            }
        },
        {
            "title": "\"Power and precision in a small package.\"",
            "rating": 5,
            "date": "01/18/2016",
            "recommended": true,
            "text": "I purchased this 5 Amp mini saw a few weeks ago and immediately used it for several projects. I am very impressed with its power for such a small and easily controllable tool. It easily cuts where you point it and has the power to not stall or bind when reaching into awkward situations, which can really mess up a cut. There's no way my other, larger circular saw could be used in such a way, nor with such great effect. Just like the Sonicrafter F50 I purchased a year ago, this saw is of excellent quality and design. I'm looking forward to increasing my Rockwell tool collection as various needs arise.",
            "author": "Mugsy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Get the right tool for the job.\"",
            "rating": 4,
            "date": "12/17/2015",
            "recommended": true,
            "text": "I have been reading reviews on this saw and other similar type \"compact\" saws. Most of the negative complaints are about binding and lack of power when cutting 3/4\" plywood up to 2x4 lumber. As a carpenter and home builder I would never consider a saw like this for such heavy applications. I intend to use one for 1/4\" paneling and getting into tight spaces for small cuts. 4 to 7 amp saws are not made for heavy use. They may be able to work in some heavy applications but you risk burning up the motor or tweaking the frame by pushing these little saws too hard. Use the right size saw for the work.",
            "author": "Boots",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact...Lightweight\"",
            "rating": 5,
            "date": "01/31/2016",
            "recommended": true,
            "text": "Haven't used it yet, but bought it for it's compactness and light weight design. I'm always traveling to help others do projects and this fits in with the way I like to travel (no more big bulky circular saw). Was considering a cordless saw but was sold to on the Rockwell corded (this will out perform cordless any day). Also received a discount from on line purchase that the big box stores couldn't beat, ordered optional blades also so now I'm equipped to tackle any job. I have my dad's Rockwell circular saw that is about 50 years old and still preforms well, plan to have this one last as long.",
            "author": "Terrible Ted",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"THE MIGHTY MIDGET\"",
            "rating": 5,
            "date": "02/06/2016",
            "recommended": true,
            "text": "I was tired from lugging around the standard 7 1/2\" Circular saw and found it too difficult to work in tight places. When I saw the Rockwell 4 1/2\" I knew I had to have it and extremely glad I did. It's light weight but weighty in power and to hold this saw you know it's going to perform. I do highly recommend this product and only found out by trial and error that it's not a good idea to push the saw through your workpiece. Move slowly and accurately and this saw will perform flawlessly. I have four Rockwell products and proud to have them in my tool arsenal and look forward to adding to it.",
            "author": "bungalowjoe",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Big Little Saw!!!!!\"",
            "rating": 5,
            "date": "07/02/2015",
            "recommended": true,
            "text": "I purchased this fantastic saw from Lowes for the purpose of cutting plywood sheets to board up an empty house to keep squaters out until we can renovate it later this summer. The saw just blew me away!!!!! It has plenty of power and with its light weight you can cut all day and never get tired. I boarded up 18 windows, 3 entry doors and a good sized hole in the kitchen wall. The Rockwell never hesitated once, never got bogged down and ran smoothly the whole time. I have since used the saw for another half dozen little projects and it has quickly become my go to saw of choice. I would recommend this saw to anyone DIYer or Contractor needing a reliable circular saw. It is absolutely a WINNER!!!",
            "author": "Ned1969",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love it!!\"",
            "rating": 5,
            "date": "02/21/2015",
            "recommended": true,
            "text": "My husband bought this for me for Valentine's Day (cuz he's awesome!) and I used it for 2 3/4\" plywood pieces I had glued together (1 1/2\"). It zipped right through the stock with NO problem! It's smaller and much more handy then a circular saw. The only problem (if you could call it that) is the dust collection port is small, think household vacuum not shop vac. I wish there was an adapter. But it takes the dust away from your eyes so that's always good. It was very easy to use, light weight but heavy enough to be powerful, strong, well balanced, and wasn't super loud like a circular saw.",
            "author": "Alwaysbuildingsomething",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"One of my favorite tools\"",
            "rating": 5,
            "date": "03/01/2016",
            "recommended": true,
            "text": "After reading a few reviews, I picked up one of these saws to take care of some specific saw cut needs for a bay window project. Now I rarely even get out the \"regular\" circular saw any more! This thing is so easy to handle and it is really pretty powerful. It's worked for plunge cuts, detail cuts, and I even cut up scrap with it. Goes through plywood exceptionally well and also adjusts deep enough for a 2x4. Best of all you can confidently use it one-handed very safely and accurately. The thin blade profile is very helpful and makes the difference on several project needs; it works for things I wouldn't have taken a chance on with a larger circular saw. I'm really just very happy with this tool.",
            "author": "Big 186",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Only one problem for me\"",
            "rating": 4,
            "date": "11/30/2017",
            "recommended": true,
            "text": "I purchased this saw to do reparations to my home after my home was flooded by Hurricane Harvey. My intent was to cut out sheetrock and cut baseboard. I ended up using it also to cut a few pieces of ceramic tile. \nThe saw performs very well. I like the depth adjustment feature as well as the miter setting. However, being female, my hands are smaller than the average male and I find it extremely difficult to hold the safety button and trigger at the same time. My hand and arm become very fatigued after a short time using the saw. It would be great if the handle were a little slimmer.",
            "author": "Delype",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rockwell Compact Circular Saw\"",
            "rating": 5,
            "date": "04/19/2015",
            "recommended": true,
            "text": "I purchased this compact circular saw in order to do one specific project. I had a close quarters cut I needed to make under my deck in order to trim 2\" off a nailer board so that I would have room to install an under the deck drainage system. I would be standing on a ladder, with both arms over my head, cutting a 10 foot board. No other saw was small enough to fit the space or cut deep enough to do the job. The cut was not easy, but I got it done with the Rockwell Compact Circular Saw. I have since used the saw for a number of other small jobs for which that it worked perfectly.",
            "author": "Skip",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Light weight!\"",
            "rating": 5,
            "date": "06/07/2015",
            "recommended": true,
            "text": "I love this saw! I use it for my smaller projects but it handles like my full sized circular saws. The only improvement I would recommend is to move the safety switch further up the handle, you need to depress the button with your thumb before pulling on the trigger switch underneath with your index finger and I find it a little awkward as I have to really stretch my thumb to reach the button and my hands are not small at all, if I lay my hands on a flat surface palms down and measure diagonally from the tip of my pinky to the tip of my thumb it is 10 inches long and I still have a hard time reaching the button with my thumb. Otherwise, this is a great little saw, very convenient and powerful for it's size.",
            "author": "Beenze",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Overall a Great Little Tool!\"",
            "rating": 5,
            "date": "07/10/2017",
            "recommended": true,
            "text": "This is a great little tool that works well.   Been cutting through boards with ease and no issues at all.  My only complaint is that I wish the \"over ride\" safety button was in a different location.  I understand that safety is the issue, but it is hard to push the safety and the power at the same time, so I have to use my other hand to press the button and therefore let go of the work I am holding.   Not a major issue, but a little bit of a pain.  Overall I love the product and would buy once gain.  So much easier than lugging out my Circular Saw.   Highly Recommended. [This review was collected as part of a promotion.]",
            "author": "HistoryOfTheYankeesDOTcom",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Too convenient\"",
            "rating": 5,
            "date": "07/10/2016",
            "recommended": true,
            "text": "I got this little saw because I started making chicken coops and dog houses. I was framing with 2x2s and 1x2s and using 3/8 plywood and luan. This thing was so powerful I was sing it on full 2x4s and 6s along with 1/2 and 3/4 plywood. The worm drive allowed it cut anything I put it to. Also, it's so compact it fits right in my toolbag. If I'm going on a roof or something, it fits in my nail pouch. A must have for quick easy access to a saw without taking out the full size. Honestly, I beat the heck out of it as my main saw. No signs of getting tired. I love this thing.",
            "author": "Farmer Bill",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Well engineered product!\"",
            "rating": 5,
            "date": "07/13/2016",
            "recommended": true,
            "text": "I got this as a gift on Father's Day. I do a lot of woodworking and constructing. I have used my Craftsman 10\" power miter saw and my Craftsman hand-held 8\" circular saw for years. They are now collecting dust in my garage. The engineer that designed this Rockwell 4-1/2\" Compact Circular Saw should be commended! Easy to handle, easy to operate, extremely portable and has easily and neatly cut through every challenge that I have put it up to. Great power tools are hard to find today. This is the perfect power hand saw for professionals and amateurs alike. Great job!",
            "author": "JoeEng",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Don't waste your money!\"",
            "rating": 1,
            "date": "03/03/2019",
            "recommended": false,
            "text": "Underpowered, rattles itself apart.  Couldn't cut a straight line even with a saw guide.  Design is horrible for use.  The location of the safety switch and power button just don't work!  Who designed this thing?  Obvious someone who has never done carpenter work or any kind of projects that would require its use.  Good idea, pitifully executed.",
            "author": "Ric",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 4,
                "no": 2
            }
        },
        {
            "title": "\"nice easy lightweight powerful tool\"",
            "rating": 4,
            "date": "11/11/2015",
            "recommended": true,
            "text": "glad I bought , lightweight and powerful. long cord is nice. reaching out to cut is so much easier because of the above statement. the only thing I regret is that it came without a case for us that try to keep our tools in new condition and are too organized. really wish that it had a case for storage. tool itself is great, like to keep it that way is why it needs a case, tool deserves more than being tossed into a pile with other tools. Rockwell needs to respect there products better at the customer level and give us the protection at the storage level too..",
            "author": "bill123",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact Circular Saw Winning Attributes\"",
            "rating": 5,
            "date": "12/27/2017",
            "recommended": true,
            "text": "I bought the 4-1/2\" compact circular saw on line and was hoping for great features and attributes from Rockwell.  The first attributes was the blade guard ease of mounting and use when cutting; Safety first! the second was the sturdy case and ease of a ergonomic grip; Second part of safe use. The third wonderful feature is the ease of changing the blades which is essential for efficient use in the field. Lastly was the quietness compared to the other vendor's saw I had. Noise is a hazard and also a hindrance to running the saw safely with other in the area.",
            "author": "LT2GO",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Useful for most woodcutting jobs\"",
            "rating": 5,
            "date": "09/15/2015",
            "recommended": true,
            "text": "On my horizon I did not see a small, worm drive circular saw. A small shelving job in another state (without my tools) required a saw, so I picked up the Rockwell RK3441K. I figured it would be sufficient for that job and I was curious. It surpassed my expectations. It cut well. It was easier to make a smooth cut faster. I like the dust extractor hookup. Even without a dust extractor it lets me direct the blow of the sawdust. It is now my handheld saw of choice. I use others only when the job requires it.The only downside for me is that the blade is special to the tool; I believe one is stuck buying the Rockwell blades. This leaves one vulnerable to having to buy a whole new saw if Rockwell stops making blades with those specs.",
            "author": "George3",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I can't get the hang of it\"",
            "rating": 1,
            "date": "11/30/2016",
            "recommended": false,
            "text": "I've tried to like this. First I find the safety button/lever is tricky to hold and also pull the the power lever. I feel like it distracts me more than it helps because I find I keep needing to pay attention to whether or not I have it fully engaged. Secondly, I have a difficult time getting the blade to keep going without getting lugged up and stopping. Again I find myself distracted trying to get the plate flat and in place so the blade will engage and keep going. You have to physically push down on the plate at just the right angle or the blade won't move. I really don't like it. It doesn't work like a real full sized circular saw. I'm extremely disappointed in it. The multiple safety features actually make me feel unsafe using it.",
            "author": "CaliforniaCbeee",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best compact saw for anything you can think of\"",
            "rating": 5,
            "date": "11/28/2015",
            "recommended": true,
            "text": "I just picked up this saw today and I have to say I am impressed. I've owned other battery operated or plug in portable handheld saws in the last that just couldn't cut it pun intended. I have been using all day to cut and lay 170sq ft of flooring and it has cut perfect every time. I have a 30 year old Rockwell table saw that still works great and I feel like this saw is just as solid as my old reliable. It feels great one handed I do agree with other reviews that the safety is kinda awkward for short fingers but you get used to how it works.",
            "author": "Brix",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Little Saw/Great Job\"",
            "rating": 5,
            "date": "02/14/2015",
            "recommended": true,
            "text": "I have had my saw over six months but I have used it more than I ever thought I would when I purchased it. This saw was got with the thought I would use it only on a little job or small projects. But I got hooked on this saw after the first cut. Since, I have used it in the shop and on jobs that I would never seen me doing the day I got it. It's easy to use, easy to get great cuts, being wood from pine to hardwood, being tile that is small to big size tile. Small Saw that is well worth the money and handle jobs that will surprise you.",
            "author": "txrick",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Hobert Monk\"",
            "rating": 5,
            "date": "01/31/2019",
            "recommended": true,
            "text": "I purchased this saw for the sole purpose of cutting cement blocks. I completed by project of trimming cement blocks to fit around the tree I had planted. The saw performed way better then I expected. I would highly recommend this saw for all the small project you have requiring a saw. I did not have to drag out my regular skill saw that larger and more awkward.",
            "author": "Hobie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Handy, Durable & Cuts a 4 x 4\"",
            "rating": 5,
            "date": "01/17/2017",
            "recommended": true,
            "text": "This is my second Rockwell after thoroughly abusing my first one in the whole home renovation.  It's just so darn handy and light that I grab it every time over my skill saw or chop saw.  You can easily adjust it to cut any angle. I like to teach my teens how to handle power tools and this is an excellent introduction tool to build their confidence. This saw is great for working in confined spaces and for quick jobs where you just need to cut a board here or there.  Value for money is exceptional.  You won't regret this purchase.",
            "author": "Adie88",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"4 1/2\" Circular saw\"",
            "rating": 3,
            "date": "03/15/2016",
            "recommended": true,
            "text": "I bought it about a month ago. Seemed like a good investment. Got it home pieces were missing. Company shipped missing parts right away no problems. A little bit disappointed, I read how the blade likes to bind since the blade is so thin. I never thought it would bind and jump cutting something as simple as drywall. Man drywall looks ugly. Perhaps I need time to get to know the tool better, I have some tools that after awhile I have become a pro with them, I am hoping this will be the same. Tool might need patience.",
            "author": "Mikey2148",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Only one I don't like\"",
            "rating": 4,
            "date": "05/01/2019",
            "recommended": null,
            "text": "There is only one thing I don't like about this saw. I agree with the reviews that criticize the placement of the lock-off button. My hands/fingers are too small to hold the tool and push the lock-off button with the thumb I am holding the tool with. I find that I have to use my other hand to press the lock-off button and then press the start trigger with the hand I am holding the saw with. I am thinking that I shouldn't have to use two hands just to get the saw to operate. Otherwise the saw works pretty good.",
            "author": "noname",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Runs great but .........\"",
            "rating": 3,
            "date": "07/25/2015",
            "recommended": false,
            "text": "Bought to do some light work on church pews thinking I would get a better cut with little damage to cut area, however, cutting approx. 1 3/4 inch pew support, the saw drifts away from the cut line. After two attempts and inspecting saw for blade looseness, etc. , set the saw aside and used my ole 7 inch saw. Have new blades on order but only ones I could find for this saw is the original Rockwell blade. One of my buds suggest maybe the blade is too thin causing the drift. I will try it again on smaller job.",
            "author": "ervski",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Doesn't cut a straight line.\"",
            "rating": 1,
            "date": "06/25/2015",
            "recommended": null,
            "text": "I needed a saw a compact corded circular saw like this badly. I regularly cut stacks of plywood board totally about 1\" in depth. I was using a cordless saw but I get sick of changing the battery. I use a common pine board as a fence to keep the cut straight. Heres what happens with the rockwell saw when cutting along a fence, it will bind to the point where its impossible to push the saw any further. This happens because the saw blade is too thin. The thin blade will warp and bend shortly into the cut, it walks the saw toward the fence causing a bind. I'm very disappointed. I'm searching for a way around this problem and I shouldn't have to. As much as I hate to admit it I think I'll have to take this saw back to Lowe's. I cant find a thicker blade anywhere. The blade is TOO THIN.",
            "author": "Flewggle",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good saw - awkward handle\"",
            "rating": 4,
            "date": "04/01/2015",
            "recommended": true,
            "text": "I've used a worm drive since 1967. I'm no good with a sidewinder, can't see the blade and they bounce too much. Elbow worn out. So I bought this one. It's light and strong but the grip is awkward, especially when set for shallow cuts. I'll use it but less because of the lack of a grip handle. It's cool, it's fun, but could be better.BUT, my big gripe is this, Where in this product description is the warning that no one on earth makes 4 1/2 inch. 3/8th arbor blades except for Rockwell!!!",
            "author": "Raylan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent little saw!!!\"",
            "rating": 5,
            "date": "03/15/2015",
            "recommended": true,
            "text": "Bought mine in February and found it to be a perfect tool for the DIY projects I need to do to my RV. Fantastic for plunge cutting, easy to handle and comfortable to use. I love that it can cut up to 2 inches deep and that you can also angle the blade if needed. It's pretty versatile for a compact saw. MY only problem, being a very small female, is that I have to use my left hand to push in the safety button so that I can use it. Not a huge inconvenience given the way this tool performs.",
            "author": "animalangel",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rockwell tools ROCK!!!\"",
            "rating": 5,
            "date": "04/06/2017",
            "recommended": true,
            "text": "I own 3 tools from Rockwell and very impressed with the ease and more important their quality. With the asscessories that come with these tools makes it a breeze to complete the DIY projects around the house! I let all my neighbors, friends, and coworkers about them and highly recommend them to get Rockwell products. My next purchase will be the Bladerunner X2 tabletop. Believe me everyone, get their tools and you will see and it doesn't cost an arm and a leg which helps the wallet too!",
            "author": "Sam T",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Killer little saw!!!\"",
            "rating": 5,
            "date": "12/04/2017",
            "recommended": true,
            "text": "I've been contemplating buying this saw for quite some time. Finally I pulled the trigger. I couldn't be happier! I put it to work immediately. The thin blades blasted through some really heavy wet pressure treated 2x6's with no problem. Love how the blade is on the left side, easier to see what you're doing. The zero mark is spot on. The only thing I don't like is the safety button, kinda awkward, but if that's the only bad thing I can live with that. Keep the awesome tools coming!!! [This review was collected as part of a promotion.]",
            "author": "Scooter",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"The Tool for Cutting Plywood\"",
            "rating": 5,
            "date": "12/04/2015",
            "recommended": true,
            "text": "This is my favorite power tool. I have been building speaker cabinets, and the Rockwell Compact Circular Saw is significantly easier to use with 1/2\" and 3/4\" plywood than is a full-size circular saw. The cuts are easy, precise, and with a reasonably fresh blade, surprisingly clean. I'm sure it works well on lumber, too, but especially if you do a lot of plywood and panel work, adding this tool to your shop is a no-brainer. Make yourself a zero-clearance cutting guide and go to town.",
            "author": "Doug",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome.  Great little tool.\"",
            "rating": 5,
            "date": "03/07/2017",
            "recommended": true,
            "text": "I help a neighbor build decks, redo furniture and make shelving.  He had a big circular saw and I decided I wanted this one.  He has about taken it over.  I also have the versa cut by Rockwell but I really wanted one that would actually cut 2 x 4\".  That was the first thing I cut with ease.  The different blades makes it a fantastic all use saw.  It is well balanced and easy to hold without any problem.  The power is great for this little baby. Glad I got it and so is my neighbor. [This review was collected as part of a promotion.]",
            "author": "Cheri in Mississippi",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A pleasantly complete package\"",
            "rating": 4,
            "date": "12/31/2016",
            "recommended": true,
            "text": "I received this saw as a gift, and am pleased with it so far. The saw is powerful and easy to use, and comes with an effective dust port adapter and cutting guide. The included blade cuts framing materials with ease. My only criticism (and why I'm not giving 5 stars) is that it is difficult to tell exactly where the blade is even using the notch/mark at the front. I suspect that with enough practice this will not be an issue, but it would be nice if it was easier to see the blade.",
            "author": "Sameer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great for DIY projects\"",
            "rating": 5,
            "date": "05/25/2015",
            "recommended": true,
            "text": "I have purposely stayed away from doing projects that would require big circular saws...not sure why, but they have always made me uncomfortable. When I saw this saw and read it was capable of cutting a 2x4, I knew it was my answer!It works great and I have used it several times now. If there is a real down side is that it doesn't come with a case or bag...and it is too long to use a generic tool bag. I have found it frustrating to not have it in a case to store and to carry.",
            "author": "karen",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Saw!\"",
            "rating": 4,
            "date": "09/26/2017",
            "recommended": true,
            "text": "We purchased this saw because it can do everything that a heavier, larger, circular saw accomplishes.  My Guy loves the light weight and the miter feature.  However, as a gal who would like to be able to use this tool, I cannot because the grip is too large for my hand and fingers.  I can barely get my fingers around the grip and then I cannot depress the start button; very frustrating.  I wish that Rockwell would design tools specifically for women who have smaller hands. [This review was collected as part of a promotion.]",
            "author": "Sogal",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good for price\"",
            "rating": 5,
            "date": "07/07/2019",
            "recommended": null,
            "text": "Does what i needed it for. No issues. Cant speak for longevity as ive only had it for a little over a month but works great.",
            "author": "Bobby",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Little Saw\"",
            "rating": 3,
            "date": "06/07/2018",
            "recommended": true,
            "text": "I am an avid woodworker and spend all my free time in my workshop. My wife bought this saw for me last Christmas and after using it I feel I need to leave this review. The saw has a lot of power for a little saw but is hard to keep on line. The dust port works very well but when attached to a vacuum, the hose drags across the project and can block your view. My biggest complain with this saw is the safety button you have to push before the saw will start. I have very large hands but I still can not start this saw with one hand (unless you are left handed). This button need to be repositioned so that a normal person can push the safety button with their thumb while starting the saw. I would buy this again if the button problem is corrected. I am trying to figure out a way to bypass the button or convert it to a switch.",
            "author": "Double_D",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"It's a winner with me\"",
            "rating": 5,
            "date": "04/23/2019",
            "recommended": true,
            "text": "I bought mine about two weeks ago. Recently bought an old, old house that is a fixer upper. I have been putting in some new cabinets and a closet upstairs and this has made it so much easier to get the job done.  Have lots of trim, cabinets and smaller jobs that need to be done right there, instead of running to basement or outside to cut pieces. It is the perfect size for smaller jobs, haven't had any issues with it. In fact I just bought another one to give my son.",
            "author": "Jenm",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Rockwell saw\"",
            "rating": 5,
            "date": "05/10/2019",
            "recommended": true,
            "text": "This saw is powerful and versatile. Ot adjusts for depth and angle. It gets huge job done.",
            "author": "KH",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Great tool except?\"",
            "rating": 4,
            "date": "01/15/2016",
            "recommended": true,
            "text": "I've used this tool for the past six months... long enough to realize that whoever designed the placement of the red safety button that must be depressed before the power trigger can be activated was not a serious user of compact circular saws. My whole reason for purchasing this saw was to be able to use it in hard to reach angles/places. My hand size and wrist dexterity is certainly average, but incapable of easily operating the trigger unless I'm standing directly over the saw in the simplest cutting position.I purchased this saw because it was one of the few that had a platform that could be rotated for depth of cut and for angle of cut, and it had plenty of power. It is a great saw for those reasons alone. Don't buy it if you think that it will be easy to use in hard to reach places. Absolutely buy it otherwise.",
            "author": "RobertLJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best tool money I ever spent\"",
            "rating": 5,
            "date": "03/09/2015",
            "recommended": true,
            "text": "I've owned my saw for over a year and a half. I can't remember when I have used one of three 7.25\" saws I own. I always go to my Rockwell. Makes a beautiful rip cut of 2 x 4's, crosscuts, and cuts in plywood/paneling. As with any power tool you need to use it a while to get comfortable with it. While ripping some .75 plywood while working with a couple of co-workers, they both said they were buying a Rockwell. It's simply the best tool purchase I have ever made.",
            "author": "todd",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best circular saw ever\"",
            "rating": 5,
            "date": "12/07/2017",
            "recommended": true,
            "text": "I build dollhouses and this little saw is spectacular for plywood of all thicknesses.  Lightweight, straight easy cuts and no splinters or chipping.  The only problem is with the safety button.  If you have small hands like I do, you have to be a contortionist to hold the safety button in while activating the on button.  I solved this problem by putting a small screw in the side of the safety button to hold it in.  Really like Rockwell tools and their quality. [This review was collected as part of a promotion.]",
            "author": "Uncle Bobbys Hobbies",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"VERY VERSATILE\"",
            "rating": 4,
            "date": "12/01/2014",
            "recommended": true,
            "text": "Comes in very handy when you really don't need a larger saw. Light weight and still has enough power. I use it primarily around the house for odd jobs, so most times a battery powered tool is really not necessary. I would have given it 5 stars, but, mine was missing the parallel guide as shown with items that should be included. The other thing that I don't understand is that this is a 4 1/2\" saw, but on your web sight you only sell 3 3/8\" blades.....Why ???",
            "author": "BULLDOG NICK",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very good,but could use some improvements\"",
            "rating": 3,
            "date": "10/09/2018",
            "recommended": null,
            "text": "I have been working with Circular saw for month. I used it for small cuts and taking out engineered hardwood flooring at 5/8 in. It worked well, but even after tightening the blade, it would manage to come slightly loose after about 1/2 hr. of use. You have to make sure that the blade is tight with the allen wrench periodically. Measurements worked well for adjusting depth.\n\nThey could have also given you a bag to store it in. There was none in my box.",
            "author": "murfman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Finally, after all the years...\"",
            "rating": 5,
            "date": "01/09/2016",
            "recommended": true,
            "text": "Tool manufacturers are adding nominal-cost features that make operating more pleasurable for example; the power cord is longer than what used to be referred-to as 'industry standard'. Not only that, there is a band of velro attached to the cord making it quik and easy to pack-away at the end of the work-day.Having this light-weight versatile equipment actually makes my day more productive!I still use the heavy 71/4\" saw but only for heavy framing jobs.",
            "author": "Notachump",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/06/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "leonard",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/22/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Pam",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Outstanding customer experience\"",
            "rating": 5,
            "date": "03/23/2016",
            "recommended": true,
            "text": "While I haven't had the opportunity to try out the saw yet (I will next week), this review is about the experience I had purchasing this saw through Rockwell. As a marketing professional, I have a special appreciation for B2B and B2C e-commerce sites that are well designed, easy to navigate and most importantly, a customer order process that works fast and efficiently.Ordering the saw was easy and it arrived much sooner than expected. After receiving the saw, still researching additional tools I'll need before starting my project next week, I contacted Rockwell to see whether another manufacturer's rip-cut guide would work with this saw. I didn't get the response I hoped for but the response was fast. It's these little things that make for a great customer experience and that will make me think Rockwell first before buying another tool.",
            "author": "ddobski",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact and powerful\"",
            "rating": 5,
            "date": "05/14/2015",
            "recommended": true,
            "text": "I am a home maker and not a experienced handyman. I own the Versa Saw and I use it a lot. I have a lot of tools just because I like owning and learning to use them. This compact circular saw is the just want you need to cut those 2x4's and not have to drag out the old, heavy full size circular saw, which I do own.I saw the infomercial about this tools quite some time ago but put off buying it until I was working on building a shelf and needed to cut some 2x4s. This tool does just what it says it will do. It is powerful and oh so handy. This tool is lighter than a full size saw but it is not lightweight.The Rockwell tools are 5 five for my needs. The only disappointment that I have is that it did not come with a carrying bag. The tool came an attachment and the bag would allow you to store and carry it easily. Now I have to find a bag.",
            "author": "MsCat WV",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Would purchase another\"",
            "rating": 5,
            "date": "06/09/2016",
            "recommended": true,
            "text": "I would not rate this a 5, but it's not a 4 either. Holding both switches is a bit querky and very difficult to use left handed, sometimes there are cuts where you have to switch hands. I wouldn't call this the most ergonomic tool I've ever owned but it certainly has power and a place in my tool corral. I would like to see a greater selection of blades, especially fine tooth carbide. It would probably suit the one tool novice just fine.",
            "author": "Tony2tools",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Design for someone with 10\" hands\"",
            "rating": 1,
            "date": "03/03/2018",
            "recommended": false,
            "text": "Didn't you test this saw with real carpenters before you released  it? I bought it to use in tight areas in my remodel jobs...My Dremel does not have the power or blade depth... your saw with the safety buttons make it impossible to use... i have to tape the switches! which is even more crazy than cutting, hanging upside down, 12' feet up... idea is great design sucks!  Back to trying to cut a straight line with a sawzall with one hand [This review was collected as part of a promotion.]",
            "author": "baggs",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Poorly made\"",
            "rating": 2,
            "date": "08/13/2015",
            "recommended": false,
            "text": "Was impressed when I first purchased this saw. It is small and light weight. After using it, I changed my mind. The locks for angle and depth cuts are poorly designed and come loose very easily. The sliding cutting guide lock bolt will not hold the guide in place. Don't expect a lot of power when cutting either. This saw is for small and light weight jobs only. The real value of this saw is about $39-40, not the $90-100 price.",
            "author": "GJRH",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/27/2015",
            "recommended": true,
            "text": "I am a female senior citizen in age but in action much younger. I perform numerous needed tasks in my home. When a tree branch fell I would use my circular saw to cut it up big and bulky but now I can use the Rockwell small circular saw which is not too heavy and very controllable. I also repaired a fence easily. It is a great design and a long time in coming for those of us who are independent and enjoy projects and repairs",
            "author": "Denise",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Saw.\"",
            "rating": 5,
            "date": "10/24/2014",
            "recommended": true,
            "text": "I bought this a couple weeks ago. Had a project to put brick molding around my windows. Needed a smaller saw, this saw fit the bill. Small enough to get into tight places, and has the power to do the job. Adjusts easy to different depths and angles just like the bigger ones. The only compaint is that I'm Left handed and the little red button to engage the trigger is annoying, but you get used to it. Great Saw and well built.",
            "author": "BearPaw Dave",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Small but mighty\"",
            "rating": 4,
            "date": "06/06/2015",
            "recommended": true,
            "text": "I bought this saw to cut framing studs and do general construction work. It I very compact and light weight which allows great handling yet it cuts through material fast. My contractor has been so impressed by this little saw that he now wants one. This is definitely a go to for me. I wish there was a cordless version . I also don't like the placement of the unlock button. It can be awkward to press when doing some cuts.",
            "author": "casarojo40",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Perfect hand held saw\"",
            "rating": 5,
            "date": "03/17/2015",
            "recommended": true,
            "text": "I was cutting rafter ends with a regular skillsaw trying to hold on with one hand. i bought this saw. and did the same job in less than half the time; very easy to control and the power is endless. The man that was helping me loved the tool so I snuck out and bought him one for his help. He also uses the tool every day. The only thing I would change is the location of the safety button so you could get your thumb on it.",
            "author": "flywheelz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I like the compact size without giving up power.\"",
            "rating": 5,
            "date": "05/11/2016",
            "recommended": true,
            "text": "I just received mine today and went right down the shop with it to see how well it cut 2/6s. Cut through with no problems. Over all it looks to be a great addition to my shop tools. Now how long it lasts? I don't know yet. Only one thing I don't like about the saw is the lock off button. I have small hands and it's hard to push the lock button and still be able to squeeze the on switch without almost using both hands.",
            "author": "rustynuts",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Poorly designed\"",
            "rating": 3,
            "date": "07/02/2019",
            "recommended": false,
            "text": "My thumb doesn't reach the safety release button because it is located too far down on the left side. Poorly designed ergonomically. Also, the left side of the shoe needs to be twice as wide. You won't be able to cut as close to a wall, but there is not enough shoe exposed to keep the saw flat on end cuts. Cutting from the left side of a saw horse means the numbers on a tape measure are upside down.",
            "author": "Ken",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Has its uses, but.....\"",
            "rating": 2,
            "date": "09/09/2017",
            "recommended": false,
            "text": "First thing.... I Hate the safety button on trigger.  Then the Shoe Base sides are not parallel to the blade, which makes the parallel guide bar kind of useless.  Blade was not set at 90 degrees to base shoe and could not be set to 90 due to base shoe being poorly made, I had to modify shoe to get it to go to 90 degrees from saw blade and it barely gets there. Quality of shoe base is not there, too flimsy and poorly made, the saw is basically only good for doing a quick cutting of a 2x4 or some thin sheet stock, Rockwell needs to work on this saw's design some more. What happened to quality control checking??? Over all I like the idea behind this design but Rockwell needs to do better at building it. If your looking for a precision tool, this is NOT one by a long way!!  If your just looking for a tool to whack a few 2x4's without pulling out the big heavy guns then this might work.",
            "author": "Dewalt57",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works like a charm\"",
            "rating": 4,
            "date": "10/10/2016",
            "recommended": true,
            "text": "Saw works great. Built like a tank. Used it cut about 1/4\" thick steel plate. Just a short cut, maybe 2\" by 3\". My intent is to only do something like this ONCE. Used the diamond tile blade which worked fine as long as I did not push it too hard. I don't really recommend using this on steel but I was too lazy to use a hack saw. I'm sure this will cut wood and drywall like a hot knife through butter.",
            "author": "Toolpal",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A Beautiful And Powerful Saw For It's Size\"",
            "rating": 5,
            "date": "04/12/2016",
            "recommended": true,
            "text": "I've used a number of hand held electric saws in my time and this one beats them all. When I watched and listened to it do a horizontal cut to replace the defective siding all the way around the house I could hardly believe how superior it was to the old, reliable, cumbersome, 7 1/4 inch saws we all have used. It really is a lightweight performer with a lot of muscle. I'm tickled that I bought it",
            "author": "Lazysb",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/25/2016",
            "recommended": true,
            "text": "I am a home builder / contractor for 35yrs .I bought my Rockwell saw a week ago as I needed a smaller saw to cut in tight places where my 7 1/4 worm drive saw is too bulky. I have used the Rockwell saw everyday and have to say it is a great investment and easy to use. I have the same problem as others finding blades for the Rockwell saw.Lowes store did not have a single 4 1/2 blade with the 3/8 arbor as all Lowes had were 4 1/2 in blades with the 5/8 arbor.. Maybe Rockwell could make an adapter ring/insert so a 4 1/2 in blade with 5/8 arbor could be used since they are common in most lumber yards.I really like the Rockwell saw and will have to buy blades online from Rockwell since they are so hard to find..The only down fall is the availability of saw blades for the Rockwell besides that I can't think of anything negative to say about the saw.Great power. easy to use. price is right.",
            "author": "Nailer45",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent small saw\"",
            "rating": 5,
            "date": "12/04/2014",
            "recommended": true,
            "text": "I make furniture and mainly need to rip plywood up to 3/4 inch and most a 4 by 2. Had tried a couple of other brand cheap circular saws and returned them. Bought this on a special deal at lowes. Only had it less than a week but found it excellent so far. as a \"lefty\" the safety release on the left is ideal. The vacuum port is great too and helps remove almost all of the dust. Very pleased so far.",
            "author": "SuwaneeGuy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Not what I needed for my project type\"",
            "rating": 2,
            "date": "02/27/2019",
            "recommended": false,
            "text": "This was needed to cut a piece of veneer and I asked the sales person on the floor for a blade as well.  This ripped the veneer and later I found out I should have had a blade for cutting a panel, something very smooth.",
            "author": "Bernadette",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"What a great saw!\"",
            "rating": 5,
            "date": "03/28/2015",
            "recommended": true,
            "text": "I bought this saw off the reputation of the smaller Rockwell saw I have. I have not touched my old Craftsman circular saw since I got my first Rockwell. I have been remodeling a bathroom including a new construction of a double shower. I have not needed to touch another saw since I started including the cutting of the concrete backer board. I wouldn't trade my Rockwell saws for anything.",
            "author": "Joeybear1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"NOT for small hands!\"",
            "rating": 4,
            "date": "11/17/2014",
            "recommended": true,
            "text": "Bought this at Lowes in October \"14, and had to return next day. My short fingers made it difficult to press both buttons at the same time. Saw appears to be well built and would have been a good addition to my tools. Did not cut anything because of hand/switch issue, felt I could not get a good enough grip on it even with smaller area around switch. Back to the 6.5 in. trim saw.",
            "author": "btderby",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerful Compact\"",
            "rating": 5,
            "date": "07/11/2015",
            "recommended": true,
            "text": "My wife purchased this for me for Father's Day. She knows how much I dislike my regular size circular saw and thought this would work better for me. She was correct! I like the smaller blade. It is easier to handle. I like the adjustable blade depth & angle. It cut pressure-treated wood for outdoor use with ease. I like how the blade stops when the red button is released.",
            "author": "HomeRepairHubby",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Perfect for me!\"",
            "rating": 5,
            "date": "03/10/2015",
            "recommended": true,
            "text": "This smaller than a regular circular saw is great for me I can handle it wonderfully for all of what I need it for it's not huge like some of the other ones and is great to take with me. Don't let the smaller size fool you I've had no problems cutting through the things I need to cut through and is lighter so that I have no problem holding for extended periods of time.",
            "author": "teel0",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great Tool\"",
            "rating": 5,
            "date": "04/01/2015",
            "recommended": true,
            "text": "I liked everything about this tool. Cuts really well with a lot of power for size. The red button that you need to press before you depress the trigger to work the tool was a little awkward to use. I had to work with the tool in both hands and that button only works ok with one hand as opposed to the other. That is something that should be looked at for future models.",
            "author": "rford3678",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very good buy\"",
            "rating": 5,
            "date": "12/02/2017",
            "recommended": true,
            "text": "Purchased this saw for our son-in-law for Christmas,also purchased two saws about two or three years ago for me and our son,we both like the versatility of this saw,there is a lot of good features this saw provides,really like the compact size,very good for smaller cutting and can be used for larger jobs,no need to bring out the 7 1/2\" saw,I would recommend this saw. [This review was collected as part of a promotion.]",
            "author": "By Bernie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Must have for any serious DIYer!\"",
            "rating": 5,
            "date": "01/16/2019",
            "recommended": true,
            "text": "I have this 4 1/2 saw for about 3 years now and cannot be happier. Bought as an alternative to having regular size saw, this little one did all the jobs and I still don't need to buy a big saw. The supplied blade is OK, but I installed Diablo blade which makes cleaner cuts. Rockwell, please don't discontinue this saw since when it breaks, I will buy another one. [This review was collected as part of a promotion.]",
            "author": "geneluciano",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "05/11/2015",
            "recommended": true,
            "text": "i bought this circular saw about 2 weeks ago, received it a 4 day ago. i like it except for the saftey switch is way on the bottom and i have trouble starting it. this saw must of been designed for a person with super large hands. other than that it works nice when it start cutting. if the safty switch was a little higher it would make it an excellent tool.",
            "author": "carlito",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome - Powerful\"",
            "rating": 5,
            "date": "07/05/2018",
            "recommended": true,
            "text": "Don't let its size fool you. It has the same kickback as a 7-1/2” saw. Cuts thru 2x stock easily. Great for tight spots.  My bigger saws get a lot of rest with this saw. Great for toolboxes too.   The only minor thing I don't like about it, is the trigger permissive button.  It requires a little more thumb flex than I have to depress it to pull the trigger.",
            "author": "Navy Davie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Handy saw in my shop..\"",
            "rating": 5,
            "date": "12/03/2014",
            "recommended": true,
            "text": "Just got this saw at Lowes. I did not need another saw as I have several but I can't pass up a good deal. I neede to build another work table in my basement shop so I thought I would give the saw a try. I must tell you I was very impressed with this saw. Fit well in my hand, very light, very accurate and easy to use. Would advise you try it in your shop.",
            "author": "Holie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Not for me\"",
            "rating": 2,
            "date": "02/08/2019",
            "recommended": false,
            "text": "I like the idea of having a small saw around the shop so I picked one of these up.First thing I noticed is safety lock switch is not in best position for one hand operation, awkward reaching back with thumb, changing grip position. Also the blade has a tendancy to slip, I was not impressed with the locking method of blade. Won't be using this tool much",
            "author": "Paul58",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 2
            }
        },
        {
            "title": "\"won't cut straight\"",
            "rating": 1,
            "date": "05/13/2016",
            "recommended": false,
            "text": "I have a new one it was great for awhile then started not wanting to cut straight so I put a new blade in, that didn't work. I know it hasn't been dropped. it won't even cut straight even with a guide. I took it back and got a new one same story works great at first then it gets worse as time goes by. I would give this saw a 0 but that is not an option",
            "author": "wood man",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Maybe it's me.\"",
            "rating": 3,
            "date": "06/18/2019",
            "recommended": false,
            "text": "After reading all these 5 star reviews I hate to be different. I bought this saw for one reason - to trim about an inch off of 1x6 porch boards. After being able to cut through two the saw just quit, not running but cutting. Could the blade had dulled out that soon? I couldn't even cut through a small 1x4 piece of wood. Any advice would be appreciated.",
            "author": "Anonymous",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact and easy to use\"",
            "rating": 5,
            "date": "01/30/2016",
            "recommended": true,
            "text": "Very happy with this purchase, compared to a full size circular saw, it works just as well but easier to maneuver and not nearly as heavy. Given it's size you would think your giving up power, not the case, this saw goes right through boards with ease. Great features such as blade depth, angled cuts,and guide included. Will highly recommend to friends!",
            "author": "martyc4",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Bought wrong item\"",
            "rating": 5,
            "date": "06/04/2019",
            "recommended": true,
            "text": "This saw was recommended by a Lowe's associate to enlarge cracks on my concrete patio for filling.  It was the wrong tool.  Another associate (Louise at Wetumpka) corrected the mistake and fitted me with an angle grinder and proper cutting wheels.  All worked well after I followed her advice.  This saw probably works well if used for intended purpose.",
            "author": "Ken",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Satisfying purchase !\"",
            "rating": 5,
            "date": "01/21/2017",
            "recommended": true,
            "text": "I purchased this item on sale for about 65%\nof the next lowest price that I could find anywhere .\nIt arrived by Canada Post amazingly fast , in about 3 days .\nThe item seems to be extremely well made .\nAs I do not have a heated workshop\nI will not be using this item until this next spring\nand I shall comment on the functionality of it then .",
            "author": "jrw57",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"worst handle grip\"",
            "rating": 2,
            "date": "05/05/2019",
            "recommended": false,
            "text": "Didn't even use it once i opened the box. I have large hands and I have to say the grip on this is just poor. Was hoping by me having larger hands that it would suite me just fine. That was not the case. I Couldn't imagine using this in tight places. I will be returning this one. It did seem well built. Maybe their next design will factor this in.",
            "author": "Scrad",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/11/2017",
            "recommended": true,
            "text": "It's so easy to use and the Cut is very well, I did cut a very thin long piece about less than 1/4 of an inch from a 2x4x6, just followed the line I drawed that thin piece came out perfectly. I use the 7 in. Circular saw all the time, it's so heavy and hard to control. This is a very light weight and easy to carry to anywhere around the house. [This review was collected as part of a promotion.]",
            "author": "Homer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice little saw.\"",
            "rating": 5,
            "date": "04/28/2015",
            "recommended": true,
            "text": "I've spent nearly 50 yrs using the 7 1/2 \" Circular Saws and even the worm drive until I couldn't lift any more. I have built homes from ground to roofing and even finish, and cabinets. I like this 4 12\" saw for it's weight, compactness, ease of use, and precision. It took a little time to adjust but this will be great for my cabinet shop.",
            "author": "benz shop",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very easy to use and cuts great.\"",
            "rating": 5,
            "date": "02/14/2017",
            "recommended": true,
            "text": "I bought this about 4 or 5 months ago and had to replace some siding on my house and this was a much better saw then a big 8 or 9 inch saw to use up on the roof side.  I was trimming some of the siding and cutting 1/8 in off and worked just fine.  Glad I got it.  Told one of my daughters and she got one for her husband for Christmas 2016.",
            "author": "Jerry from VA",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Ease Of Use\"",
            "rating": 5,
            "date": "12/25/2017",
            "recommended": true,
            "text": "I am Senior Female, remodeling daughters house, and this saw is awesome! I bought my saw about 10 months ago, it is light weight, easy to use, cuts anything I would use a circle saw on, and everyone who has tried it, loved it. I just purchased two more for gifts, so mine is not on loan when I need it. Another Great Rockwell tool!!!",
            "author": "Alice",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Packs a wallop.\"",
            "rating": 5,
            "date": "12/23/2014",
            "recommended": true,
            "text": "I bought this saw at Menard's about 2 weeks ago and used it for the first time on a job last night. Cut through 1/2 plywood like a hot knife through butter. Very easy to handle and to cut a straight line. Red safety switch could be a little bigger. Overall, I am glad I bought it. It will be used in my carpentry/remodeling business.",
            "author": "oldguy64",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Solid saw!\"",
            "rating": 5,
            "date": "03/12/2015",
            "recommended": true,
            "text": "I bought this \"compact\" circular saw, with the intent of ending my frustration when my saber saw blade wouldn't give me a square, 90 degree cross cut while moving through a knot on the board. This Rockwell compact circular saw has been awesome, and I'm VERY SATISFIED with it's power. Thanks again for providing this \"compact\" tool.",
            "author": "Blaine",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"very strong saw\"",
            "rating": 4,
            "date": "10/23/2017",
            "recommended": true,
            "text": "Used saw to cut through ceramic tile on top of 1\" of cement mud floor with dimond blade and it did so whithout even any effort. Main purpose was to have a trim saw that can hadle going through 2x material in a single pass. The only thing that they may have changed was the safty button placement but it is not a deal breaker.",
            "author": "edfirn",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Too early to tell\"",
            "rating": 3,
            "date": "12/29/2018",
            "recommended": true,
            "text": "Bought this to replace older circular saw.\nLike the idea of a smaller saw which I presumed would be lighter to handle.\nThis is in part true but not as light as I would have expected. It also takes a larger hand than mine to handle and use effectively.\nHave made a few test cuts with the saw and it seems to do the job.",
            "author": "Toronto416",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good features - unable to purchase blades (RW8684)\"",
            "rating": 1,
            "date": "02/05/2018",
            "recommended": false,
            "text": "I bought this for my husband for Christmas and he was excited about using this new tool. He planned on using this for a tile project in our MBR bath but we were unable to find the blades. With that being said the tool is pretty much worthless! We have not been able to find the blades anyplace not even on line RW8684. [This review was collected as part of a promotion.]",
            "author": "Texans Fan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Straight Line cut, not\"",
            "rating": 2,
            "date": "07/18/2017",
            "recommended": false,
            "text": "I have had this saw for over a year. I also have the smaller Rockwell saw and it works great. The problem with this saw is that it will not cut a straight line for some reason. It will  not follow a straight line on the fence and even watching the blade directly. I wonder if the blade warps as it gets warm or hot.",
            "author": "Byron",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works great: powerful motor\"",
            "rating": 5,
            "date": "11/22/2017",
            "recommended": true,
            "text": "I bought this some time ago and it has performed flawlessly.  I only have one slightly negative thing to say:  the safety switch is hard to deal with when pulling the trigger.  If the switch had been mounted on top or bottom activating the saw would be easier.  This is why I checked \"good, good\" on the ratings.",
            "author": "Elton",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"rk 3441 Nice\"",
            "rating": 4,
            "date": "05/09/2018",
            "recommended": true,
            "text": "Good small circular saw that will cut 2x 4's with ease while allowing good up to 45 degree angle cuts . Good ergonomic design makes using saw easy. The location of the safety button on the left side of product is only annoying aspect iI found. Good product now made by Worcx using the older Rockwell Brand name.",
            "author": "Budster 1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Perfect size.\"",
            "rating": 5,
            "date": "01/21/2017",
            "recommended": true,
            "text": "I do scrollwork and need small backerboards for the fretwork.  Put larger sheet stock in my jawhose then cut it down to manageable size.  Don't need that bulky circular saw.  The only drawback is the safety button which must be pushed before the switch is activated.  Wish it was in a more practical location.",
            "author": "patom",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Perfect for most cuts\"",
            "rating": 5,
            "date": "08/24/2017",
            "recommended": true,
            "text": "Great for most jobs but really excels for me being lightweight.  As a woman, getting older and not near as strong with some arthritis, this tool makes all the difference.  Safer too because I have better control because of the light weight.  Donʻt have to lug out the full size circular saw for much anymore.",
            "author": "MaukaJo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Handy portable size\"",
            "rating": 3,
            "date": "05/08/2015",
            "recommended": false,
            "text": "I bought this saw as an addition to my circular saw. It is a great size and more powerful than I thought. The con about this product is the grip. It is too big to wrap my hand around it while pushing the safety button and trigger to turn the saw on. Huge problem. I have to use both hands to turn the saw on.",
            "author": "jaymack",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"poor design\"",
            "rating": 2,
            "date": "03/29/2019",
            "recommended": true,
            "text": "The safety button on the  left side is too far down to reach with your right hand while using the off/ on switch. This requires you to hold that button in with your left hand and squeeze the  start trigger with your right. Dangerous! The saw should also have a handle or grip on the front for better control.",
            "author": "Harold 78",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great little saw\"",
            "rating": 5,
            "date": "03/20/2019",
            "recommended": true,
            "text": "I think if you have reasonable expectations of what you can do with this compact circular saw you will be satisfied.  Seems to be pretty well made and did what i asked of it i.e. cutting plywood, pegboard, etc.  Haven't cut any 2x yet.  Sure like the blade being on the left for ease of following cut line.",
            "author": "C",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best Mini saw Built To Date!\"",
            "rating": 5,
            "date": "12/04/2014",
            "recommended": true,
            "text": "I have been using this for about a year now and could not ask for a better tool to cut in tight spaces and works wonders for doing delicate brick work, I'm not a professional but I love doing things myself and have found that this tool makes my off the wall projects a whole lot easier. Thanks Rockwell...",
            "author": "RebelG",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"works as advertised\"",
            "rating": 5,
            "date": "01/07/2016",
            "recommended": true,
            "text": "I am a woodworker and have built furniture and homes as well. I have a couple of 7 1/2 saws a table saw and jig saws. I bought this because I liked the dust pick up feature. The first time I used it I cut through a dense 2X4 with no problems and NO DUST !!!. Use it as intended and it will serve you well.",
            "author": "CRAFTY",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great one handed saw\"",
            "rating": 5,
            "date": "03/31/2016",
            "recommended": true,
            "text": "I bought this saw a little over a month ago, and have left my larger circular saw in my tool box. The ease of using this saw with one hand, making my cuts with my carpenter square is a breeze, use it for cutting my 2x4 to 2x12, take my time for a straight clean cut, goes through 1x4 and up with no issue.",
            "author": "Big J",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Outstanding Products\"",
            "rating": 5,
            "date": "10/05/2015",
            "recommended": true,
            "text": "This is the third rockwell product I have purchased over the last two years. They all have be unreal but the last purchase was this hand held saw. This thing cuts like butter through wood and more. I wish I had this last year when we had a big project going on.. Thanks again for your great tools.. Keith",
            "author": "keb64",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Easy to use\"",
            "rating": 5,
            "date": "03/31/2015",
            "recommended": true,
            "text": "I bought mine last December and have not used my 7 1/4 saw sense. Even though it has pro. quality it is a safer saw to use for new users. In my area the saw is only sold in one store that I have found and only at holiday time. I will buy a spare next time I find one to be sure I will always have one.",
            "author": "Glenn",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/18/2016",
            "recommended": true,
            "text": "I purchased this saw a couple of weeks ago due to the fact I was extremely satisfied with the versa-cut saw I purchased over 1.5 years ago. If I had know that the 4.5 inch saw was available I would have bought it then. Both saws are easy to handle and are excellent for the work I do. Thank You!",
            "author": "High roller the second",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Kicks Butt\"",
            "rating": 5,
            "date": "11/20/2017",
            "recommended": true,
            "text": "A friend of mine raved about this saw and loaned it to me for some remodel work. This thing cut through 2x4 as if they were match sticks. It's light, easy to maneuver, and I may never use my full size circular saw again. Needless to say, I ordered my own saw after returning the one I borrowed. [This review was collected as part of a promotion.]",
            "author": "Samtheman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"big power in compact saw\"",
            "rating": 5,
            "date": "12/13/2017",
            "recommended": true,
            "text": "I am very happy with this purchase. small enough to carry around no problem and power of a big saw. I use my in tight places where you could not put a bigger saw, and the adjustment, very easy to set. comes with a nice little guide. I am very happy with this saw I guarantee you will be too.",
            "author": "pumpkinworm",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent service!\"",
            "rating": 5,
            "date": "07/22/2015",
            "recommended": true,
            "text": "I've always respected Rockwell tools, and my new purchase is all I hoped for. Great tool, very practical. Your customer service was excellent, order arrived promptly and in fine condition. You could have used a smaller shipping box. It was three times the size of the tool package enclosed.",
            "author": "Cricket",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great cuts but not for lefthanders\"",
            "rating": 4,
            "date": "05/09/2016",
            "recommended": true,
            "text": "I have used several times now on small repairs, cuts straight and clean. 2x6 wasn't a problem. Opened a porch floor without an issue. The negatives for me was the safety button on the left wasn't easy to reach and the other was being a lefty it was a little harder than a full size to use.",
            "author": "retiredcop",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Compact Versatile Saw\"",
            "rating": 5,
            "date": "12/16/2017",
            "recommended": true,
            "text": "Recently purchased this tool for a project in the attic.  There's not much room in the attic and I was tired of lugging around a heavy 7 1/4 inch saw.  This lightweight gem was just what I needed.  The laser guide works well, has plenty of power and the kit came with five extra blades. [This review was collected as part of a promotion.]",
            "author": "HT460",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great saw!\"",
            "rating": 5,
            "date": "09/05/2015",
            "recommended": true,
            "text": "Had considered panel saw for wood shop to cut 3/4 playwood panels. Full sheet were killing me getting them up to the table saw to cut. Now I just flip panel up on saw horses and use edge guide. Now I can cut pretty darn straight panels without wrestling them up on the table. Love it!",
            "author": "ewhworth",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Money WELL spent!\"",
            "rating": 4,
            "date": "12/19/2017",
            "recommended": true,
            "text": "Immediately put the saw to several tests. It is a serious performer. The heft and comfort of fit in the hand make this saw a dandy little machine with good power to boot. The only reason I dock it a star is the safety start button is slightly awkward for me. Very satisfied overall. [This review was collected as part of a promotion.]",
            "author": "Gary S",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great power tools\"",
            "rating": 4,
            "date": "04/09/2017",
            "recommended": true,
            "text": "This products are all great, easy to use and very portable, the price is reasonable but there is only one thing I don't like is the delivery. You have to wait for a long time to received, it seems the items came from China that it needs a lot of time to arrived in the destination.",
            "author": "bmpjr",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Tough enough and easy to control\"",
            "rating": 5,
            "date": "12/27/2017",
            "recommended": true,
            "text": "I purchased this saw for a job thinking it would do the job I needed and then I could give it to one of my techs to use.  Once I used it, I decided to keep it for myself.  Very easy to use and plenty of power.  Much faster then using my cordless skill saw.  Love.  I recommend it! [This review was collected as part of a promotion.]",
            "author": "pb11501",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/19/2016",
            "recommended": true,
            "text": "Bought 2 weeks ago for remodeling at cabin. Fit and finish of saw is high quality like all the other Rockwell tools. Plenty of power to get the job done. I really appreciate the 10ft high quality power cord. I will give first consideration to Rockwell for my next tool purchase.",
            "author": "ToolMonger",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Bigger fingers than mine to operate safety\"",
            "rating": 3,
            "date": "10/31/2016",
            "recommended": true,
            "text": "The safety and trigger are a pain to press all at one time (I guess I must have small hands) Normally this problem is no big deal but when you are using to cut something like in an odd angle in a difficult position (which we never do in construction) the saw is hard to use.",
            "author": "mrvideo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good tool\"",
            "rating": 4,
            "date": "02/06/2015",
            "recommended": true,
            "text": "I bought this product in 2014 and have used it several times within a few months. Wish it was a little smaller for my medium size hands. Wish the blades were readily available. The tools works great, I am glad I bought it and would/have recommended this tools to friends.",
            "author": "hardontools",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nothing great about this saw\"",
            "rating": 1,
            "date": "01/04/2017",
            "recommended": false,
            "text": "I find that this is the worse saw l have ever used. The design is is  awful. The button you have to hold to run the saw is so far down on the saw you need a six inch thumb, had to press it with one hand and press the trlgger with the other. Fix it so it is aways down.",
            "author": "Jer h",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"very nice!\"",
            "rating": 5,
            "date": "11/06/2015",
            "recommended": true,
            "text": "I just bought this a couple of weeks ago and it is really nice. I thought that I would have trouble using it because I have some arthritis in my hands but I didn't have any problems with holding it. It made my project easy. I am very happy with my new saw Thank you",
            "author": "thormbt49",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Mr. Anthony Thompson\"",
            "rating": 5,
            "date": "02/08/2016",
            "recommended": true,
            "text": "This is my third tool from Rockwell, now this one is another tool I desperately needed to cut out my stair stringers and etc, many uses. I loved the blades included to help me in my different projects. Another great tool added to my collection. Thank you Rockwell!",
            "author": "Antant72",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Small and powerful\"",
            "rating": 5,
            "date": "01/23/2016",
            "recommended": true,
            "text": "Great little tool much easier to use than my craftsman worm and gear 15 pound saw and it can do almost every thing that the craftsman can do.Only problem I had was holding the release button to start the saw when I was using it with my left handLove the tool..",
            "author": "Sammy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Safety switch\"",
            "rating": 4,
            "date": "10/03/2016",
            "recommended": true,
            "text": "Got this yesterday and had floor molding to cut.  Overall not too bad but the issue of having to push in the safety button in its location and then the trigger was not the easiest to do.  Really have to watch where you put your fingers if you want to keep them.",
            "author": "hawk486",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Wimpy! Wimpy! Wimpy!\"",
            "rating": 2,
            "date": "06/30/2015",
            "recommended": false,
            "text": "I have an 18v Ryobi circular saw. I bought this Rockwell circular saw for jobs that needed a little more muscle. Ha! The 18v Ryobi can out cut this saw with power to spare. This Rockwell is ok to cut plywood but not ideal for 2 by material. Not worth the money.",
            "author": "toolsrrr",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great comfort in the hand\"",
            "rating": 5,
            "date": "12/09/2014",
            "recommended": true,
            "text": "I just bought one of these, It took me over 20 minutes to cut my rafter ends with a regular circular saw on a ladder. I did the whole other side with this 41/2 saw in less than 10 minutes on the same ladder. it never slowed down or bounded like the 71/4 did.",
            "author": "flywheel",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"just right\"",
            "rating": 5,
            "date": "09/13/2014",
            "recommended": true,
            "text": "I've had this saw for about 6 months now and have used it more than I expected I would. It's got all the features of the big boys, but in a much smaller package. I have a Handyman business and this is just right for 95% of the jobs requiring a circular saw.",
            "author": "madman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Little Saw That Fits Where Big Boy Can't Go\"",
            "rating": 5,
            "date": "01/09/2016",
            "recommended": true,
            "text": "I was skeptical at first; but after a few uses out in the open, I found myself under a kitchen sink need to cut 2 small holes in the back wall. So I grabbed my \"Little\" friend and zip zip 2 squares cut and just about as quick as typing this review.",
            "author": "jcy3",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love this saw!\"",
            "rating": 5,
            "date": "06/28/2019",
            "recommended": true,
            "text": "I was building a garage and covering it with OSB sheets and having a hard time by myself so I went to Lowes and bought this saw and solved my problem. It will let you cut straighter so that the joints meet flush. I highly recommend this product.",
            "author": "Jim",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"good little saw that is very powerful\"",
            "rating": 5,
            "date": "10/14/2014",
            "recommended": true,
            "text": "ok I bought this in in may when it first came out I hated the heavy weight of the big circular saw and used this to build 2 decks and then you need a new blade of pressure treated wood wish they had more blades and a bag to put this nice saw into",
            "author": "mike_smith2277",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love this handy little tool.\"",
            "rating": 5,
            "date": "01/04/2017",
            "recommended": true,
            "text": "BEING FEMALE, i like lightweight tools but still do what i need it to do. I am NOT comfortable running a skil saw or hand saw..and they are heavy. But this little thing does the trick. used it cutting plexyglass and it was a smooth cut. Love it.",
            "author": "Debbie D",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "08/15/2017",
            "recommended": true,
            "text": "I purchased the saw to cut back the siding along new corner boards because it was light and compact. Now I am always reaching for this saw to make any quick cuts. It is a must have tool. Once you get it, you will wonder how you lived without it. [This review was collected as part of a promotion.]",
            "author": "Ralph A",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Confidence with Rockwell\"",
            "rating": 5,
            "date": "01/30/2017",
            "recommended": true,
            "text": "Bought the 4.5 saw after forgetting to bring my versacut home from the cottage. Very impressed with the power, convenience, portability and versatility of these saws.\nStarted buying more Rockwell tools because of my confidence in the products.",
            "author": "RickH",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very handy\"",
            "rating": 4,
            "date": "01/26/2019",
            "recommended": true,
            "text": "I purchased this saw to cut some plastic flooring for my garage. It is extremely easy to use and it makes great cuts. Since then I've also used it to cut up a couple of wooden pallets. It's compact size makes it easy to use, clean, and store.",
            "author": "Jake",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "12/22/2016",
            "recommended": true,
            "text": "I bought this for my husband for Christmas and he says he loves it and it will help him do little jobs that he use to take to the home building supply store to cut for him thanks I love the product cause it saves me money on his projects now",
            "author": "leahanne56",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"41/2 circular saw\"",
            "rating": 5,
            "date": "11/04/2014",
            "recommended": true,
            "text": "I bought this for some small projects, to my surprise there is not a whole lot this saw can't do. It's well made and easy to handle in confined areas, I bought Rockwell because of their12v products that I own, and free battery replacement.",
            "author": "Ron hillbilly",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Lightweight in using\"",
            "rating": 5,
            "date": "02/15/2016",
            "recommended": true,
            "text": "When I bought this compact saw I figured using it for light work but since have used it on cement pavers (with special blade for the purpose) and was extremely satisfied with its use. Also the light weight made it a pleasure to use.",
            "author": "Skee",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"lOVE THIS SAW\"",
            "rating": 5,
            "date": "08/30/2015",
            "recommended": true,
            "text": "Got this saw as a present. I have a versacut, but like this saw much better. Easier to handle and don't have to plunge down to get to cut. Its great for cutting plastic laminate to sizes needed and also great at cutting wood pieces.",
            "author": "bill rockwell fan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Back to big saw\"",
            "rating": 2,
            "date": "12/31/2016",
            "recommended": false,
            "text": "I tried the wood blade on 2x4 and light materials, It was hard to keep it straight and not bind. Then I tried a metal blade on metal roofing. Was not happy with either blade. So, I will try to use it but always keep a big saw handy.",
            "author": "Rickb",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"So lightweight compared to the bigger saws!\"",
            "rating": 5,
            "date": "11/13/2017",
            "recommended": true,
            "text": "I do many projects around our farm and for folks in the community. I bought this because I'm getting older and want something that is lighter and more compact.  I've already used it several times and am so glad I finally bought it!",
            "author": "Farmer Jan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Handy saw!\"",
            "rating": 5,
            "date": "07/04/2015",
            "recommended": true,
            "text": "My wife bought this for me for Father's Day, after hearing me complain about how heavy & awkward my regular circular say is for small areas. This saw still has enough power to do the job with much less hassle. Use it constantly.",
            "author": "Bobs Knot Wood Art",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"4 1/2\" compact circular saw.\"",
            "rating": 4,
            "date": "01/14/2016",
            "recommended": true,
            "text": "I recived this saw as a christmas gift.The safty button could be in better location because with gloves on or if you have small hands, it can be dificult to activate. other than that it is a great little saw at a great price.",
            "author": "bbump",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great saw\"",
            "rating": 5,
            "date": "07/05/2019",
            "recommended": true,
            "text": "Handy saw that fits in spaces where a big one won't!",
            "author": "batcat555",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Handy Hand Saw\"",
            "rating": 5,
            "date": "03/04/2016",
            "recommended": true,
            "text": "This saw makes really great cuts its powerful and easy for my hands. You can get other blades for different cuts making it very versatile. Blades are easy to change out plus you get free warranty of three year which is great.",
            "author": "Tia2",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rips 2 x 4 with ease\"",
            "rating": 5,
            "date": "12/12/2014",
            "recommended": true,
            "text": "Built a dog house over the weekend, and really enjoyed using the Rockwell Compact circular saw, the lightweight and handling made the project go smoothly. My shoulder really appreciated the light weight and ease of handling.",
            "author": "DogHouse",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works great\"",
            "rating": 4,
            "date": "12/28/2015",
            "recommended": true,
            "text": "Bought this as a Christmas gift. Used today to cut 2x8 boards. No bogging down. Very handy. Only rated 4's since I almost NEVER rate the highest, almost has to do the job when I just think about it to get the highest rating.",
            "author": "hobbyist",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great compact saw\"",
            "rating": 4,
            "date": "08/25/2018",
            "recommended": false,
            "text": "Bought this for my husband.  He really loves it but, he broke the Outer and Inner Lange Lock Bolt????? And you can't find any place to get a new one.  So, what good is the saw if you can't find the replacement part for it.",
            "author": "Robin57",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great tool !!!\"",
            "rating": 5,
            "date": "08/28/2015",
            "recommended": true,
            "text": "Excellent tool for making quick cuts and cuts thru 2\" x 4\" s like butter. Light weight, quality build, and you can get in tight spaces. A friend of mine borrowed it to cut vent holes in soffit now he going to buy one !!!",
            "author": "Gordo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A Handy Compact Saw\"",
            "rating": 5,
            "date": "12/26/2017",
            "recommended": true,
            "text": "This saw is easy to use, light weight, and has plenty of power. Cutting thru 2x4's is a snap. The only negative is that it can't cut a 45 degree angle thru a 2x4. Other than that it's a great little saw, for the price.",
            "author": "Kens Cuts",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"This is almost exactly what I have been searching\"",
            "rating": 3,
            "date": "06/25/2018",
            "recommended": true,
            "text": "I was looking for a circular saw that is light weight to be held with one hand for cutting long straight line. The only disappointment is that I have smaller hands that I can not press down both buttons with one hand.",
            "author": "beachreno",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great quality!!!\"",
            "rating": 5,
            "date": "01/01/2018",
            "recommended": true,
            "text": "I started with the purchase of Rockwells Sonicrafter and was so inpressed, as with great results I purchased several other products Rockwell produces over time and will purchase more. Their quality is second to none!! [This review was collected as part of a promotion.]",
            "author": "Retep",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Dose a great job\"",
            "rating": 4,
            "date": "04/22/2015",
            "recommended": true,
            "text": "I have been using this on my remodeling project (a large project) and it has not let me down. The only thing that could make it better is it was a little easier to operate the safety button for a left handed person.",
            "author": "Don 745",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Saw was more than I expected\"",
            "rating": 5,
            "date": "01/08/2017",
            "recommended": true,
            "text": "Arrived just a few days after I ordered on line as we don't have a Lowe's in our city.\nI used to make a quick cut with my jigsaw instead of setting up my portable tablesaw.\nNow I can use this small circular saw.",
            "author": "snowbuzzard",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great saw\"",
            "rating": 5,
            "date": "01/17/2016",
            "recommended": true,
            "text": "This saw handles nicely, easy to carry. Has a lot of great features. The only drawback is the placement of the switch lock. It is hard to reach the lock and the switch at the same time. Other than that, I love it",
            "author": "Phil1941",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rockwell circular saw - handy!\"",
            "rating": 5,
            "date": "07/02/2019",
            "recommended": true,
            "text": "works well, easy to handle,   just what I needed for weekend work at home.tired of the battery circular saw short work life.can store it anywhere.overall a good purchase at a good price.",
            "author": "TONY-B",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Needs improvment\"",
            "rating": 3,
            "date": "03/05/2019",
            "recommended": true,
            "text": "The saw cuts, BUT it needs a lockout for RIGHT and LEFT handed people, not just Right. Also it need a guide handle to have control better, seems a bit on the unsafe side. It does cut and has plenty of power.",
            "author": "pocold",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"What a joke\"",
            "rating": 1,
            "date": "08/17/2015",
            "recommended": false,
            "text": "This product can't cut a straight line to save its life poor craftsman ship very tough but the point is to make precision cuts not veering of course I'm going to get my money back or a better built product",
            "author": "Slick",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Perfect for light jobs\"",
            "rating": 5,
            "date": "04/04/2016",
            "recommended": true,
            "text": "Been using this to rip and cut 2x4 and plywood boards and aluminum sheets. Works perfectly with carbide blades.. Easy to maneuver. Built a jig using mdf and now I can cut really fast most plywood boards.",
            "author": "rkh1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/22/2016",
            "recommended": true,
            "text": "cuts very well without any power draw down. blade size needs to be a bit wider . also the grip could be modified to fit smsller hand to coordinate holdinng the saw and turning it into its running mode.",
            "author": "hawkshaw",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerful- versatile 4.5 in Rockwell saw\"",
            "rating": 4,
            "date": "06/27/2019",
            "recommended": true,
            "text": "Best trait is you can see the blade cut without looking over the right side like most power saws. Plenty power for all 2x4 material. Only negative is a finer finishing blade is not available at Lowe's",
            "author": "Ted",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Happy to have one\"",
            "rating": 5,
            "date": "06/03/2015",
            "recommended": true,
            "text": "I bought this 2 wks ago and used it this weekend. I was so impressed how clean was the cut compared to my regular circular saw. I loved it and lighter to use. Looking forward to recommend to a friend.",
            "author": "Guyd",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great big little saw\"",
            "rating": 5,
            "date": "12/30/2016",
            "recommended": true,
            "text": "I just love this saw. Ì work with small wood projects and this saw is perfect for my needs.having that blade on the left side is the best thing since sliced bread. I'm going to get one for my brother.",
            "author": "Menuman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"light, but mighty!\"",
            "rating": 5,
            "date": "03/21/2015",
            "recommended": true,
            "text": "I bought this after my father showed me how well his worked. Instead of digging out a heavy worm drive to rip plywood, I now grab this little lightweight Rockwell, and it zips through it in no time.",
            "author": "TOldSarge",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love the features...........awesome deal!\"",
            "rating": 5,
            "date": "12/07/2016",
            "recommended": true,
            "text": "I bought this couple of weeks ago and absolutely love the saw. It is totally appropriate for DIY and the beveling capability is simply an added bonus. The only thing I miss in this is a laser guide.",
            "author": "Alok",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Can't change the blade\"",
            "rating": 4,
            "date": "03/19/2017",
            "recommended": false,
            "text": "I have one of the original saws, don't have a need for it to much of course when I needed it, I can't change the blade striped the hex head. Rockwell must have a recall on this issue. Please email.",
            "author": "HARRIS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works great\"",
            "rating": 5,
            "date": "11/20/2015",
            "recommended": true,
            "text": "Really enjoy using this saw. Cut visibility is excellent. Only problem is I would like to see more blade types. A fine cut blade would be great,or at least an adapter so we could use other blades.",
            "author": "slinger",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rockwell RK3441 is a great tool for DIY'ers\"",
            "rating": 5,
            "date": "11/05/2014",
            "recommended": true,
            "text": "I bought mine to construct a closet office. I was cutting 3/4\" birch plywood. cut's without too much splintering on the plywood. awesome saw!!! compact for doing construction on small tight places",
            "author": "VictorDIYnewbie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works for me\"",
            "rating": 5,
            "date": "12/24/2016",
            "recommended": true,
            "text": "Used the saw to make wedges from 2x2 lumber. Smaller size was easier to control without sacrificing power. Husband used it on plywood today without complaint. Sale price made it a great purchase.",
            "author": "nmhh",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rockwell Compact Circular Saw\"",
            "rating": 5,
            "date": "03/11/2015",
            "recommended": true,
            "text": "Very happy with the power of the saw and ease of use with one hand. It is very easy to cut thru 3/4in plywood on the project i just did. i would recommend it to a friend and the price is right!",
            "author": "Wayne",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very powerful\"",
            "rating": 5,
            "date": "09/15/2015",
            "recommended": true,
            "text": "This is a very powerful circular saw. I chose it over the VersaCut because of the blade size. I was surprised by how well made the tool was and how good it felt right out of the box. But most surprising was the power. The tool is made so well that it doesn't track at all. It cuts straight ahead and only as you push it. No grabbing, no yaw. Weaker saws will do that, flex at the axle and cause a yaw that draws your cut off. This saw cuts wood like butter. It flies forward as fast as you push it and leaves very clean, almost polished cuts. I was really impressed.Noise isn't bad and even less than other circular saws. The balance of the tool is very nice and feels natural in the hand. Blade change is easy and raising the guard to start certain cuts is easy and feels safe. The saw also offers a good two handed grip - how I recommend it be used though it runs one-handed well.The only con as I see it is the safety. It is a hassle and got in my way most times but, I would rather have a safety and have to deal with the extra step rather than lose a finger or fingers. I highly recommend this saw.",
            "author": "grommet",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great saw\"",
            "rating": 5,
            "date": "09/04/2015",
            "recommended": true,
            "text": "Love the convenience of this compact saw. Plenty of power. I would tell Rockwell to throw in a carry bag for it like they do with the Versa-Cut. I have them both. Great products top to bottom.",
            "author": "Sag1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great\"",
            "rating": 5,
            "date": "12/29/2015",
            "recommended": true,
            "text": "I have used many tools in my 40+ years and this one is at the top of my list. This is my go-to tool for most all of my saw needs. perfect size has no problem with any cuts on 2x4 and smaller.",
            "author": "Big Toms Shop",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best small saw\"",
            "rating": 3,
            "date": "01/15/2016",
            "recommended": true,
            "text": "It curtainly does not replace a regular skill saw but has a good feature to allow for vacuum hookup which keeps work area clean but still has limited tork and horse power like all small saws.",
            "author": "Gborer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"works good, lots of power, hard to find blades\"",
            "rating": 3,
            "date": "04/20/2016",
            "recommended": true,
            "text": "It is very hard to operate with one hand because the safety button is poorly located. Blades are almost impossible to find with the small mounting hole. It has plenty of power and works good.",
            "author": "hunter",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"not good\"",
            "rating": 1,
            "date": "12/21/2014",
            "recommended": false,
            "text": "i bought this tool last month and tried it on several projects and it does not cut 2x4 s easy and other wood was ruined do to the thin blade bending,it also has a poor design and hard to use",
            "author": "woody",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice little saw that does a BIG job!\"",
            "rating": 4,
            "date": "12/28/2017",
            "recommended": true,
            "text": "Bought this for a Christmas present for myself and had to open it early to do a job. Works great but is a little hard to operate being left handed, but as with all tools I muddle through.",
            "author": "Tim48",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"The Best Saw  Ever\"",
            "rating": 5,
            "date": "03/28/2017",
            "recommended": true,
            "text": "I purchase 4-1/2\" Compact Circular Saw, and to me its the best investment ever light weight...\n                                                                               Thank You! [This review was collected as part of a promotion.]",
            "author": "jljimbo1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Blade Keeps Jamming\"",
            "rating": 1,
            "date": "06/25/2015",
            "recommended": false,
            "text": "I have owned the saw for a week and the screw attaching the blade to the shaft keeps loosening making the saw blade jam. I will not keep the saw if this difficulty is not rectified.",
            "author": "Richard E",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/09/2015",
            "recommended": true,
            "text": "Bought this a couple of weeks ago to build a kayak rack. I used it to cut 2x4s and 4x4s. Worked great, lightweight and easy to use. I also trimmed off the bottom of interior doors.",
            "author": "Capnron",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Lightweight but sturdy!\"",
            "rating": 5,
            "date": "03/18/2017",
            "recommended": true,
            "text": "I have a bad shoulder so I am unable to lift hwavy equipment...this is light enough that it doesnt bother me, AND it is sturdy enough to give the 'big brand' a run for its money!!!",
            "author": "MizRizz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Better than the skimpy Dremel saw!\"",
            "rating": 5,
            "date": "03/08/2018",
            "recommended": true,
            "text": "Got this guy for christmas a few years ago. It's my go-to saw for most projects now... Haven't yet tried to get a metal blade and some sheet cut, but I have no doubt it'd do it...",
            "author": "CeeKay",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/29/2019",
            "recommended": true,
            "text": "Excellent small circular saw . Cut through one inch red Oak Treads with plenty of power. No problem with holding down the safety button and start switch as other reviewers stated.",
            "author": "Harp",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great tool\"",
            "rating": 5,
            "date": "08/27/2015",
            "recommended": true,
            "text": "Great tool! For most of my projects I am not cutting anything bigger than a 2x4 anyway. Can get into a lot of places, nice and light, easy to handle. I would spend the money again",
            "author": "PrSc",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "05/20/2015",
            "recommended": true,
            "text": "I got the saw this month and was cutting some 1/2 plywood and 2x4s with it the saw works great.only the parallel guide coud be a little more sturdier. I would buy the saw again.",
            "author": "handyman 110",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice upgrade for my saw collection\"",
            "rating": 5,
            "date": "03/15/2018",
            "recommended": true,
            "text": "Have the Versacut which has been great for many jobs, but not made for larger materials like 2x4.  This saw takes care of that, and still gives great portability and usability.",
            "author": "MacD",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"no job 2 big\"",
            "rating": 5,
            "date": "01/01/2018",
            "recommended": true,
            "text": "I bought for the dismantle of old staircase. She ripped through it no problems then decided to use to build new staircase. Lightweight powerful just kept wanting more. Awesome [This review was collected as part of a promotion.]",
            "author": "moteman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good choice for senior citizens\"",
            "rating": 4,
            "date": "04/05/2015",
            "recommended": true,
            "text": "The reduced weight for a well made saw was the reason I purchased this toolFor this 80 year old DIY person, this feature made this circular saw desirablefor home projects",
            "author": "Jolly Green Giant",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Happy I purchased this.\"",
            "rating": 5,
            "date": "12/12/2017",
            "recommended": true,
            "text": "I am a female with little to no skills with tools. The more I use it the more I like it.  Handy for small cuts. Buying my husband one for Christmas. So he'll have one too. [This review was collected as part of a promotion.]",
            "author": "Mayflyupcycledcreations",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Luck\"",
            "rating": 1,
            "date": "12/19/2016",
            "recommended": false,
            "text": "Good Luck finding anyone who can ship you a tool that meets the specs they give.  They list the cord length as ten feet.  The cord length of both tools shipped is 8 feet.",
            "author": "RHShel",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Exactly what I needed!\"",
            "rating": 5,
            "date": "03/24/2016",
            "recommended": true,
            "text": "I bought this for a project putting in a newel post and new railing and it was a dream to use. It is very light weight but powerful enough to get the job done easily.",
            "author": "Sharon47",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love it!!!!\"",
            "rating": 4,
            "date": "07/23/2017",
            "recommended": true,
            "text": "I love my 4 1/2\" Rockwell !!  No problem finding blades.  I use it 3x more than my 7 1/4\"  i just wish Rockwell made a nice hard case or bag to take it on the job in.",
            "author": "Prairiefire",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Bought one DOA sent another works ok\"",
            "rating": 2,
            "date": "11/24/2014",
            "recommended": true,
            "text": "Uses 3/8\" arbor blades only no adapter to use 5/8 saw blades. Blades wear out fast especially when cutting old lumber. My house is 1860 circa lots of old lumber here",
            "author": "pjb2005",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Adjustable fence needs better hold down screw\"",
            "rating": 1,
            "date": "03/12/2018",
            "recommended": true,
            "text": "The saw works very well.  My only suggestion is to provide a fence hold down screw that can be used without a tool.  I changed mine with a thumb screw and it works.",
            "author": "Feather",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great hand-held saw\"",
            "rating": 5,
            "date": "12/28/2017",
            "recommended": true,
            "text": "Bought two of these for Christmas gifts.  While they haven't been used yet - they were \"very enthusiastically\" received.  I know that they will get plenty of use!",
            "author": "DAD06770",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerfull and durable\"",
            "rating": 5,
            "date": "01/10/2018",
            "recommended": false,
            "text": "I just bought this and it paid for itself on the first use. much easier to handle then a regular Skill Saw. this is a tool to have in shop on the go or nome use.",
            "author": "Madmike007",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"As easy to use as i hoped it would be.\"",
            "rating": 5,
            "date": "03/31/2015",
            "recommended": true,
            "text": "I'm glad i purchased this saw >I have a couple of projects tor summer and it will make it a lot easier to do. As soon as we get rid of this snow. what a winter.",
            "author": "jerry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "10/24/2014",
            "recommended": true,
            "text": "I bought it one moth ago ,I am happy with it so far . this saw good for quick few cuts on the side job. But this saw has been make wire less will be more useful",
            "author": "VyVy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"easy to use\"",
            "rating": 5,
            "date": "03/07/2018",
            "recommended": true,
            "text": "bought my compact circular saw a year ago. I'm not real handy with carpentry which is why I bought it. it is lighter and easier to use than a full size circular",
            "author": "chop62",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"EASY, EASY, EASY.\"",
            "rating": 5,
            "date": "12/02/2017",
            "recommended": true,
            "text": "I AM LOVING THIS LITTLE SAW. IT'S POWERFUL, BUT NOT AS HARD TO USE AS SOME OTHER SAWS. THE GRIP IS PERFECT FOR MY SMALL HANDS WHICH MAKES IT EASY TO CONTROL.",
            "author": "NANNY",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great tool\"",
            "rating": 5,
            "date": "01/05/2019",
            "recommended": true,
            "text": "Very handy tool. Instead of using a bulky ful size saw for tight spots and shallow depth cuts. I've cut thin plywood and 2 inch thick boards with no problem.",
            "author": "Cld1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great saw\"",
            "rating": 5,
            "date": "03/07/2017",
            "recommended": true,
            "text": "Needed a small powersaw that could be packed in a suitcase plenty of power and capable of cutting a 2by  edge guide also included adjusts to almost 4\" wide.",
            "author": "Glazzzmann",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "03/18/2017",
            "recommended": true,
            "text": "Only used once but like it the vacuum adapter would be better if was longer so as to put vacuum hose further away from unit thus keeping hose away from job [This review was collected as part of a promotion.]",
            "author": "Mate",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"small and powerful\"",
            "rating": 4,
            "date": "12/15/2015",
            "recommended": true,
            "text": "The tool/saw is very light and easy to handle, next is to make the saw cordless?Also the arbor at 3/8, so one can not find the blades at the home center.",
            "author": "Jess D",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very Handy\"",
            "rating": 4,
            "date": "11/28/2015",
            "recommended": true,
            "text": "I purchased this saw to use in my garage so I would not have to go to the basement to my woodworking shop to get a big saw, works great for the purpose.",
            "author": "DonP",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Quick and light weight\"",
            "rating": 5,
            "date": "03/14/2017",
            "recommended": true,
            "text": "At first I did not like it because the grip felt awkward. No I love it. Handy for almost any job. And it has the ooomph that most cordless saws lack.",
            "author": "Josh",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"LOVE THIS SAW!!!\"",
            "rating": 5,
            "date": "03/02/2016",
            "recommended": true,
            "text": "I love the having a quick and easy circular saw to use. It is very light weight and versital. I use it all the time and hardly ever need my big saw.",
            "author": "themechanicbob56",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"the best easy for my hands\"",
            "rating": 5,
            "date": "12/18/2015",
            "recommended": true,
            "text": "just got it i would trade all my tools if i knew how good this was. also have other saw too works just as good. next im going to get the saw horse",
            "author": "gruff",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome Tool!!! Good for around the house stuff!\"",
            "rating": 5,
            "date": "12/20/2017",
            "recommended": true,
            "text": "Great tool and a Great Price!!! It is great for around the house DIY stuff! Great doing business with ya and will continue to do business as well. [This review was collected as part of a promotion.]",
            "author": "Swordy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great saw\"",
            "rating": 5,
            "date": "06/02/2015",
            "recommended": true,
            "text": "I have a 71/2 \" worm drive saw, haven't used it since I purchased My Rockwell and probably will never use it again! It will just stay in the box.",
            "author": "Opa6",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"compact circular saw\"",
            "rating": 5,
            "date": "12/15/2017",
            "recommended": true,
            "text": "I had a project that was hard to get to and also needed a precision cut. WOW this little saw did the trick.It is not too heavy and very precise,",
            "author": "James W",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellant Saw for the quick cut.\"",
            "rating": 5,
            "date": "03/02/2017",
            "recommended": true,
            "text": "I feel like I could carry this saw in my back pocket. a really handy tool to own. I end up using this saw when I should use my 7-3/4 Milwaukee.",
            "author": "RonA",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"easy to handle ....quick cuts\"",
            "rating": 4,
            "date": "08/07/2015",
            "recommended": true,
            "text": "i am a flooring guy...i use this for my 1/4 sub floor....nice to set depth so as not to damage flooring under my cuts....and works like a charm",
            "author": "TJKFloors",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Right tool for small job\"",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "Is a right for small repairs in home where the regular saw is too big for fit, the lock button is a little far from switch but no affect much.",
            "author": "Houseman",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Plenty of power. Cuts fast\"",
            "rating": 4,
            "date": "12/15/2016",
            "recommended": true,
            "text": "Bought one for myself and my son. I have small hands and could not reach the trigger and safety button with one hand. Otherwise a great tool.",
            "author": "Bee Man",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Saw\"",
            "rating": 5,
            "date": "10/25/2017",
            "recommended": true,
            "text": "I purchase my Compact Saw about 2 months ago. The saw is amazing and it works wonders. Very easy to maintain. Perfect cuts. I high recommend. [This review was collected as part of a promotion.]",
            "author": "Tierra",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Big Power in a Small Saw\"",
            "rating": 5,
            "date": "11/20/2015",
            "recommended": true,
            "text": "I have had this saw for a couple of weeks now and have had the pleasure of its use for cutting both wood and plastic. The power is amazing, even cutting 2x4's. The saw kerf is narrow so the saw cuts with very little effort. I just finished a project involving 1\" thick HDPE and the vacuum attachment really came in handy. Attached to my shop vac, the saw made almost no mess at all when cutting the 1\" polyethylene. The cuts were so smooth that no sanding was required. The saw is easy to handle and has already become my portable circular saw of choice for most projects. When considering this saw, I also thought about the smaller Versacut saw but opted for the compact circular saw instead because of the increased depth capacity. It would be nice if Rockwell included a carrying case for the saw, rip guide, and extra blades like they did for the Versacut. I bought a military tool bag (19\"x9\"x6\") with zipper closure that works well, however. In summary, the Rockwell Compact Circular Saw is a well made tool that can stand up to a lot of use even when cutting material approaching its maximum depth. You can't go wrong with the quality of Rockwell Tools!",
            "author": "BluesmanD",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great tool\"",
            "rating": 5,
            "date": "02/13/2016",
            "recommended": true,
            "text": "I bought this awhile ago and it is more powerful than I imagined . I cut threw wood and fire brick with ease. I fully recommend this tool .",
            "author": "GTMAN",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Little Tool\"",
            "rating": 5,
            "date": "06/07/2019",
            "recommended": true,
            "text": "I love this.  It's perfect for small jobs, light, easy to handle for small hands.  The blade depth is adjustable...  Very nice all around.",
            "author": "Jericho",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great special purpose saw.\"",
            "rating": 4,
            "date": "07/23/2017",
            "recommended": true,
            "text": "This saw will not take the place of your big framing saw, but it is perfect for the special cuts on finish work when craftsmanship counts.",
            "author": "Boss man",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/15/2017",
            "recommended": true,
            "text": "I bought this saw eight months ago  and it makes it better to saw in tight places like sawing a barrel in half this is a great saw. thanks [This review was collected as part of a promotion.]",
            "author": "bunky",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Terrific.\"",
            "rating": 5,
            "date": "12/13/2016",
            "recommended": true,
            "text": "I have and older model and I love it. Goes through 3/4 birch plywood like a mouse going through a hole in Swiss cheese. Great little saw.",
            "author": "Happy 68",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact and Powerfull\"",
            "rating": 5,
            "date": "07/29/2015",
            "recommended": true,
            "text": "Bought this to repair RV roof.Worked great.Safety button is a bit awkward if your hand is small.Have 40 plus years using Rockwell Tools.",
            "author": "Sparky 2015",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Circular saw\"",
            "rating": 5,
            "date": "11/09/2017",
            "recommended": null,
            "text": "Bought four of these for my kids they love them. Now my grandkids want some too. Ruggedly built easier to use than a large circular saw. [This review was collected as part of a promotion.]",
            "author": "Chesty",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"fantastic\"",
            "rating": 5,
            "date": "10/10/2014",
            "recommended": true,
            "text": "I b I ugh this for my dad for his birthday and he loves it I can't wait til he comes to Arizona to use it on my house lots of daddy work",
            "author": "donahink",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/21/2015",
            "recommended": true,
            "text": "This is one of the finest tools i've ever purchased. Very easy to use and accurate. Very nice addition to any novice's tool collection.",
            "author": "Gdawg",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact Circular Saw\"",
            "rating": 5,
            "date": "12/20/2017",
            "recommended": true,
            "text": "I recently bought this and it proved to be useful and functional. It can easily and cleanly cut wood with so much smoothness and ease. [This review was collected as part of a promotion.]",
            "author": "Jasper",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Light Weight\"",
            "rating": 5,
            "date": "12/04/2015",
            "recommended": true,
            "text": "I bought this to use for my roofing repair.It is alot easier to use then the larger circular saw.It has good power and cuts real fast.",
            "author": "Ken H",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good saw easy to use\"",
            "rating": 5,
            "date": "03/01/2016",
            "recommended": null,
            "text": "I bought this saw 2 months ago but with the weather I did not use it for a while. When I did it was user friendly and real easy to use",
            "author": "Papa",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best Performance\"",
            "rating": 5,
            "date": "07/14/2017",
            "recommended": true,
            "text": "This saw is so helpful and easy to use. Great when cutting 2x4 and smaller boards. No kick back as long as you let it do the cutting. [This review was collected as part of a promotion.]",
            "author": "Handy Hank",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"4.5\"\"",
            "rating": 4,
            "date": "01/01/2018",
            "recommended": true,
            "text": "Very happy with this saw.  Powerful enough for most small jobs.  Easy to use.  Cuts smoothly.  For the price, you can not go wrong. [This review was collected as part of a promotion.]",
            "author": "dlawren",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Little Tool\"",
            "rating": 4,
            "date": "06/29/2018",
            "recommended": true,
            "text": "I bought this because I thought it would be handy for smaller jobs.  I've actually used it to cut our hardwood and it works great.",
            "author": "crummer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/18/2015",
            "recommended": true,
            "text": "As a person who depends on good quality tools to get the job done these Rockwell tools simple make it happens. Couldn't be happier",
            "author": "Colin",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"nice little saw\"",
            "rating": 5,
            "date": "01/06/2019",
            "recommended": true,
            "text": "got this saw as a gift, awesome. only thing missing is a dust collection bag. would be a lot easier than hooking up to a shop vac.",
            "author": "cuteasy08",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact Saw\"",
            "rating": 1,
            "date": "05/13/2017",
            "recommended": null,
            "text": "Item arrived with broken screw inside main body.  Replacement has not been received to date.  Unable to review/rate at this time.",
            "author": "Rjor",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Umbeatable prices\"",
            "rating": 5,
            "date": "12/20/2016",
            "recommended": true,
            "text": "Was looking to get the best price for that item. Lowe's was the best by far. Even got it shipped for free. Amazing. Thanks again.",
            "author": "Nelson000",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great power full..\"",
            "rating": 5,
            "date": "07/14/2017",
            "recommended": true,
            "text": "God. I buy a circular saw ..i was used fir fixing the kitchen..i cut a ceramic glass.  Backlash..i get a great jop ..thank you .. [This review was collected as part of a promotion.]",
            "author": "Benny15262",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great tool\"",
            "rating": 5,
            "date": "05/26/2015",
            "recommended": true,
            "text": "This is hands down the best cutting tool I've used...lightweight powerful and versatile ....would recommend this tool to anyone",
            "author": "Paul cecil",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Easy to use, powerful\"",
            "rating": 5,
            "date": "09/06/2015",
            "recommended": true,
            "text": "I purchased over 3 months ago and have used the saw on many projects. A powerful little saw that really cuts through anything.",
            "author": "John O",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Quality!\"",
            "rating": 5,
            "date": "01/18/2017",
            "recommended": true,
            "text": "This compact saw is really a great addition to my tool collection. It has done a great job on any thing I have used it for.",
            "author": "JOHNDC",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Cool saw\"",
            "rating": 5,
            "date": "07/06/2015",
            "recommended": true,
            "text": "I bought this saw because it can cut 2x4s. It has all the power I was expecting and then some. It feels good in your hand.",
            "author": "kreed74",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A well designed and rugged power saw.\"",
            "rating": 5,
            "date": "02/13/2016",
            "recommended": true,
            "text": "I purchased this tool for close quarters horizontal and vertical bevel cuts in OSB. Terrific control, power, and accuracy.",
            "author": "Ivanov",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Really fun to use and lightweight\"",
            "rating": 5,
            "date": "12/24/2017",
            "recommended": true,
            "text": "Once you remember to use some light pressure to release the safety it's easy to use this is not your dad's old heavy saw.",
            "author": "Phil P",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Saw\"",
            "rating": 5,
            "date": "01/19/2016",
            "recommended": true,
            "text": "I am glad that I purchased this saw, easy to handle and it can do most of the projects that I have to do around my home.",
            "author": "Adisco",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great little tool\"",
            "rating": 5,
            "date": "01/19/2017",
            "recommended": true,
            "text": "Bought this a few weeks ago. Used it several times since. Great tool.  Well made, easy to handle, and cuts two by fours.",
            "author": "Howard",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"So easy to use, Saws easily with one hand\"",
            "rating": 5,
            "date": "12/10/2015",
            "recommended": true,
            "text": "I bought this a year ago, And I use it on all construction projects, at least twice a week since I bought it, I love it",
            "author": "Bears Den",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Circular saw\"",
            "rating": 5,
            "date": "07/01/2019",
            "recommended": true,
            "text": "Lighter circular saw that is easier for me to handle. I am looking forward to using it for many project.",
            "author": "Marilyn",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice compact saw\"",
            "rating": 5,
            "date": "12/21/2017",
            "recommended": true,
            "text": "I purchased the 4 1/2\" circular saw about a month ago and i am so glad i did. Nice saw for the money and easy to use.",
            "author": "Mikel69",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact with a punch .\"",
            "rating": 5,
            "date": "06/20/2015",
            "recommended": true,
            "text": "I bought this for the size and ease of using it , yet it performs like the big boys ,without the the bulky handling .",
            "author": "Pltmann",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Sould have save my money\"",
            "rating": 2,
            "date": "02/04/2016",
            "recommended": false,
            "text": "Used this saw 2 times the bolt that holds the blade on is plastic and broke off in the arbor the 2nd time I used it",
            "author": "Boxer247",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Saw!\"",
            "rating": 5,
            "date": "01/02/2017",
            "recommended": true,
            "text": "Very smooth running. Makes very smooth and clean cuts. A great tool, glad I didn't wait any longer to purchase.",
            "author": "Bull",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"saw is much easer to use than my 7 1/4\"",
            "rating": 5,
            "date": "07/01/2015",
            "recommended": true,
            "text": "works perfect in remodeling. features are great such as left hand cut guide ease of cutting alongside a fence.",
            "author": "big guy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"the cut line guide is off good tool\"",
            "rating": 4,
            "date": "05/26/2015",
            "recommended": true,
            "text": "the cut line is off needs better sight line the marking for the cut line should be redone it will cut the 2/2",
            "author": "dingbat",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very good\"",
            "rating": 5,
            "date": "10/07/2015",
            "recommended": true,
            "text": "I bought this saw a month ago and am so happy that, I love it and would recommend it to anyone. It's awesome.",
            "author": "Henry Tran",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/19/2015",
            "recommended": true,
            "text": "I think it is a great tool. I have a lot of problem jamming up a big circular saw, this works so much better",
            "author": "connie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A Saw every DIY person should own\"",
            "rating": 5,
            "date": "12/22/2017",
            "recommended": true,
            "text": "This tool is so versatile that it has made my other saws feel neglected. It is excellent and so functional!",
            "author": "DocRon",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Happy\"",
            "rating": 5,
            "date": "02/01/2019",
            "recommended": true,
            "text": "I am extremely happy with this saw. It was very easy to handle and made smooth cuts without any problems.",
            "author": "Rejerio",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Compact Circular Saw\"",
            "rating": 5,
            "date": "02/05/2016",
            "recommended": true,
            "text": "Just bought it last month, it is excellent, very convenient and quick for those spur of the moment tasks.",
            "author": "Frank A",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Looks pretty in the box...\"",
            "rating": 1,
            "date": "01/13/2019",
            "recommended": false,
            "text": "I bought it yesterday. Returned it today.\nThis thing couldn't cut through bread.\n4 1/2 stars my a**!!!",
            "author": "Bcal77",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice to handle\"",
            "rating": 5,
            "date": "08/28/2016",
            "recommended": true,
            "text": "I bought this handsaw, it's  much like a skill saw but this is safe to use.   Not sorry of the purchase",
            "author": "Robert T",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Saw\"",
            "rating": 5,
            "date": "01/31/2016",
            "recommended": true,
            "text": "This is my second saw. My son got one. We use them daily. never a problem. they cut fast and straight",
            "author": "Dma 2620",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Fantastic Saw\"",
            "rating": 5,
            "date": "12/11/2017",
            "recommended": true,
            "text": "Bought the saw to finish trim and correct molding in flipped house!  Handy, convenient, quality cuts!",
            "author": "Splinterpolisher",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"good saw\"",
            "rating": 4,
            "date": "04/28/2019",
            "recommended": false,
            "text": "Bought this saw to cut laminate flooring. it worked well and was easier to use than a full size saw.",
            "author": "Woody74",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "12/16/2017",
            "recommended": true,
            "text": "i got it to cut holes in counter tops and in matched lumber it works great for that i am very happy [This review was collected as part of a promotion.]",
            "author": "Steven",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great little saw\"",
            "rating": 4,
            "date": "02/16/2016",
            "recommended": true,
            "text": "Just purchased saw a couple if weeks ago, but can already tell it's going to be a favorite tool.",
            "author": "Gcando",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/17/2018",
            "recommended": true,
            "text": "I do carpenter work and I got one of y'all's saw its a Rockwell circular saw model #4511 type 1 [This review was collected as part of a promotion.]",
            "author": "SMOKEY",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I like how it glides through wood with one hand\"",
            "rating": 5,
            "date": "03/29/2017",
            "recommended": true,
            "text": "Bought this because I was tired of clumsily trying to wrestle plywood sheets on my table saw.",
            "author": "Chalo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "11/01/2018",
            "recommended": null,
            "text": "I think this one the coolest tools I've bought in a while so compact and easy to use love it",
            "author": "Rickcanute",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/22/2017",
            "recommended": true,
            "text": "i just got my's IT'S A DAM GOOD SAW would get another one but only can use one at a time lol",
            "author": "jr66",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Perfect size\"",
            "rating": 5,
            "date": "07/25/2015",
            "recommended": true,
            "text": "Just what I've been looking for, lightweight and compact, perfect size for quick small jobs.",
            "author": "Wally8657",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"7,25  circle saw\"",
            "rating": 5,
            "date": "11/09/2017",
            "recommended": true,
            "text": "I BOUGHT A CIRCLE SAW MY OLD ONE BIT THE DUST AFTER 30 SOME YEARS HOPING THIS QNE QUTLAST ME [This review was collected as part of a promotion.]",
            "author": "EAGLEEYE",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"So far so good\"",
            "rating": 4,
            "date": "12/16/2017",
            "recommended": true,
            "text": "This is a nice little workhorse for small jobs. Very comfortable to use and powerful enough.",
            "author": "llama",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 3,
            "date": "01/17/2017",
            "recommended": null,
            "text": "I haven't used it yet. Upon receiving the unit it seems like the blade was previously used.",
            "author": "Daleisma",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/29/2016",
            "recommended": true,
            "text": "I've only used this a few times, but for the few times, the jobs have been quick and smooth",
            "author": "Dre32771",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact, easy to use\"",
            "rating": 5,
            "date": "12/20/2015",
            "recommended": true,
            "text": "Just purchased this item, replaces large bulky 71/4\". Just as tough and a breeze to handle",
            "author": "Mountain Man",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"excellent saw\"",
            "rating": 5,
            "date": "03/30/2015",
            "recommended": true,
            "text": "works great as an \"in between\" saw. No need to pull out the full size.Very happy with it.",
            "author": "jim fitz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Main line saw\"",
            "rating": 5,
            "date": "03/18/2016",
            "recommended": true,
            "text": "Have been using for little over 2/ months now and use just about every day. Great quality.",
            "author": "Grumpox",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome saw!\"",
            "rating": 5,
            "date": "10/07/2016",
            "recommended": true,
            "text": "This is a great little circular saw. Very powerful and compact and able to sut thru a 2x4.",
            "author": "Gill",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Handy size.\"",
            "rating": 5,
            "date": "07/19/2017",
            "recommended": true,
            "text": "Very useful for many of my projects. Small and compact, but powerful enough to do my work. [This review was collected as part of a promotion.]",
            "author": "Anthony",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works Great\"",
            "rating": 5,
            "date": "12/21/2017",
            "recommended": true,
            "text": "Great for use in small places needed for plywood removal in a travel trailer wooked great.",
            "author": "Rich1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great products\"",
            "rating": 5,
            "date": "12/22/2015",
            "recommended": true,
            "text": "Every time I buy a Rockwell product I am thoroughly satisfied. They have great product.",
            "author": "Snowman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I like the accuracy it cut a 1/8\" piece off a1x4\"\"",
            "rating": 4,
            "date": "07/25/2015",
            "recommended": true,
            "text": "I 've been using it about every other day and I'm most happy with the depth of the cut.",
            "author": "kirt",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/13/2015",
            "recommended": true,
            "text": "I needed a compact saw to finish my deck project. It performed just as expected GREAT!",
            "author": "Hooper59",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "12/17/2017",
            "recommended": true,
            "text": "easy to use and light weight  great to take on out of shop jobs  and great price!\n!!! [This review was collected as part of a promotion.]",
            "author": "wood worker",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Light ,fast and handy.   Excellent\"",
            "rating": 4,
            "date": "12/26/2016",
            "recommended": true,
            "text": "Got it a awhile ago.   It arrived on my door step\n2 days after I ordered.   Awesome.",
            "author": "Grpmilne",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"outstanding\"",
            "rating": 5,
            "date": "02/07/2015",
            "recommended": true,
            "text": "this saw has replaced my 7-1/4 circular saw almost 100%. one of the best tools I own.",
            "author": "terry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Blade\"",
            "rating": 5,
            "date": "12/25/2018",
            "recommended": false,
            "text": "This is a great tool But I need to know where I can get the blades for it ???? Thanks",
            "author": "The worm",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Easy to use.\"",
            "rating": 4,
            "date": "03/23/2017",
            "recommended": true,
            "text": "Only Used a couple of times but haven't seen anything negative yet.  So far so good.",
            "author": "John19",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Product\"",
            "rating": 4,
            "date": "11/23/2015",
            "recommended": true,
            "text": "strong power compact circular saw, good quality but grip is too big for small hand.",
            "author": "Billy Hla",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent Saw\"",
            "rating": 4,
            "date": "01/28/2016",
            "recommended": null,
            "text": "Used two or three times and is a great addition to my tools. Quick and easy to use.",
            "author": "Gator",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great tool\"",
            "rating": 5,
            "date": "02/15/2019",
            "recommended": true,
            "text": "Really like this saw. Makes it easy to get into to tight spaces. Plenty of power.",
            "author": "Lab",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 3,
            "date": "05/04/2019",
            "recommended": false,
            "text": "Out of the box. Cuts pulling to one side or other. Never could cut straight line.",
            "author": "Bobh",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"super handy !!!\"",
            "rating": 5,
            "date": "04/15/2015",
            "recommended": null,
            "text": "I had it for around a month ago and it's been a great investment for my company",
            "author": "sampean74",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Just what I needed\"",
            "rating": 5,
            "date": "07/01/2019",
            "recommended": true,
            "text": "This tool is just what I needed.  Concrete and wood no problem",
            "author": "Sam",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 1,
            "date": "12/14/2018",
            "recommended": false,
            "text": "We purchased this saw last week but are unable to get different blades! HELP!",
            "author": "Granny",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerful Awesome saw\"",
            "rating": 5,
            "date": "01/30/2016",
            "recommended": true,
            "text": "Power to cut through 2x4 with ease and lightweight for comfortable handling",
            "author": "nomvet",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"compact circular saw\"",
            "rating": 5,
            "date": "09/11/2015",
            "recommended": true,
            "text": "plenty of power, and good ergonomic design.light weight and easy to handle.",
            "author": "2012bigmike12",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"my saw\"",
            "rating": 4,
            "date": "02/06/2016",
            "recommended": true,
            "text": "i bought this saw a month ago and it works great for do it yourself project",
            "author": "kelsherkof",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Product\"",
            "rating": 4,
            "date": "11/23/2015",
            "recommended": true,
            "text": "strong power compact circular saw, good quality but grip is too big for small hand.",
            "author": "Billy Hla",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent Saw\"",
            "rating": 4,
            "date": "01/28/2016",
            "recommended": null,
            "text": "Used two or three times and is a great addition to my tools. Quick and easy to use.",
            "author": "Gator",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great tool\"",
            "rating": 5,
            "date": "02/15/2019",
            "recommended": true,
            "text": "Really like this saw. Makes it easy to get into to tight spaces. Plenty of power.",
            "author": "Lab",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 3,
            "date": "05/04/2019",
            "recommended": false,
            "text": "Out of the box. Cuts pulling to one side or other. Never could cut straight line.",
            "author": "Bobh",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"super handy !!!\"",
            "rating": 5,
            "date": "04/15/2015",
            "recommended": null,
            "text": "I had it for around a month ago and it's been a great investment for my company",
            "author": "sampean74",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Just what I needed\"",
            "rating": 5,
            "date": "07/01/2019",
            "recommended": true,
            "text": "This tool is just what I needed.  Concrete and wood no problem",
            "author": "Sam",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 1,
            "date": "12/14/2018",
            "recommended": false,
            "text": "We purchased this saw last week but are unable to get different blades! HELP!",
            "author": "Granny",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerful Awesome saw\"",
            "rating": 5,
            "date": "01/30/2016",
            "recommended": true,
            "text": "Power to cut through 2x4 with ease and lightweight for comfortable handling",
            "author": "nomvet",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"compact circular saw\"",
            "rating": 5,
            "date": "09/11/2015",
            "recommended": true,
            "text": "plenty of power, and good ergonomic design.light weight and easy to handle.",
            "author": "2012bigmike12",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"my saw\"",
            "rating": 4,
            "date": "02/06/2016",
            "recommended": true,
            "text": "i bought this saw a month ago and it works great for do it yourself project",
            "author": "kelsherkof",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great  saw for portable saws\"",
            "rating": 5,
            "date": "02/27/2017",
            "recommended": true,
            "text": "Had a blade change problem but Rockwell made it good and works great!",
            "author": "Robbie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rockwell saw\"",
            "rating": 5,
            "date": "01/29/2019",
            "recommended": true,
            "text": "Product is perfect size for a woman and small jobs around the house.",
            "author": "Marie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"fantastic\"",
            "rating": 5,
            "date": "12/04/2017",
            "recommended": true,
            "text": "easy to work with and excellent cutter and cannot be happier with it",
            "author": "jerry84",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "07/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "medrare",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"light weight as advertised\"",
            "rating": 5,
            "date": "10/13/2015",
            "recommended": true,
            "text": "used it a couple of times...my wife loves its power and handling...",
            "author": "Pat1942",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Easy operation\"",
            "rating": 5,
            "date": "01/03/2017",
            "recommended": true,
            "text": "Just love the precise cutting and easy operation of this little gem",
            "author": "haighron53",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great for floors\"",
            "rating": 4,
            "date": "10/20/2014",
            "recommended": true,
            "text": "except for the lock button its a great saw. so I sold my versa saw",
            "author": "moec",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great compact power full saw\"",
            "rating": 5,
            "date": "05/17/2017",
            "recommended": true,
            "text": "I Bought this year ago and it is so help full makes my job so eazy [This review was collected as part of a promotion.]",
            "author": "Stiles",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Rockwell 4 1/2 compact circular saw.\"",
            "rating": 5,
            "date": "02/05/2016",
            "recommended": true,
            "text": "Easy to use, well made, and a very durable tool. would buy again,",
            "author": "Jackie g",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great value\"",
            "rating": 5,
            "date": "07/17/2018",
            "recommended": true,
            "text": "I receive this for father's day, really like it, very practical.",
            "author": "Johnny 007",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "12/18/2017",
            "recommended": true,
            "text": "The saw was awesome . Did  what it supposed to be for the price [This review was collected as part of a promotion.]",
            "author": "Voila",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"nice tool\"",
            "rating": 5,
            "date": "12/22/2017",
            "recommended": true,
            "text": "makes easy work out of jobs that may need a special tool or saw [This review was collected as part of a promotion.]",
            "author": "lhoops",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great saw\"",
            "rating": 5,
            "date": "02/22/2016",
            "recommended": true,
            "text": "small, light,fast that is words I want talking about this saw.",
            "author": "yui gen",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Lightweight versatile saw\"",
            "rating": 4,
            "date": "12/28/2017",
            "recommended": true,
            "text": "Thumb safety cross bolt very difficult to engage\nConveniently",
            "author": "Samoht",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"It doesn't get hot in your hand working\"",
            "rating": 5,
            "date": "06/24/2015",
            "recommended": true,
            "text": "Rockwell stand be hind what every they sell better than sears",
            "author": "hawk01",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/11/2018",
            "recommended": true,
            "text": "Performance adequate for size of saw recommend for small jobs",
            "author": "Rizi55",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "11/29/2017",
            "recommended": true,
            "text": "Great hand saw for cutting in a tight area.  Love it Thanks [This review was collected as part of a promotion.]",
            "author": "Winsor",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 1,
            "date": "08/11/2017",
            "recommended": false,
            "text": "I've returned the rockwell saw because design handle flaws.",
            "author": "fgfmgf",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"wonder\"",
            "rating": 5,
            "date": "08/26/2015",
            "recommended": true,
            "text": "i love my new toy it make my life so much easy and I women",
            "author": "mcdermott64",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great size of saw\"",
            "rating": 5,
            "date": "01/11/2016",
            "recommended": null,
            "text": "Very happy with this small saw. Cuts easy and compact size",
            "author": "Peterh1969",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome saw...\"",
            "rating": 5,
            "date": "11/17/2016",
            "recommended": true,
            "text": "Powerful, well built, and versatile.  Just an amazing saw.",
            "author": "angelor",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Perfect lit le ses.\"",
            "rating": 5,
            "date": "12/27/2017",
            "recommended": true,
            "text": "Hi smal ses for big jobs cut very good for litote placés. [This review was collected as part of a promotion.]",
            "author": "tintin",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"So far so good\"",
            "rating": 4,
            "date": "06/28/2019",
            "recommended": null,
            "text": "Haven't had it long but it's been working fine so far",
            "author": "M",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Kitchen\"",
            "rating": 5,
            "date": "03/26/2017",
            "recommended": true,
            "text": "I bought this to cut a tile counter top.  Worked great! [This review was collected as part of a promotion.]",
            "author": "Skiloko",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"4 1/2 ( 5amp)  circular saw\"",
            "rating": 5,
            "date": "03/29/2017",
            "recommended": true,
            "text": "Powerful, smooth running tools ,motor runs very smooth. [This review was collected as part of a promotion.]",
            "author": "Richie Rich",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"handy saw!\"",
            "rating": 5,
            "date": "12/18/2015",
            "recommended": true,
            "text": "saved a lot of time: handy to use.highly recommend it.",
            "author": "handyman 123",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Buen producto.Te lo recomiendo.\"",
            "rating": 4,
            "date": "01/03/2016",
            "recommended": true,
            "text": "Super contento lo estoy usando trabaja bien.nada mejor.",
            "author": "Cheo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great little saw!\"",
            "rating": 5,
            "date": "01/23/2017",
            "recommended": true,
            "text": "Works great, handles easily..........love that sound!",
            "author": "Woodsie bear",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Compact\"",
            "rating": 5,
            "date": "04/02/2015",
            "recommended": true,
            "text": "Bought a month ago no regrets would highly recommend",
            "author": "Meco2015",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great compact saw\"",
            "rating": 5,
            "date": "03/30/2015",
            "recommended": true,
            "text": "This saw is perfect for light jobs and easy to use.",
            "author": "Duck",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"light and compact\"",
            "rating": 5,
            "date": "09/03/2015",
            "recommended": true,
            "text": "Easy to use, light and compact, small but powerful.",
            "author": "danvil",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"nice tools\"",
            "rating": 5,
            "date": "01/20/2018",
            "recommended": true,
            "text": "Very handy and useful good quality and fast cuting",
            "author": "Vahol",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice and compact\"",
            "rating": 4,
            "date": "03/12/2019",
            "recommended": true,
            "text": "Had to cut tile it worked great",
            "author": "Marine",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Exceeded my Expectations\"",
            "rating": 5,
            "date": "02/13/2016",
            "recommended": true,
            "text": "I bought this product a couple of days ago because I needed something like this to strip siding off of my home. I am in the process of adding an extension onto my bathroom to get more space. I had considered another brand and almost bought it. However, this product had more flexibility in features that I thought I might need someday buy did not think I needed it for my current project. The first thing I noticed was the \"tightness\" of the product. The blade went on snugly, the angle plate was snug, and guide went in and secured easily and firmly. I found myself using the angle adjustment feature a lot more than I expected. The setting and latching of the angle was easy to do and did not shift during the cut. The power was adequate for the job I had. I cut 2 X 4s without any hesitation in the cut. One thing I did notice was that my hands are not large so I had to remember to use my longest finger to wrap around the saw for one-hand operation. Not a big deal for me after that and I found I could control the saw more accurately that way, anyway. Great product. I will be using this saw for a LOT of my projects in the future. I guess the best I can say about this product is that it does what I expect it to do, does it easily, does it precisely, and at a great price.",
            "author": "jm75979",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/30/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Ted",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"I love the concept of this saw, but it has a few d\"",
            "rating": 3,
            "date": "06/07/2016",
            "recommended": true,
            "text": "I'm  a professional tradesman and have been for over 40 years,  this is a great saw except for the left handed tradesmen, the safety switch/button is at a very awkward position if you are holding it in your left hand. I would,buy a second one if it came in a mirror image of this saw. The other controls and blade setting depth and angle are easy to get to. One other feature I would like,to see is,a teflon surface on the bottom of the fence. This would lessen the chance of maring the finish of the things being cut. O.k. Rockwell when are you going to make a left handed version or move the safety switch to where its,more ergonomically correct for both left and right handed craftsmen. At present it is very combersome to hold and control in the left hand also I can't see where I'm cutting. I would think as,a design standpoint you would want to have it ergonomically easy to use for all people. Not just right handed people. I'm  about ready to duck tape that sucker so it is,easier to operate and control. Trjth be told it would be safer too. As I would have a,full grip of the toll to control kickback. As it is now I just about kicks,out of my hand. Don't  tell me I should be able to use my other hand to run the saw. That's a poor excuse. \n\nNeil Shattuck\nMillmaster1047@yahoo.com",
            "author": "Neil S",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/30/2019",
            "recommended": null,
            "text": "There is no review to accompany this rating.",
            "author": "Jolie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "02/24/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Ham",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/26/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Mister",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "04/05/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Teherz",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "04/28/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Chance",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "02/01/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Lynn",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/23/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Dummy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/29/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "frankko",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/14/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Dan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/07/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Staci",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/05/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Brianne",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/09/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Marcela",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/29/2019",
            "recommended": null,
            "text": "There is no review to accompany this rating.",
            "author": "Loren",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/18/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Sherry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Mediocre\"",
            "rating": 3,
            "date": "09/16/2016",
            "recommended": true,
            "text": "Rockwell's Compact Circular Saw has its pluses & minuses. It has a nice long electrical cord; I have used it many times without using an extension cord. The depth and angle adjustment are simple and easy to use. When holding the Compact Circular Saw, it seems heavy for its size and solidly build; that being said, when I turn off my saw, as it is spinning down, it makes loud and disturbing noises, like metal clanging or bearings flying around inside the motor. However, it continues to work and works well. (I will keep using it until it flies apart.) \nOn the minus side, how cheap can Rockwell be; for a hundred dollars, they give you a cardboard box to store your Compact Circular Saw. \nThe thing I dislike most about the Compact Circular Saw is the safety/on-off switch. My hand is of average to large size. I have found it difficult to turn on the Compact Circular Saw on while wearing leather gloves; it is hard to grip and turn on the safety switch. I can manage without gloves but I rather wear gloves while the saw blade is spinning. \nThe Compact Circular Saw has its place but it is no replacement for a 7 ¼ inch saw. I own both the Rockwell Jaw Horse and the Rockwell Oscillating Multi Tool each of which I would rate five stars. However, the Compact Circular Saw is just mediocre, deserving a three or at best a four star rating.",
            "author": "DMullen",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great saw nice performance But....\"",
            "rating": 4,
            "date": "02/14/2016",
            "recommended": true,
            "text": "every thing about this is great, like the saw, BUT THE GUIDE IS POOR. It needs to be redesigned for squareness and straight cuts when I tried to use it it was not able to be used As Is, had to bend it to match blade line. After several trying I got it almost straight . would not work with 1/4\" material Ok for 3/4 material but difficult to make it cut square end cuts. Like the screw adjusting lock but the guide is so poor I had to use a 48\" squaring guide and lock bar to guide the saw for straight 24\" and under cuts...(If I had a 24 guide I might have used that instead.)Also for making the nice left hand viewing of cut, the base of saw is slightly too short when aligning blade to cut and at same time keeping the saw in straight cut. I used a 8\" square to align but found it difficult to hold true to markings on 1 x 3 material.I bought this saw at Lowes LHC and bought the 4.5 inch as they carried that size replacement blades, would like to have a higher tooth count blade for some applications. had some tear outs on some birch and pine Perhaps a plywood blade would be nice.This saw is a replacement for a Sears 7.25 that aged out and died after 30 years. Sort of matches me. in aging out.The safety feature for punching the red side button and then the trigger is not placed well, should be able to punch one and then pull trigger with same finger.",
            "author": "Sid B",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"It's a worthwhile tool to own.\"",
            "rating": 4,
            "date": "01/05/2017",
            "recommended": true,
            "text": "I don't like to review tools too early in the usage cycle since I can't really comment on durability over time since I've only owned it for a little while. I'll leave that to others who have used one for years. I think the 'bottom line' question for a lot of people is \"should I buy one of those little handheld circular saws when I already have a big one\". Depending on the work you're doing, the answer may be a strong yes. This tool does not replace a chop saw or a larger circular saw and nobody is suggesting that. If you need to make a lot of production cuts or you need to cut heavier material, those tools have earned their place in the lineup. \n\nWhere this tool shines brightest is when you need to make a field cut in some kind of odd position that requires the smaller, one-handed design. In our case, our home was impacted by Hurricane Matthew and invited in the Atlantic Ocean for a couple hours. The result  was short of a total gut rehab but it was a fairly major renovation that required a lot of retrofitting, of cutting out 'bad' material to be replaced by new, etc, all of it in weird positions. This was purchased later into the project, I wish I had purchased it earlier. It was very helpful, not to mention that as the project progressed, it became the handy grab-and-go saw for making quick cuts on all sorts of stuff, from plywood to trim. \n\nI give this 4 stars of 5 because I can't attest to its long term durability but presuming this tool holds up, it's a 5 star unit. On a home building or major renovation project, I wouldn't be without a chop saw, I wouldn't be without a full size circular saw and now that I've used this, I wouldn't be without one of these, either.",
            "author": "Lon1",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"great potential\"",
            "rating": 4,
            "date": "11/03/2014",
            "recommended": true,
            "text": "I purchased this to be a lifesaver and problem solver, an excellent product but not right for me.I am used to a right hand cut.I prefer a right hand cut It seems safer on the right hand side. If you clamp a straight edge on your work piece to guide the saw you can avoid a crooked cut and avoid dust in your eyes. If you know how to set your straight edge you can focus on safety and not really need to sight your cut . You can check it as you cut. The fact that the motor comes out the rear, similar to the ancient Egyptian pharaoh's elongated skull allows better clamping space. That is good. A balanced handle should be integrated on top of the motor housing with the switch on it. The safety lock button could use improvement. The motor has a sweet sound. This saw has great potential but needs more refinements. I would sure like to have the new redesigned one. My objective was to reduce saw dust and be able to do more indoor cutting.Let me try to sum this up. There are things that need to be redesigned on this saw.1. Right hand cut2. A handle as it feels awkward and potentially unsafe and uncomfortable.3. stiffen up the shoe plate and see that the edges ride a straight edge and do not tend to roll up on and over it.4. Dust collection rig via small shop vac a great plus.5. This saw is almost there...A few more design changes and perfection and it willbecome the greatest sidekick ever made. And likely legendary as the most beloved saw ofall time. I hope to see this happen. Please turn this saw into the timeless classic I have described. In its current form I am not comfortable with it and did send mine back with suggestions. Please fellows, put it back on the drawing board, it has the potential of becoming a winner and an icon. I would tell a friend to try one out \"IF\" they can tolerate a left hand cut and then review their comments. You guys almost have it right.Thanks, Don Calloway",
            "author": "djcguitar",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        }
    ],
    "reviewStats": {
        "reviewCount": 364,
        "percentRecommended": "85",
        "averageStars": "4.4",
        "starCounts": {
            "five": 247,
            "four": 70,
            "three": 18,
            "two": 12,
            "one": 17
        }
    },
    "questions": [
        {
            "question": "\"does this product include a carrying bag?\"",
            "author": "Anonymous",
            "date": "12/18/2013",
            "answers": [
                {
                    "author": "LET-UT",
                    "date": "01/09/2015",
                    "text": "Nope, you'll need to provide your own case or toolbox for this item.",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                },
                {
                    "author": "concealed4sure",
                    "date": "12/26/2014",
                    "text": "The saw came with a heavy duty zip up black bag designed to hold the saw and the 3 blades (a $40.00 value for the included 3 different blades for different uses).",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "vette-nut",
                    "date": "07/18/2014",
                    "text": "Mine did not come with a bag",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "Dogbert-the-Great",
                    "date": "07/14/2014",
                    "text": "NO, there is a higher priced one that might have a bag.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "outlawwoman",
                    "date": "06/29/2014",
                    "text": "No it doesn't include a carrying bag.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Jeanette",
                    "date": "06/11/2014",
                    "text": "No carry bag.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Brian",
                    "date": "06/06/2014",
                    "text": "Nope",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "12/19/2013",
                    "text": "No, a carrying case or bag is not included.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "ConsumerX",
                    "date": "12/19/2013",
                    "text": "No, it does not but I picked up a toolbox for around $8.00 with room for the saw and extra blades.",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"What type of blade should i use if i would like to cut a 1/4 inch plastic sheet (like a glass, but its a plastic)?\"",
            "author": "Anonymous",
            "date": "10/31/2014",
            "answers": [
                {
                    "author": "Thomas",
                    "date": "02/02/2015",
                    "text": "Plywood blade, or other blade reversed",
                    "helpful": {
                        "yes": 1,
                        "no": 1
                    }
                },
                {
                    "author": "LET-UT",
                    "date": "01/09/2015",
                    "text": "There's currently only one blade available for this saw. Cutting plastic is always a bit dicey because it tends to melt. You'd be better off looking for specialty blades for a band saw, or full-size circular saw.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Martha",
                    "date": "01/05/2015",
                    "text": "Fine tooth",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "badgeName": "95298381-a804-5da0-a092-2ad40782cc70",
                    "author": "Worx Product Expert",
                    "date": "10/31/2014",
                    "text": "To cut sheet plastic a higher tooth count would work better. Of the 3 blades we have available I would choose the 60 tooth blde over the 24. You might be able to find a higher tooth count but make sure it is a 4-1/2\" with the same arbor.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "10/31/2014",
                    "text": "You can use a fine blade. Blades with fine closely spaced teeth (like those used for plywood) will work relatively well.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"will this saw work with a 4 inch blade?\"",
            "author": "Anonymous",
            "date": "01/30/2014",
            "answers": [
                {
                    "author": "LET-UT",
                    "date": "01/09/2015",
                    "text": "You need to worry both the blade diameter and the arbor design. Rockwell makes smaller blades for their Versa Cut tool, but I'm not sure they're interchangeable with this too. There's currently only one blade designed specifically for this saw.",
                    "helpful": {
                        "yes": 2,
                        "no": 2
                    }
                },
                {
                    "author": "Martha",
                    "date": "01/05/2015",
                    "text": "Yes but it will limit what you can cut.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Cwayne4u",
                    "date": "04/16/2014",
                    "text": "No, it needs a 7/12",
                    "helpful": {
                        "yes": 0,
                        "no": 10
                    }
                },
                {
                    "author": "Trina",
                    "date": "03/03/2014",
                    "text": "yes I used a 4\" blade with it",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"does it cut different materials other then wood?\"",
            "author": "Anonymous",
            "date": "12/30/2013",
            "answers": [
                {
                    "author": "LET-UT",
                    "date": "01/09/2015",
                    "text": "There's only one blade available for this saw right now and it's clearly designed for wood. It you need to cut other items you might be better off with a different tool until they release new blades in the 4.5-inch size.",
                    "helpful": {
                        "yes": 6,
                        "no": 1
                    }
                },
                {
                    "author": "concealed4sure",
                    "date": "12/26/2014",
                    "text": "The saw came with a package of 3 blades ( a $40.00 value) and can be used on different surfaces. Other types of blades are available.",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                },
                {
                    "author": "UncleJesse",
                    "date": "12/31/2013",
                    "text": "Most saws will cut different materials, the blade you attach will determine what it will cut. Just purchase a blade suited to cutting the material you are working with.",
                    "helpful": {
                        "yes": 1,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"Will the saw cut 2x4s?\"",
            "author": "Anonymous",
            "date": "06/16/2019",
            "answers": [
                {
                    "badgeName": "50073341",
                    "author": "Rockwell Tools Expert",
                    "date": "06/21/2019",
                    "text": "Yes. Rockwell's new Compact Circular Saw with a 4½\" blade cuts 2X4s in a single pass. The maximum cutting depth of the Compact Circular Saw at 90 degrees is 1-11/16”. The maximum cutting depth of the Compact Circular Saw at a 45 degree bevel is 1-1/8”.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "06/21/2019",
                    "text": "Yes, it can cut 2x4s",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"will this saw do plunge cuts in wood safely\"",
            "author": "Anonymous",
            "date": "02/14/2015",
            "answers": [
                {
                    "author": "LET-UT",
                    "date": "04/18/2015",
                    "text": "Yes, but not very deep. It's maximum depth is about 2 inches.",
                    "helpful": {
                        "yes": 5,
                        "no": 0
                    }
                },
                {
                    "badgeName": "95298381-a804-5da0-a092-2ad40782cc70",
                    "author": "Worx Product Expert",
                    "date": "02/18/2015",
                    "text": "Yes, you can do plunge cuts with this saw using the same technique as you would with a full size saw. However, the Versacut saw is designed specifically as a plunge cut saw and the blade on it is only exposed when you are making a plunge cut.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"where is it made? is it imported?\"",
            "author": "Anonymous",
            "date": "11/08/2013",
            "answers": [
                {
                    "author": "amateurdiyer",
                    "date": "10/10/2014",
                    "text": "Per the box, China.",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                },
                {
                    "author": "Cwayne4u",
                    "date": "11/18/2013",
                    "text": "For this price, I'm sure it is. I've had mine for close to a year and have used the dickens out of it. I also have a dewalt and a craftsman, I like the Kabolt best.",
                    "helpful": {
                        "yes": 0,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"I do minor home repairs and I don't have alot of space. I'm looking for the most general power tool for cutting possible. Would this be a good choice?\"",
            "author": "Anonymous",
            "date": "05/06/2019",
            "answers": [
                {
                    "badgeName": "50073341",
                    "author": "Rockwell Tools Expert",
                    "date": "05/14/2019",
                    "text": "Thank you for your question! The answer to your question will be yes . Thank you for choosing Rockwell !",
                    "helpful": {
                        "yes": 0,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"When cutting to remove subflooring, how close can I get the cut to the wall?\"",
            "author": "Anonymous",
            "date": "06/06/2019"
        },
        {
            "question": "\"I noticed on the specs. It did not show the horse power. Could you fill me in on this as it says 5 amp.?\"",
            "author": "Anonymous",
            "date": "06/02/2019"
        }
    ]
}