{
    "descriptions": {
        "overview": "This is the perfect grill for everyday family cooking and weekend entertaining. 18 In. of grill surface allows you to cook plenty of food for all but the biggest gatherings. Put a Kamado Joe classic I on your patio and it will soon became your favorite way to cook! Best built, flat out the best ceramic grill on the planet. That may be a bold statement, but we invite you to look under the hood and see for yourself. If you compare Kamado Joe ceramic grill with other ceramic grills on the market, you'll soon recognize that Kamado Joe's the best built grill on the market and that fit and finish are second to none. But there's a lot more to a Kamado Joe grill than meets the eye. Most versatile. We may call Kamado Joe a grill, but it's really that and a whole lot more. A key advantage of Kamado Joe's ceramic vessel is its ability to insulate. Not only does this require less total heat for cooking, it also lets you cook at significantly higher temperatures or at very low temperatures for a significantly longer time. Combine this with the ability to not only control, but fine-tune temperature, and you get a grill that is extremely versatile. Grill, smoke, sear, bake. Best warranty. We back them like we build them. Kamado Joe comes with a lifetime warranty on ceramic parts and free shipping on all warranty parts.",
        "list": [
            "Premium 18 In. ceramic grill with sturdy cart, locking wheels",
            "Includes divide and conquer flexible cooking system",
            "Patented slide-out ash drawer",
            "Ash tool and grate gripper included",
            "Lifetime warranty on ceramic parts"
        ]
    },
    "specs": [
        {
            "title": "Series Name",
            "spec": "Classic Joe"
        },
        {
            "title": "Primary Cooking Area (Sq. Inches)",
            "spec": "254"
        },
        {
            "title": "Warming Rack Area (Sq. Inches)",
            "spec": "0"
        },
        {
            "title": "Total Cooking Area (Sq. Inches)",
            "spec": "254"
        },
        {
            "title": "Firebox Width (Inches)",
            "spec": "18"
        },
        {
            "title": "Firebox Depth (Inches)",
            "spec": "13"
        },
        {
            "title": "Assembled Height (Inches)",
            "spec": "48.5"
        },
        {
            "title": "Assembled Width (Inches)",
            "spec": "46.531"
        },
        {
            "title": "Assembled Depth (Inches)",
            "spec": "30.125"
        },
        {
            "title": "Assembled Weight (lbs.)",
            "spec": "188"
        },
        {
            "title": "Cooking Grate Material",
            "spec": "Stainless steel"
        },
        {
            "title": "Side Shelf",
            "spec": "Folding"
        },
        {
            "title": "Temperature Gauge",
            "spec": 1
        },
        {
            "title": "Warming Rack",
            "spec": 0
        },
        {
            "title": "Lid Material",
            "spec": "Ceramic"
        },
        {
            "title": "Removable Ash Catcher",
            "spec": 1
        },
        {
            "title": "Adjustable Charcoal Tray",
            "spec": 0
        },
        {
            "title": "Manufacturer Color/Finish",
            "spec": "Red"
        },
        {
            "title": "Grill Color/Finish",
            "spec": "Red"
        },
        {
            "title": "Grill Warranty",
            "spec": "Limited lifetime"
        },
        {
            "title": "Lowe's Exclusive",
            "spec": 0
        },
        {
            "title": "Team Name",
            "spec": "N/A"
        },
        {
            "title": "Team/League",
            "spec": "N/A"
        },
        {
            "title": "UNSPSC",
            "spec": "48101500"
        },
        {
            "title": "Grill Style",
            "spec": "Kamado"
        }
    ],
    "reviews": [
        {
            "images": [
                {
                    "smallName": "ed63d749-35d3-5c3f-8096-7b1d68fa92eb",
                    "largeName": "fa0a298f-fcd3-50a1-8d42-2b24b123d396"
                }
            ],
            "title": "\"Next.  Freaking.  Level.\"",
            "rating": 5,
            "date": "03/23/2019",
            "recommended": true,
            "text": "This is my first Kamado grill, so it's my first Kamado Joe.  I just did my first cook on it.First, this grill comes delivered in a secure crate.  While nobody recommends assembling it alone, no one was around to help me, so I gave it a shot, and it is possible.  But make no mistake: at nearly 300 lbs., this thing is heavy because it's built to last.The shiny red color is really impressive, and the Kamado Joe comes with everything you need to get started, including the stand, shelves, aand ash and grill grip tools.After durability, versatility is the Kamado Joe's main selling point.  You can search, grill, slow smoke, and bake in this thing.In short, the Kamado Joe Classic could be the last grill you need.",
            "author": "IlMaestro",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 8,
                "no": 2
            }
        },
        {
            "title": "\"Love to grill and this one makes it better.\"",
            "rating": 5,
            "date": "12/31/2018",
            "recommended": true,
            "text": "This is an awesome grill. I had heard of the versatility of these kamodo grills and had been eyeing a few cheaper off-brands. And all along wanted a Kamodo Joe, but it seemed cost prohibitive. But I came across this one, on sale at Lowes and had to have it. With no prior experience with this type grill. I didn't had any problem cooking with it. Kamodo Joe has plenty of videos online, that make that aspect easy. I have used it twice now, in less than a week and everything has come out great.Another notable feature of this type of grill. Is you can cook at constant temperature, by correctly setting the vents.",
            "author": "AWinHou",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 24,
                "no": 3
            }
        },
        {
            "images": [
                {
                    "smallName": "8381da2e-cd21-593c-b345-41e51d0b1b68",
                    "largeName": "19e64aa9-4b6e-5d83-847d-7640ca048bcc"
                }
            ],
            "title": "\"Grilling at a different level!\"",
            "rating": 5,
            "date": "02/18/2019",
            "recommended": true,
            "text": "This is the best grill one can have. The ceramic material retains the moisture of the meat, veggies, absolutely anything that you grill. The assembly was super easy and just took few minutes. Lowe's guys made the delivery super comfy and we had the best experience. Can't think of eating outside when I have this charcoal grill right in my backyard! Setting temperature is easy, just lite the charcoal and get ready for juiciest meat. We were confused between green egg and kamado joe and now all doubts are cleared after using this one! We are glad we made this purchase at Lowe's !",
            "author": "Anshu",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 10,
                "no": 5
            }
        },
        {
            "images": [
                {
                    "smallName": "ebdbe839-91db-59d8-8941-ff2f9e3a5dc6",
                    "largeName": "dfd8fcb7-0190-5b1a-9450-b2bfe91f0d3d"
                }
            ],
            "title": "\"It is the first generation Joe, so what?\"",
            "rating": 5,
            "date": "06/04/2019",
            "recommended": true,
            "text": "This is an excellent Kamado and for the money, you cannot beat it.  The features it comes with outweigh the BGE hands down and it cooks excellent.  I have owned 2 BGE's before and this one is a much better value with more features and the same warranty.   It is more expensive than some cheaper metal kamados, but if you will take the time to learn how to use it, you will never need to buy another grill and you can pass it on to your kids. I bake, smoke, sear, roast, cook pizza, etc.   The only thing this grill wont do is make ice cream and you may be able to get it to do that with some retrofitting :)  There were comments about it being the first generation model.   Lifetime warranty is lifetime warranty!  Buy it, you wont regret it",
            "author": "FormerEggHead",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "567c6983-5590-596d-a0f8-bcf78d8c88e3",
                    "largeName": "b2818b88-c35d-5296-822c-2a2c8f4181c7"
                },
                {
                    "smallName": "2035fb3a-6d71-5c26-8eae-1fa0f05b3771",
                    "largeName": "2a9ce50e-83da-5ed1-af9d-440d8770ebf1"
                }
            ],
            "title": "\"Kamado Joe\"",
            "rating": 5,
            "date": "07/05/2019",
            "recommended": true,
            "text": "Grill was very well packaged.  Setup was fairly easy, other than the fact that the pieces are quite heavy and require a little extra care to avoid breaking anything. Definitely use a helper.  Have used it for grilling pizza so far and it turned out perfectly!! Easy to regulate heat and you can get it very hot - also holds heat quite well. So far so good. Would definitely recommend.",
            "author": "Kphynes",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "1b40e1fd-53ed-5fa1-bf40-9f4bd969b109",
                    "largeName": "936b48cc-8abd-5fd2-a181-2ac3af541a7b"
                }
            ],
            "title": "\"Wondertool\"",
            "rating": 5,
            "date": "06/18/2019",
            "recommended": true,
            "text": "This is an amazing tool. The build quality is second to none and the ease of use is so easy a caveman could do it!  The cost benefit from the competition is what sold me on this grill. Along with everything that I needed to get started using it was packaged together and I didn't have to get the grill then the stand add the the cooking surface add the heat deflector and on and on. It's all there one price!!  I have not stopped using it since I got it home!! Very glad I purchased it! I think you will be also!",
            "author": "Helochief06",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"So much more for less\"",
            "rating": 5,
            "date": "01/19/2019",
            "recommended": true,
            "text": "Been studying and looking at Komodo style grills for a number of years.  There are certainly more expensive ones but not better.  This comes with everything.",
            "author": "Dan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 16,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "fe7df7f5-730f-5405-a3ec-7da4f36b98ef",
                    "largeName": "727d0a80-76c8-5c1d-957a-7908d142c126"
                }
            ],
            "title": "\"Best Purchase I ever made.\"",
            "rating": 5,
            "date": "06/06/2019",
            "recommended": true,
            "text": "I went to Lowes to review the Kamado Joe compared to the green model. I was familiar with the other one.  Spoke with Virginia at the store and looked over the Kamado Joe and decided to purchase after Saleslady told me it was $748.  Had all the accessories the green one charges extra for plus I used my veterans 10% discount for the purchase.  Love my red cooker. I love the scoop included to remove the ashes.  I use to own a barbecue business and am a master rib cook.",
            "author": "FULLFILLED",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Love this grill\"",
            "rating": 5,
            "date": "02/04/2019",
            "recommended": true,
            "text": "Recently purchased and used twice. Grilled great steak tips quickly the first week and then smoked a boston butt  low and slow the next. I filled with lump charcoal and smoked the butt 10.5 hours and still had charcoal left. Also easy to assemble, you will however need some help unloading. It is very heavy.",
            "author": "WT",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 10,
                "no": 0
            }
        },
        {
            "title": "\"Kamado Joe Classic 18”\"",
            "rating": 5,
            "date": "07/08/2019",
            "recommended": true,
            "text": "I love the grill!  So versatile I can do away with my oven.  Anything can be grilled in this with the temperature range of 200-800.  There are only 2 of us and the size is perfect.  For a family of 4 I definitely would go a size up.",
            "author": "TJ",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "991f866e-04fc-5492-8418-9dc5d6875893",
                    "largeName": "da271e5a-81c7-51fb-ad69-5956268ec8e7"
                }
            ],
            "title": "\"Great Grill\"",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "We bought this grill in April and I LOVE it. We had about a 2 week learning curve going from propane, but I don't think I will ever buy propane again. We love our Joe! I have cooked all the meats, pizza, stir fry, and even baked dessert on it, and I have to say, I have loved everything that's come off the grill! We also own the Wok and it makes the best stir fry I have ever had.",
            "author": "AlexAndBill",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Couple of things to be aware of...\"",
            "rating": 5,
            "date": "05/28/2019",
            "recommended": true,
            "text": "First off...great grill at a good price.  But, you get what you pay for.  This is the same Kamado Classic as you see at other Kamado dealers, but there are a few differences that explain the lower price.  First, the hinge mechanism is a cheaper version-it's not adjustable nor does it allow the lid to stay partially opened.  It's either fully open or fully closed...there is no in-between.  Also, there is no latch on the lid so you cannot lock it closed.  The other thing that you notice is the vented cap on this version is cast iron and has the old-style venting wheel, not the cast aluminum cap you see on the typical 18\" classic.All these really don't effect the performance and how great this thing cooks...if I had it to do over again, I'd buy it.  You can use the couple of hundred dollars you saved on this grill for a few bags of charcoal and other goodies for your outdoor kitchen.I was impressed at how well this was packed and how quickly I was able to assemble it.  You'll want to calibrate the temperature gauge...I found it to be about 50 degrees off-but it was simple to correct it as it has an adjustment screw on the back of the gauge.  Simply remove it from the grill and put it in a pot of boiling water...if it doesn't register 212 degrees, adjust it accordingly.",
            "author": "Buckshot",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 9,
                "no": 2
            }
        },
        {
            "title": "\"Great Kamado Grill\"",
            "rating": 4,
            "date": "03/15/2019",
            "recommended": true,
            "text": "This is a great product.  Comes with everything you need plus some.  I like the stand with wheels!",
            "author": "SteveW",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Cooks Amazing - and - Beautiful !!\"",
            "rating": 5,
            "date": "04/04/2019",
            "recommended": true,
            "text": "We have cooked on this grill and its so good.  I would recommend watching some YouTube video's on the process and techniques on cooking with a smoker … especially a Kamado Joe.  I can't wait till we cook a port shoulder and make some BBQ :)",
            "author": "Michelle",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Kamado Joe Classic WINNER\"",
            "rating": 5,
            "date": "05/07/2019",
            "recommended": true,
            "text": "I already had another Kamado Grille at my other house (A Primo), and I cook on it regularly. We decided to give this one a try and are happy to say it is as good a Kamado as the more expensive Primo in our opinion. Lowe's brought it completely set up and ready to go. We grilled steaks on it the same day we received it and were extremely pleased with the results. Lowe's pricing and delivery were top notch. I recommend both!",
            "author": "KEDCS",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Amazing grill!!\"",
            "rating": 5,
            "date": "04/21/2019",
            "recommended": true,
            "text": "It's a very well made Kamado with many available accessories. After much research, I chose this grill over a Big Green Egg (it's a better value and KJ has top notch customer service). This Kamado Grill has truly reinvigorated my love of outdoor cooking!!",
            "author": "Joe",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 1
            }
        },
        {
            "title": "\"Previous generation\"",
            "rating": 1,
            "date": "05/28/2019",
            "recommended": null,
            "text": "I was informed by Kamado Joe support that this is actually the previous generation model and that many of the upgrades for the current generation are not compatible with this model. Be aware that buying this grill means you are purchasing an already legacy model.",
            "author": "Shawn",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 10,
                "no": 13
            }
        },
        {
            "title": "\"The best\"",
            "rating": 5,
            "date": "02/27/2019",
            "recommended": true,
            "text": "I liked the way KJ ships their grills. Took me almost 15 minutes to assemble after it was unpacked. Nothing broken or scratched.The heat is very even and easy to regulate to within about 5°.Very happy with this grill and the videos online from Kamado Jo in setup and use. You will be happy you bought one.",
            "author": "Tcrossan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 2
            }
        },
        {
            "title": "\"Kamando Joe\"",
            "rating": 5,
            "date": "04/03/2019",
            "recommended": true,
            "text": "I am very pleased with my Kamando Joe grill, had been comparing the Kamando Joe to the Big Green Egg. After watching/reading many reviews it was determined that the Kamando Joe is more bang for your buck. Knowing someone who has a Big Green Egg I now agree. Kamando Joe is the way to Go!!",
            "author": "Jason",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 1
            }
        },
        {
            "title": "\"Quick & Easy\"",
            "rating": 5,
            "date": "02/17/2019",
            "recommended": null,
            "text": "Ordered online.  Picked up and loaded by staff at front door.  Great experience.",
            "author": "Rory",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Amazing Results\"",
            "rating": 5,
            "date": "09/02/2016",
            "recommended": true,
            "text": "Once you get past the learning curve of using one of these you will understand what everyone is talking about.  I have baked bread, seared steaks and tuna, cooked pizza, slow cooked ribs,  etc.  These grills are super addictive and I use it all winter long - I cook on it every chance I get.  Because it is ceramic and air tight your food will almost always be juicy.  I detest using my gas grill and only use it if I need something cooked in a few minutes.",
            "author": "Big S",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/12/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Ken",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Awesome Grill, good service and warranty\"",
            "rating": 5,
            "date": "11/08/2016",
            "recommended": null,
            "text": "I was a little unsure making the purchase but now I am glad we pulled the trigger. Cooking on this grill is amazing. From smoking, regular grilling to cooking pizzas, it is a really diverse cooking system. I haven't touched our gas grill since buying this in June 2016. \n\nThere was a defect with the inside firebox where the ceramic cracked. I contacted Kamado Joe for a warranty claim and they are currently sending me a new piece no charge.",
            "author": "Neil McMullin",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Amazing value\"",
            "rating": 5,
            "date": "07/02/2018",
            "recommended": true,
            "text": "Would have preferred some of the features in the updated version of the Classic, but at the discounted price of $1k, this was too good to pass up especially with KJ's warranty. After opening, I found out that the updated firebox was already included in this older version. All other features (hinge, gasket, top vent) are still the older version)",
            "author": "KEVlN",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Grill\"",
            "rating": 5,
            "date": "06/10/2019",
            "recommended": null,
            "text": "This grill works better than you can imagine. I have had a Vision grill for years trying to deal with heat control issues and I can honestly say this grill is light years ahead in terms of quality and useability. Don't let anyone fool you there is a huge difference in quality and features treat yourself and buy the best first get a Kamado Joe.",
            "author": "Grill pro",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Kamado KJ23 Classic Joe\"",
            "rating": 5,
            "date": "08/05/2018",
            "recommended": true,
            "text": "I love these types of grills.   There is a learning curve to them but will never go back to gas.   My family love the food that I can cook with the Kamado Joe Classic.   There are a lot of recipes that can also be found online.   I was happy that the one I bought had the updated firebox.",
            "author": "Bearcat",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/05/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Larry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/10/2019",
            "recommended": true,
            "text": "It's a difference maker! Easy to control the temp, great accessories, and the best grill I have owned. Just smoked some pork loin and brisket to perfection.",
            "author": "jjoel",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great lower priced “green egg”\"",
            "rating": 5,
            "date": "04/28/2019",
            "recommended": true,
            "text": "Works just as good as the green egg at 1/2 the cost. Can't go wrong with this one",
            "author": "MC",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/06/2019",
            "recommended": true,
            "text": "Great grill that will last a lifetime. Holds heat in extremely well. Easy to use",
            "author": "Daniel",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Futures\"",
            "rating": 5,
            "date": "06/05/2019",
            "recommended": false,
            "text": "I bought this BBK and I am very happy with it.  I recommended.",
            "author": "Lisanias",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great grill\"",
            "rating": 5,
            "date": "06/22/2019",
            "recommended": true,
            "text": "i like my drill. its awesome. Temperature control is great",
            "author": "MIKEY",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/25/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Guido",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/28/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Me",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Aj",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/30/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Stephan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/12/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Farley",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/22/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Ed",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jay",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        }
    ],
    "reviewStats": {
        "reviewCount": 40,
        "percentRecommended": "87",
        "averageStars": "4.9",
        "starCounts": {
            "five": 38,
            "four": 1,
            "three": 0,
            "two": 0,
            "one": 1
        }
    },
    "questions": [
        {
            "question": "\"Does this model have the air lift hinge and wire mesh fiberglass gasket like the newer version?\"",
            "author": "Anonymous",
            "date": "02/04/2019",
            "answers": [
                {
                    "author": "Grillman",
                    "date": "06/18/2019",
                    "text": "No it does not. That is the difference in price. I just looked at them at my local Lowe's. The wire mesh gasket will obviously work better and last longer (it's just like the gasket on your oven door) and I like the latch, but not sure I want to pay $400 more for it.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "02/22/2019",
                    "text": "Yes, this model has an air lift hinge and a wire mesh fiberglass gasket.",
                    "helpful": {
                        "yes": 22,
                        "no": 8
                    }
                },
                {
                    "author": "DT",
                    "date": "02/12/2019",
                    "text": "No",
                    "helpful": {
                        "yes": 8,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"What's the difference between this grill and the $1199 model?\"",
            "author": "Anonymous",
            "date": "03/04/2019",
            "answers": [
                {
                    "author": "Rob",
                    "date": "05/29/2019",
                    "text": "This grill has the new firebox.",
                    "helpful": {
                        "yes": 5,
                        "no": 1
                    }
                },
                {
                    "author": "Chris",
                    "date": "03/27/2019",
                    "text": "The Classic ii comes with a new air lift hinge, smoke box top is designed better, firebox inside is different, and the latch and gasket are new.",
                    "helpful": {
                        "yes": 12,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"Is Lowes an authorized dealer for Kamado Joe? You do not come up on the Kamado Joe website?\"",
            "author": "Anonymous",
            "date": "05/06/2019",
            "answers": [
                {
                    "author": "Blake",
                    "date": "06/26/2019",
                    "text": "I too had the same question and reached out to Kamado Joe. The answer is yes.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Does this grill come with a cover?\"",
            "author": "Anonymous",
            "date": "04/02/2019",
            "answers": [
                {
                    "author": "CommunityAnswer",
                    "date": "04/09/2019",
                    "text": "No, this grill does not come with a cover.",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"does the ash tray come with it?\"",
            "author": "Anonymous",
            "date": "03/26/2019",
            "answers": [
                {
                    "author": "CommunityAnswer",
                    "date": "03/26/2019",
                    "text": "Yes, the ash tray comes with this product.",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Did this grill come with heat deflectors?\"",
            "author": "Anonymous",
            "date": "02/13/2019",
            "answers": [
                {
                    "author": "CommunityAnswer",
                    "date": "03/11/2019",
                    "text": "No, this grill does not come with heat deflectors.",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"i work at a Lowe's store in Beech Grove Indiana and the picture advertisement for our Kamado Joe has a rain guard on the top, is that available\"",
            "author": "Anonymous",
            "date": "02/07/2019",
            "answers": [
                {
                    "author": "DT",
                    "date": "02/12/2019",
                    "text": "That's a Classic II. Those have the “Kontrol Tower” which is what you're talking about. The Classic I has the cast iron daisy wheel.",
                    "helpful": {
                        "yes": 6,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"assembly is included ?\"",
            "author": "Anonymous",
            "date": "01/28/2019",
            "answers": [
                {
                    "author": "CommunityAnswer",
                    "date": "03/11/2019",
                    "text": "Yes, this product requires assembly.",
                    "helpful": {
                        "yes": 1,
                        "no": 8
                    }
                }
            ]
        },
        {
            "question": "\"Is this a classic or a classic ii\"",
            "author": "Anonymous",
            "date": "01/01/2019",
            "answers": [
                {
                    "author": "iBob",
                    "date": "01/11/2019",
                    "text": "Classic",
                    "helpful": {
                        "yes": 9,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"So is the $400 difference worth it between the 18\" and the 18.75\" models??? what makes the difference in price?\"",
            "author": "Anonymous",
            "date": "07/07/2019"
        }
    ]
}