{
    "descriptions": {
        "overview": "Looking for a high efficiency, high performance toilet. Look no further. The Jacuzzi Primo, one piece, dual flush toilet features an elongated bowl for added room and comfortable use. One key aspect you will be sure to love is the soft close seat function. No more unpleasant bangs when the seat falls. Along with improving noise level, a slight tap on the lid to close improves hygiene. It combines versatile design with efficient performance.",
        "list": [
            "1-piece configuration, Primo collection with soft close lid and dual flush",
            "Exceeds industry standards for flushing performance and high efficiency with easily accessible top mount button with 1.1 gallons per flush to save water or 1.6 gallons per flush for powerful waste removal",
            "Comfortable elongated",
            "Offers a safe and comfortable alternative for individuals with disabilities or limited mobility",
            "WaterSense certified helping you save water and money without sacrificing performance",
            "Perfect balance of elegance and functionality with quietly closing seat",
            "Complete kit includes seat, bolt caps, tank, bowl and wax ring",
            "ADA compliant",
            "Easy installation and 100 percent factory flush tested"
        ]
    },
    "specs": [
        {
            "title": "Type",
            "spec": "1-piece"
        },
        {
            "title": "Toilet Kit",
            "spec": 1
        },
        {
            "title": "Collection Name",
            "spec": "Primo"
        },
        {
            "title": "Bowl Height",
            "spec": "Chair height"
        },
        {
            "title": "Bowl Height with Seat",
            "spec": "17-in"
        },
        {
            "title": "Bowl Height without Seat",
            "spec": "16-1/2-in"
        },
        {
            "title": "ADA Compliant",
            "spec": 1
        },
        {
            "title": "High Efficiency",
            "spec": 1
        },
        {
            "title": "Warranty",
            "spec": "5-year limited"
        },
        {
            "title": "Rough-In Size",
            "spec": "12-in"
        },
        {
            "title": "Color/Finish Family",
            "spec": "White"
        },
        {
            "title": "Lined Tank",
            "spec": 0
        },
        {
            "title": "Flush Lever Location",
            "spec": "Top center"
        },
        {
            "title": "Assembled Depth (Inches)",
            "spec": "28.19"
        },
        {
            "title": "Assembled Width (Inches)",
            "spec": "17.32"
        },
        {
            "title": "Assembled Height (Inches)",
            "spec": "31.3"
        },
        {
            "title": "Assembled Weight (lbs.)",
            "spec": "76.3"
        },
        {
            "title": "WaterSense Labeled",
            "spec": 1
        },
        {
            "title": "Flush Type",
            "spec": "Dual"
        },
        {
            "title": "Lowe's Exclusive",
            "spec": 1
        },
        {
            "title": "Deodorizing",
            "spec": 0
        },
        {
            "title": "Night Light",
            "spec": 0
        },
        {
            "title": "Remote Control",
            "spec": 0
        },
        {
            "title": "Manufacturer Color/Finish",
            "spec": "White"
        },
        {
            "title": "Flush Lever Included",
            "spec": 1
        },
        {
            "title": "Maximum Flush Rate",
            "spec": "1.6 GPF (6.06 LPF)"
        },
        {
            "title": "Portable",
            "spec": 0
        },
        {
            "title": "Gallons Per Flush",
            "spec": "1.6"
        },
        {
            "title": "Trapway Size",
            "spec": "2-in"
        },
        {
            "title": "UNSPSC",
            "spec": "30181500"
        },
        {
            "title": "Hardware Color Family",
            "spec": "Chrome"
        },
        {
            "title": "Bowl Shape",
            "spec": "Elongated"
        },
        {
            "title": "Installation Type",
            "spec": "Floor mounted"
        },
        {
            "title": "Outlet Location",
            "spec": "Floor outlet"
        },
        {
            "title": "Hardware Finish",
            "spec": "Gloss"
        },
        {
            "title": "Flush Technology",
            "spec": "Gravity fed"
        },
        {
            "title": "Bidet Function",
            "spec": 0
        },
        {
            "title": "Corner Installation",
            "spec": 0
        },
        {
            "title": "Heated Seat",
            "spec": 0
        },
        {
            "title": "Rimless",
            "spec": 0
        },
        {
            "title": "Self-Cleaning",
            "spec": 0
        },
        {
            "title": "Skirted",
            "spec": 0
        },
        {
            "title": "Supply Lines Included",
            "spec": 0
        },
        {
            "title": "Material",
            "spec": "Vitreous china"
        },
        {
            "title": "Mounting Bolts Included",
            "spec": 1
        },
        {
            "title": "Rubber Bumpers Included",
            "spec": 1
        },
        {
            "title": "Seat Included",
            "spec": 1
        },
        {
            "title": "Seat Secure",
            "spec": 1
        },
        {
            "title": "Slow Close Feature",
            "spec": 1
        },
        {
            "title": "Wax Ring Included",
            "spec": 1
        }
    ],
    "reviews": [
        {
            "images": [
                {
                    "smallName": "1a374b16-39bd-5621-97af-495bfc3636bb",
                    "largeName": "86e978c0-4606-5786-b82a-da4782e9ae58"
                },
                {
                    "smallName": "61f6034f-0178-54b9-b3fd-6e8cc4009d0d",
                    "largeName": "5bf1d986-c9c7-5ed1-9282-db6716ded608"
                }
            ],
            "title": "\"Ok product but terrrible customer support\"",
            "rating": 2,
            "date": "10/20/2017",
            "recommended": false,
            "text": "Purchased recently. Installed with not problem. Full flush was a little light and had increase tank level to correct. Difficult in that they do not provide instructions on how to adjust and had to go to YouTube to determine the process. I did receive the top with a scratch imbedded under the coating. I am on day 4 awaiting resolution from the company with no follow up communication from their customer support team. Would rate a 3 or 4 if only rating the toilet, but customer support has not been sufficient to date. Will update ratings/notes/recommendation later once I know if they will stand behind their product. I have purchased a Kohler toilet before and ranked it 4.5 stars but it was double the price of this unit.",
            "author": "JP",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 58,
                "no": 11
            }
        },
        {
            "images": [
                {
                    "smallName": "716e47d4-25e7-565d-b05c-243d2e70083f",
                    "largeName": "19a19d1b-cad9-59ad-800a-34ad503c3921"
                }
            ],
            "title": "\"Good product with poor instructions\"",
            "rating": 4,
            "date": "03/30/2019",
            "recommended": true,
            "text": "It's been installed for 10 days and the family is very happy with it. It looks good and has a powerful flush. The low price at Lowes is hard to beat. However, the instructions for the Floor-to-Bowl Fastening Kit were incorrect, causing a delay while installing. Specifically, the \"Beveled Disc\" is not shown in the instructions. A phone call to Jacuzzi help line provided prompt answers and they agreed that the instructions are not correct. Also, the package was missing 2 Flat Washers. Fortunately I had some in my shop, avoiding an extra trip to Lowes. I rate the toilet 5, and the instructions 3.",
            "author": "Doug4500",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 16,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "3a007e8a-fc8b-5f0b-8a46-8e1f6d0e370f",
                    "largeName": "6ccec30e-0088-5949-8b59-6e46136f4783"
                },
                {
                    "smallName": "cd4609c2-6efe-500f-bfc2-42ba37160f34",
                    "largeName": "6e98a14e-fd2c-5f14-8e29-f083a8038e27"
                }
            ],
            "title": "\"this is the one\"",
            "rating": 5,
            "date": "06/11/2018",
            "recommended": true,
            "text": "As far as toilets go, this is a great one.  We have two of them now in our newly remodeled bathrooms.  We picked this one based on brand, other reviews and look and it didn't disappoint.  The dual flush is great as well as the quiet closing lid.",
            "author": "Maria",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 10,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "b9b28e58-809b-51a3-9a6a-dbc40086e0db",
                    "largeName": "e68b82f1-329a-5138-a94c-2daf5d5356dd"
                },
                {
                    "smallName": "70856343-5b05-589b-8568-e4e66c9b3ca5",
                    "largeName": "357b2847-fdf1-5479-9154-1bd01a044a7f"
                }
            ],
            "title": "\"Jacuzzi toilet\"",
            "rating": 4,
            "date": "09/13/2017",
            "recommended": true,
            "text": "Flush has good force. I don't really see a difference between the large button and Small button flush. Appears to be the same amount of water being flushed. Seat is not contouring to the body. I'm happy with the purchase overall",
            "author": "Baar",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 57,
                "no": 16
            }
        },
        {
            "images": [
                {
                    "smallName": "6f8923b8-71b0-5ca0-93bc-0b1c68af22cb",
                    "largeName": "c8b2732d-b037-5df6-8969-9ea119f461d5"
                }
            ],
            "title": "\"A new throne, in which to do my business\"",
            "rating": 5,
            "date": "02/20/2019",
            "recommended": true,
            "text": "I installed this bad-boy last night and let me tell you what... I've never been more impressed with a single piece of porcelain in my life. The aesthetically pleasing curves of the unit make for an easy wipe down after dropping the dirtiest of deeds into the the depths of it's deep, quick flushing bowl. Installation was a breeze, I opened up the box, the toilet strutted to my old clunker, knocked him out like Clubber Lang in Rocky III and took its place over the exit hole from my bathroom... but seriously, it only took like 20 minutes to drop it in place. All of the parts were present, and the instructions were in plain English.Upon a successful installation, I gave it a few rigorous tests ranging from the stand up and pee, to a full on-taco night surprise, and it flushed it all down like a pro. 5 stars, great work, great design... buy one, you won't regret it!",
            "author": "Joe",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 26,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"This Model Doesn't Work\"",
            "rating": 1,
            "date": "10/09/2018",
            "recommended": false,
            "text": "I just moved into my home and was overly excited to be a first time home owner. I purchase two (2) Jacuzzi Primo White Water Sense Toilets and I am extremely upset that in 2 months I've been experiencing problems with flushing both toilets. I called a local plumber and just discovered that since the toilet is water sense and the pressure is low it has a \"sluggish flush\". He also left me a $230.00 bill which is more than the toilet itself. I am beyond frustrated and understand that there isn't a \"WARANTY ON TOILETS\" offered from Lowe's. I have to now chase the manufacturer and make calls during my lunch break at work...MY LIFE :(",
            "author": "Meme",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 28,
                "no": 7
            }
        },
        {
            "images": [],
            "title": "\"No Directions Included but Beautiful Toilet\"",
            "rating": 4,
            "date": "09/03/2017",
            "recommended": true,
            "text": "So, good first...beautiful toilet, dual flush, nice and quiet. Bad now...no directions were included and the ones we pulled up on line, didn't quite match the pieces and parts which were in the box. My friend finally got it put together but it was a complete pain and I'm not sure if it's 100% correct. Fingers crossed.  However, seriously good looking toilet. And even though it's elongated, sits closer to the wall than my old one so it take up less space in the bathroom. I really, really like it esthetically speaking but directions (which match the parts included) need to be included in the box!",
            "author": "Hilary",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 117,
                "no": 14
            }
        },
        {
            "images": [
                {
                    "smallName": "e5d3326b-a01a-5bd3-839c-44d44cc7a4a9",
                    "largeName": "6a5805a3-cada-52d6-8b7d-9b251ebcc79f"
                }
            ],
            "title": "\"Toilet\"",
            "rating": 5,
            "date": "10/30/2017",
            "recommended": true,
            "text": "i did an upgrade in my bathroom to this toilet, and im so pleased with my choice. love the buttons feature. and its very silent.",
            "author": "Awi",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 94,
                "no": 4
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo Dual Flush WITH SLOW CLOSE LID!!\"",
            "rating": 4,
            "date": "09/20/2017",
            "recommended": true,
            "text": "We ordered two of these and two slow close lids, as it is not in the description that they come with them!  I read the reviews AFTER we purchased the separate seats and saw that the company said they do come with them.  SO, I asked also!  We received the toilets.  It is not written on the box or in the description, and they did not have one on the floor.  The clerk said it did not come with them, so took it home, and they both had them!  Very sleek and quite and I think will be easy to keep clean with it being one unit!  So far (one week) we like them both very much!!  We would definitely recommend them to anyone and we encourage Jacuzzi, to add the slow close lid information to their description AND on the box!!  Thanks!",
            "author": "4oregonz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 294,
                "no": 27
            }
        },
        {
            "images": [
                {
                    "smallName": "56612dad-ee61-5872-b549-4caa1f451579",
                    "largeName": "7ec227ca-9459-59f3-b512-3b6c752b0790"
                },
                {
                    "smallName": "aa94b808-c6a4-5a3c-8ffd-947b8db88aca",
                    "largeName": "52ed61bf-2b5f-5053-8711-9f66258838c1"
                }
            ],
            "title": "\"Had all the features  and more\"",
            "rating": 5,
            "date": "06/05/2019",
            "recommended": true,
            "text": "This toilet had all the features I was looking for. One piece, elongated, comfort height and water saver. Wasn't willing to compromise on any of it so this Jacuzzi brand was the absolute choice. Like that it was affordable.My plumber installed it with ease and confirmed that Jacuzzi puts out a great product. I did have it delivered so not crazy about that $65 fee but those delivery guys were great as they noticed it was cracked and automatically alerted Lowe's for re-delivery. Took an extra week but rather have waited than to find out when my plumber was there, would have cost me a whole lot more.  Also bought a new vanity from Lowe's so my bathroom is now refreshed, renewed, modern and stylish. All very affordable and beautiful. Love the dual flush feature too...was not expecting that!",
            "author": "Abby",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"great toilet, comparable to Toto Ultramax\"",
            "rating": 5,
            "date": "12/04/2017",
            "recommended": true,
            "text": "Great, easy to install toilet that looks terrific and flushes cleanly and efficiently. Small flush is 1.1 gals., big flush is 1.6 gals. It comes with a wax ring, floor mounting bolts and the toilet seat. The toilet seat has soft rubber gaskets at the mounting bolts so the seat will not slip around. The filling and flushing mechanisms in the tank are fully assembled and ready to go--just put the tank cover on. On top of it all, this toilet is relatively light at 93 lbs. and not so much of a struggle to move into place for installation.",
            "author": "AC",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 180,
                "no": 17
            }
        },
        {
            "images": [
                {
                    "smallName": "07319220-31e4-5f7b-b4fd-3aadf6f06954",
                    "largeName": "c13522ec-c5af-5d18-85af-6311ef87bcf3"
                }
            ],
            "title": "\"Do not buy!!! -  Does not flush solid waste\"",
            "rating": 1,
            "date": "03/16/2018",
            "recommended": false,
            "text": "Do not buy!!! - does not flush solid waste - contacted Lowe's, no adjustments to improve - I bought assuming Jacuzzi name would be quality.  Do not buy this item, now I need remove and replace.  Real cost is labor.  Please do not buy this product!!!! :(Looks nice, too bad it does not work.",
            "author": "Paul-phx",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 54,
                "no": 18
            }
        },
        {
            "images": [],
            "title": "\"Does not accommodate bidet.\"",
            "rating": 2,
            "date": "11/15/2018",
            "recommended": false,
            "text": "I recently purchased 3 of these at Lowe's and had it installed after my bathroom flooring was done.   I had several toilets in the past and ALL of them I was able to connect an inexpensive bidet such as https://www.costco.com/Bio-Bidet-Elite-3.product.100015777.html BUT this toilet does not fit the usual universal inexpensive bidet and I'm very disappointed.  Bidet is a must in our household... I should have done my research first before I purchased this.  There reason it won't fit is because of the \"curved\" style of this \"euro style\".  If anyone knows of any bidet that fits on this toilet please share.",
            "author": "Trez",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 9,
                "no": 2
            }
        },
        {
            "images": [
                {
                    "smallName": "802da848-f835-5846-9011-19c5f7efa95a",
                    "largeName": "cd88f20c-f161-5396-b0f3-3b2447ac7b18"
                }
            ],
            "title": "\"All women need this toilet\"",
            "rating": 5,
            "date": "09/11/2018",
            "recommended": true,
            "text": "Where do I start. I love this toilet. Its very easy to clean and flushes great. But the best part is.... if you live with a man. This toilet will guarantee that the lid gets shut. You actually have to move the lid back down a bit to flush and just with that little movement the lid will then close on its own. Its magically.  I don't think it was designed to be that way but ill take it being I live with 3 boys. I love the 2 option of flushes. They both work great. I really have nothing bad to say but if you are reading this and you are super ocd about cleaning... this toilet doesnt allow for you to clean under the the lid caps. I don't know if its a new thing or an old school thing but a lot of the toilets I have had in the past... I was able to pop the side tabs up and clean under them (and they were usually funky).... but maybe the fact this doesn't pop open means mess cant get under it..which means less cleaning. It isn't something that bothers me but i thought I would add that in. I love reviews that give specifics about the product. You can't  beat this price either. We have a small bathroo. Thid went un and it fit perfectly.",
            "author": "Amanda",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 7,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Almost 5 stars....\"",
            "rating": 4,
            "date": "03/04/2019",
            "recommended": true,
            "text": "So we were replacing the flooring in all of your non-carpeted areas and said, why not replace the toilets!!! Ours were 20 years old and I was tired of rebuilding them. We found these and they have been in use for about 2 weeks now. My wife said we should wait before posting, smart lady. So we can't attest to their durability but I can say they are great in all other respects except these are a bit louder than we would have liked. Otherwise the look and ability to remove waste has been excellent so far. I will try to remember to come back after a bit of time has passed to update. Well worth the money and I would buy these again and have recommended them to friends and family.",
            "author": "Paul",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "f1eac403-975f-5ae9-89b5-cea1a375e1f1",
                    "largeName": "1023d87b-6818-57f9-964b-d1b88ff7963a"
                }
            ],
            "title": "\"Great looks, easy install\"",
            "rating": 5,
            "date": "09/12/2018",
            "recommended": true,
            "text": "Just installed so can't speak to functionality of this product, but it was the easiest install ever! Only 2 screw holes, lining up with the existing floor flange bolts (NO drilling through new floor tile or other flooring). Tank components and tank lid come already completely assembled; and being 1 piece, no assembly needed between separate tank and bowl). No surprises! I was putting down a new tile floor (replacing vinyl sheet floor) so took the opportunity to install this new toilet. Also installed a stylish Jacuzzi sink (see photo). With the slightly increased floor height, I used the wax ring included with the toilet plus an additional standard wax ring; that was a bit too high so I smushed down the extra ring a bit and flattened it out some. The included ring has an attached flange that went down into the waste pipe some and stayed in place well. Also had to buy some longer toilet bolts. Special ordered the toilet through Lowe's and order was filled and waiting for pickup in very little time.  As far as aesthetics, it looks sleek and clean. Considering everything you need is included (even the seat), I think this was a great value for the price. Very happy. [installed by a fairly handy 62-yr-old woman]",
            "author": "RabbitQueen",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 6,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Major design flaws with bowl shape\"",
            "rating": 1,
            "date": "02/11/2018",
            "recommended": false,
            "text": "We purchased four of these toilets seven months ago for a family of three. Already two of them have permanent staining at the waterline I'm sure if I scrub for half an hour I can get it white again but with high-quality porcelain products I shouldn't have to. These also have a major design flaw in the bowl shape to where the excrement gets stuck and does not flush even after repeated flashes.  I do love the designer look but the flushing power and the bowl shape flaw makes this a product that I recommend you avoid.",
            "author": "Fred",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 113,
                "no": 29
            }
        },
        {
            "images": [],
            "title": "\"Fastest toilet ever owned\"",
            "rating": 5,
            "date": "02/25/2018",
            "recommended": true,
            "text": "2 selects on flush button, one for liquid other for solid. Easy to install. Taller height is long over due and a smart purchase. No more water swirling around, this thing means business. Flush and it's gone!Plus I'm a veteran and Lowe's gives me 10% off. I buy everything from Lowe's now. Goodbye Home Depot.",
            "author": "Dan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 104,
                "no": 7
            }
        },
        {
            "images": [],
            "title": "\"Great Value !!!\"",
            "rating": 5,
            "date": "02/02/2018",
            "recommended": false,
            "text": "I bought this toilet for my wife's bathroom. She absolutely LOVES it. It has an updated style, its solid, and it's quite on both flushes and refilling. It's a little taller than a standard toilet, which she loves, and takes up less space. For me, it couldn't have been any easier to install.One piece. All pre-assembled, just set it on the wax ring and bolt down.great product at a great price.",
            "author": "kinghaus",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 46,
                "no": 4
            }
        },
        {
            "images": [],
            "title": "\"Great Product\"",
            "rating": 5,
            "date": "09/03/2017",
            "recommended": true,
            "text": "I'm a 5'1 female and apparently my \"load\" rivals that of an over 6' tall man.  (See earlier review)  ha ha   Joking aside, we liked this toilet well enough that we went out and bought a second one for our other bathroom.  Occasionally requires a second flush, but overall a great purchase.  Love the design and is super easy to install, all parts are included.",
            "author": "Kel",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 119,
                "no": 14
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Toilet\"",
            "rating": 5,
            "date": "02/27/2018",
            "recommended": true,
            "text": "One piece Jacuzzi dual flush toilet. Installed a week ago and works just fine. Flushes well no clogging up. 1.1 and 1.6 gal flushes. Watched You Tube videos and got a good tip about the wax ring. A 30 year plumber suggested to remove the plastic funnel attached to the wax ring. The funnel reduces the drain hole from 3” to about 2”. I think this helps for better drainage. Installed Feb 2018.",
            "author": "Hal",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 36,
                "no": 3
            }
        },
        {
            "images": [],
            "title": "\"Great toilet\"",
            "rating": 5,
            "date": "02/12/2018",
            "recommended": true,
            "text": "We had a Kohler Santa Rosa installed almost a year ago (we are very happy with it) and wanted two more toilets replaced last month. In checking our options, we found this Jacuzzi at Lowe's. We were initially a bit concerned since reviews of other Jacuzzi models (on other sites) were mediocre, and several problems seemed to be a recurring theme. But this model had glowing reviews, so we went ahead and bought two. We couldn't be happier, and in fact marginally prefer them to the Kohler. It is virtually the same style, but with the option of dual flush, and has a soft-close seat and wax ring included. Easy to install, and have had zero problems with the water-saving flushes. And best of all, it is/was less expensive. Who knows what will happen in 5 or 10 years with potential repairs, and dealing with customer service? But for now, I'm extremely happy with the purchase!",
            "author": "mridr",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 51,
                "no": 7
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo Toilet\"",
            "rating": 4,
            "date": "06/28/2018",
            "recommended": true,
            "text": "The unit is very attractive and because it's a single system (tank & base cased together), we have confidence that no leaks will occur. The only downside is that the amount of flush water is insufficient to rinse the bowl everytime, and that the residual water after flush is low allowing waste to adhere/stick to bowl - flush usually is not adequate to fully cleanse the bowl. Thus, a bowl brush to keep the bowl cleaned is an essential accessory for this toilet.",
            "author": "Gary",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 10,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"THIS IS THE ONE!\"",
            "rating": 5,
            "date": "08/24/2017",
            "recommended": true,
            "text": "Not only does this toilet have that sleek Euro look, it is extremely efficient and so much easier to keep clean.  I totally recommend it.  I love it so much, I had to have one for each of my bathrooms!",
            "author": "Liz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 218,
                "no": 19
            }
        },
        {
            "images": [],
            "title": "\"Don't buy this toilet.\"",
            "rating": 1,
            "date": "08/29/2018",
            "recommended": false,
            "text": "I bought 2 toilets for my 2 bathrooms remodel project as I loved the sleek shape and the water-saving flush. However, there is a design flaw  in the bowl shape and no.2 gets stuck, plus the flushing power is not enough even after repeated flushes. If I use a plunger, there is still a gurgle for days as soon as I flush. I wish I had kept my old toilets as now I have spent a lot of money on the remodeling and have non-functional toilets.",
            "author": "ada",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 33,
                "no": 5
            }
        },
        {
            "images": [],
            "title": "\"This will be a best seller at Lowe's\"",
            "rating": 5,
            "date": "08/25/2017",
            "recommended": true,
            "text": "Very impressed with the quiet flush low or high. Does an excellent job.",
            "author": "g",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 226,
                "no": 17
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Toilet\"",
            "rating": 4,
            "date": "02/18/2018",
            "recommended": true,
            "text": "Toilet is great. Very well made. Installed fine right out of the box. Gave it 4 stars as the instructions in a few places weren't exactly as the parts furnished. Slow close lid is cool. Flick it down and walk away. Seat bolt attachment nuts (plastic) could be a bit more robust. All in all a very nice fixture. Flushing works well.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 23,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Good Product\"",
            "rating": 5,
            "date": "02/12/2018",
            "recommended": true,
            "text": "So glad we upgraded our standard size toilet to this chair height one. This product was easy to install. Everything thing was included.  However, we did buy a thicker wax ring.  The unit is quite,the flush is quick and efficient, and the easy close lid is a great feature. Love that it's a one piece unit. Would recommend the product.",
            "author": "Laura",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 35,
                "no": 3
            }
        },
        {
            "images": [],
            "title": "\"Sitting Pretty\"",
            "rating": 4,
            "date": "01/06/2018",
            "recommended": true,
            "text": "Just installed this morning.  Easy install, took about 30 minutes, including the removal of the existing toilet.  Perfect height, and optional flush..great.  Only negative is the plastic seat, but even that is pretty good, for plastic.  Overall, pretty darned good.",
            "author": "Buckshot",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 32,
                "no": 2
            }
        },
        {
            "images": [],
            "title": "\"Awesome toilet!!!\"",
            "rating": 5,
            "date": "09/25/2017",
            "recommended": true,
            "text": "This product is not only affordable but is incredibly easy to install and works perfectly! It's very powerful while being quiet. I highly recommend.",
            "author": "Ploehn120",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 120,
                "no": 12
            }
        },
        {
            "images": [
                {
                    "smallName": "02d2346e-dccf-53b2-b0c0-7029fcbd25e5",
                    "largeName": "dde40d88-56b1-5c20-b03a-a5173be94c79"
                }
            ],
            "title": "\"Primo jacuzzi\"",
            "rating": 5,
            "date": "06/09/2019",
            "recommended": true,
            "text": "What a difference this toilet has made.  I've had a hip replacement and I have bad knees.  Makes the bend in my knees much more pleasant than a lower toilet.",
            "author": "Bowen",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great looking and functioning toilet.\"",
            "rating": 5,
            "date": "03/02/2018",
            "recommended": true,
            "text": "After thorough research, I settled for this toilet. It offered all my requirements and I was very happy with the price. It is functioning wonderfully, very quiet, has a sleek look and should pretty much fit any decor. We had it professionally installed, since we're not the handy-type folks. All went smooth. Highly recommend this Lowe's product. Probably will by two more to replace older models.",
            "author": "MountainGirl",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 20,
                "no": 2
            }
        },
        {
            "images": [],
            "title": "\"Amazing TOILET!!!!\"",
            "rating": 5,
            "date": "04/17/2018",
            "recommended": true,
            "text": "Bought and installed this in my beach condo last weekend. It is the coolest looking best functioning toilet I have ever seen,,,,and I am old. Super easy to install and everyone who sees it loves the look. Flushes ANYTHING! I am buying three more for my house. Quiet and uses very little water. It is just GREAT! The service at my local Allentown, PA Lowe's was also incrediable. The sales associate really made  my instal a breeze.",
            "author": "Ronnie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 11,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Does not flush all the waste\"",
            "rating": 1,
            "date": "01/11/2019",
            "recommended": false,
            "text": "Bought this based on the good reviews and the brand name. I should have paid more attention to the 1 star reviews as I have the same issues with the flush. I too agree that the bowl shape has a lot to do with the flushing issues. I've already recommended to my daughter-in-law that she not buy this toilet. The design and duel flush are great but flushing is terrible.",
            "author": "Dan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 8,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "c24b9514-0c43-5b80-a566-cb3cffd73125",
                    "largeName": "e0c50f50-b71f-56d8-b7b2-e63c9468098f"
                }
            ],
            "title": "\"Nice toilet\"",
            "rating": 5,
            "date": "04/16/2019",
            "recommended": true,
            "text": "I have 2 of these, they are very nice.  I like the half/full flush option, the blended tank into the seat makes cleaning easy, the flush is quiet and it refills quick",
            "author": "kaz",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Nice Toilet\"",
            "rating": 4,
            "date": "06/05/2019",
            "recommended": true,
            "text": "Once I over came the frustrating 4 days not following the advice of the manual  it takes 2 to install and  I agree but got it done without help.Finally installed my first  thought it wasn't going to work after seeing the lower  water  levels and the dry test  flush all  much different than my old standard water guzzler .To be fair to Primo a true real test flush had to be given to convinced me I made a good choice ,I did.Its like a turbo one flush all done in less time and surprisingly less water .So why not 5 stars replacing parts for the buttons top flushing not the handle in which for two weeks I been reaching for thinking of the handle on the old toilet.Yes I not only recommend I'll brag how I installed it all by myself.",
            "author": "Al",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Recommend\"",
            "rating": 5,
            "date": "02/16/2019",
            "recommended": true,
            "text": "After living with this toilet for a week, I can highly recommend. It looks nice and is well made and works well. The full flush can evacuate a large load of fecal material and the half flush has no issues either. The occasional slight skid mark may occur, but that is no different from other toilets and just tells you you need more fiber in your diet. My only complaint is the installation instructions had inaccurate drawings and descriptions of the different washers and where they go. There is no description of how to adjust the flush levels anywhere. The toilet is completely assembled except for the seat and comes with WC bolts, seat, and a wax ring. Keep in mind that the grey plastic washer goes on top of the flange. The metal washer and white plastic disc (packaged with seat) goes on top of the toilet base.",
            "author": "J-man",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 4,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great buy\"",
            "rating": 5,
            "date": "01/13/2018",
            "recommended": true,
            "text": "Just got installed today looks great,  and works great, easy to install, came within with everything,",
            "author": "Derwood",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 10,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Good toilet but the instructions are garbage\"",
            "rating": 3,
            "date": "05/16/2019",
            "recommended": false,
            "text": "I installed a Jacuzzi toilet about 10 years ago and was very happy with it. While redoing my flooring I pulled the last two original toilets and bought two more Jacuzzi toilets from Loewes. I've installed my share of toilets over the years, but the instructions on these were terrible. They refer to standard nuts as lock nuts and standard washers as lock washers. They package the beveled discs for the floor bolt covers with the seat and skip over their mention in the instructions. The nuts are 11mm while the instructions say they are 10mm. The floater needs to be hooked up in the tank but you get no instructions on how to do this. It all ends with installing the seat.",
            "author": "MikeS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "images": [],
            "title": "\"Push button pleasure\"",
            "rating": 5,
            "date": "02/24/2018",
            "recommended": true,
            "text": "Love the height , wife loves the stylish design .i like the top push button flushing system GREAT and it's quite when it flushes and refills quickly . Going to replace the other “old style “ with gnus one for the my guest bathroom.",
            "author": "Tdr",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 12,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Toilet\"",
            "rating": 4,
            "date": "05/19/2018",
            "recommended": false,
            "text": "It looks great and is very quiet, easy to clean but doesn't always flush completely, leaving some mess needing to be flushed again.  One big thing is it isn't made in the USA. Try China.  Found the same design at Costco for $40.00 dollars less but different name on the box.  Both work the same just not the same name.  They both give the redecorated bathrooms a modern look and do what is needed for the job.",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Saves water\"",
            "rating": 5,
            "date": "09/11/2018",
            "recommended": true,
            "text": "I bought this because my old toilet was using a lot of gallons per flush, and also had a leak from the tank that I could not seal.  I found this with a 1-piece design that makes leaks impossible, and it's great.  Choice of flushes, and the seat lowers itself.  I plan to replace two other toilets in my house with this one.",
            "author": "Jennifer",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"One Piece Toilet\"",
            "rating": 5,
            "date": "05/01/2018",
            "recommended": true,
            "text": "Wow! Easy install! Two bolts! Beautiful, quiet, dual. It's extremely heavy so if you are a woman trying to do this on your own you need another set of hands to help you lift the toilet. It's very easy to install once it's on the bowls with the wax seal. I'm going to be purchasing tomorrow. I have installed about 10 toilets in my lifetime and this was by far the easiest.  Why would you want a two-piece toilet when a one piece is less bolts to worry about leakage?",
            "author": "Barb",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "",
            "rating": 5,
            "date": "01/13/2018",
            "recommended": true,
            "text": "Looks great works great and really easy to install",
            "author": "Jp",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 7,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo Chair Height 1-piece Toilet\"",
            "rating": 5,
            "date": "03/23/2018",
            "recommended": true,
            "text": "It seems a little strange to be excited about a toilet, but we were really impressed with this one. Went in easily and works great. I will be replacing our other one with one just like it. The one piece design makes it really easy to clean. This is a great product. Very happy with my purchase.",
            "author": "Johnny",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "0de37cff-134b-56cc-b9d5-b7d61f356d02",
                    "largeName": "7e10e867-55b9-556f-9ac4-7896c8d2e8f0"
                }
            ],
            "title": "\"Very nice\"",
            "rating": 5,
            "date": "08/05/2018",
            "recommended": true,
            "text": "I really like this one piece toilet. It installed nicely, and works well. It has two types of flushes and a very nice toilet seat. We got this toilet for a small space and it works nicely.",
            "author": "Pamelove",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Horrible; barely flushes\"",
            "rating": 2,
            "date": "06/13/2019",
            "recommended": false,
            "text": "We purchased a different brand top flush for the master bath and the half bath in the studio. They were so great we went back and bought one for the first floor guest bath. When the contractor opened the box it was broken. Took it back to Lowe's and they were out of that brand but offered this for the same price. Huge mistake! You're paying for the name only. It looks nice but even the full flush mode can't flush toilet paper unless it's way back in the bowl right over the hole it goes down. Greatly regret this purchase. We got it for about half the list price and it isn't worth even half of that. Terrible design!",
            "author": "RonniC",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 2
            }
        },
        {
            "images": [],
            "title": "\"Nice high seat and dual flush\"",
            "rating": 5,
            "date": "08/19/2018",
            "recommended": true,
            "text": "This toilet is top notch. We purchase one for one of our bathrooms a few months ago and we're very satisfied, so this was our second purchase for another bathroom. The toilet has a high seat and the dual flush is a very nice and efficient feature.",
            "author": "tmbg",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"My NEW toilet\"",
            "rating": 4,
            "date": "05/22/2018",
            "recommended": true,
            "text": "The look is very modern and sleek.  Doesn't take up as much space as conventional toilet. Was easy to install.  I like that it is all in one and no tank to attach. I'm still trying to see if the power of the dual flush is strong enough when it comes to the \"big jobs\".  It may be a mater of making some adjustment inside the tank.  Overall I am pleased!",
            "author": "Granna",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "3e089ae3-58e1-5cd0-b5a6-d0a8fdba43e8",
                    "largeName": "d005b80f-505b-5799-b206-f450334d3853"
                }
            ],
            "title": "\"jacuzzi dual flush 1 PC prime\"",
            "rating": 4,
            "date": "08/28/2018",
            "recommended": true,
            "text": "works well and looks good. my only downside was the flange bolts were too short. otherwise 5 stars.",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "3582dbc4-bdac-5232-87eb-8074bafb957a",
                    "largeName": "9b720e61-08c7-5a59-be6f-bbce1be618a6"
                }
            ],
            "title": "\"Nice!\"",
            "rating": 5,
            "date": "08/31/2018",
            "recommended": true,
            "text": "Nice, affordable one piece/dual flush toilet. Easy to install & does the job.",
            "author": "MN",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "3d68ea40-0b88-592c-8917-784574447c39",
                    "largeName": "b41215a6-093d-5b85-b6d4-449d006fc565"
                }
            ],
            "title": "\"great product great price\"",
            "rating": 5,
            "date": "06/20/2018",
            "recommended": true,
            "text": "Thee toilet is so quiet. Love the water saving feature.",
            "author": "Goody222",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Does not flush\"",
            "rating": 1,
            "date": "06/11/2018",
            "recommended": false,
            "text": "Does not flush  installed easily no problems. Will not flush plane toilet paper. What it supposed to do with the real stuff he does not flush at all.    Now all I can do is throw this one out in the yard and go get another one. What a waste of money",
            "author": "Clubsmoker",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 26,
                "no": 11
            }
        },
        {
            "images": [],
            "title": "\"Easy install/Quality product\"",
            "rating": 5,
            "date": "02/17/2019",
            "recommended": true,
            "text": "I installed this toliet about 6 months ago. The one piece design made it an easy install.  Throw a wax ring on it, set it in place, snug not over tighten the nuts, connect the water line.  Took me about 20 min. It does include a wax ring but I recommend spending  the extra few dollars and purchasing a double wax ring. It also includes a soft closing seat and lid. The toliet itself functions as it should.",
            "author": "jl",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"New Toilet!\"",
            "rating": 5,
            "date": "02/19/2018",
            "recommended": true,
            "text": "As of 2/19/18 the toilet has only been installed for four day, but so far I really like it!  The dual flush feature is working good, very swift.  And the toilet fills up with water very quickly.  Also, I personally really like the slow close toilet seat.",
            "author": "Enjoymyhome",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 11,
                "no": 4
            }
        },
        {
            "images": [
                {
                    "smallName": "90aee22c-5098-5f96-ad3e-8d25be54df8a",
                    "largeName": "cd592c68-5e59-51e7-a494-bf85cf3a53ba"
                }
            ],
            "title": "\"Not so white\"",
            "rating": 3,
            "date": "04/11/2019",
            "recommended": false,
            "text": "I purchased this toilet for a powder room remodel. I love the design however was quiet disappointed with the color. It's more of a bone color, therefore it doesn't match the white vanity top in bathroom.",
            "author": "Remodel",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Works great and comes with everything you need.\"",
            "rating": 5,
            "date": "03/11/2018",
            "recommended": true,
            "text": "This toilet is ready to go, I had a little trouble due to a close wall on each side but got the job done.I will buy this again when needed!",
            "author": "Rod",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Efficiency\"",
            "rating": 5,
            "date": "11/05/2018",
            "recommended": true,
            "text": "We just finished our basement and we were not \"in love\" with our new toilet. A couple o years ago while in France we loved the ability to use either a full flush or a partial flush as needed. I decided to order the Jacuzzi toilet and we are very happy with it. It sits a bit higher, is more comfortable and just looks nice. If you were comparing cars it would be comparing a Camry to a Lexus.  Does the same job, just in a nicer fashion.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi toilet\"",
            "rating": 5,
            "date": "04/06/2018",
            "recommended": true,
            "text": "All I can say is I love it. I had a flushmate which has an air tank and is suppose to flush better than any other toilet. Well the Jacuzzi flushes a hundred times better and with less water. I would highly recommend it.",
            "author": "Jo",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Water Saver Toilet\"",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "Big water bill because old toilet even after replacing innards, kept sticking and leaking.  Wish we'd have done this sooner.  With two hip replacements, how nice it is to sit higher up!!",
            "author": "Carol",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Nice quality toilet\"",
            "rating": 5,
            "date": "06/24/2019",
            "recommended": true,
            "text": "Easy to install, works great, like the dual flush mode and the one pice feature makes it easy to clean. This is our second purchase of this types.",
            "author": "Doozer1314",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo White Toliet\"",
            "rating": 4,
            "date": "10/10/2018",
            "recommended": true,
            "text": "Will add updated reviews in next 12 months...plumber installed this toilet yesterday...looks great...plumber did not like this brand (easy to clog even with numerous flushes, he said)...but actual usage will tell me if I have a problem...previous toilet American Standard Cadet was also bought due to the favorable reviews, but I found the Cadet unit unacceptable (too many flushes and clogged easily).  Somewhere there must be a great toilet unit that works consistently and reasonably priced.",
            "author": "Remodeler",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great Toilet\"",
            "rating": 5,
            "date": "01/13/2018",
            "recommended": true,
            "text": "Easy installation, great looking toilet, very competitively priced.  Plan on replacing two others with this one.",
            "author": "Loren",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 12,
                "no": 6
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo 1 piece toilet\"",
            "rating": 5,
            "date": "11/05/2018",
            "recommended": true,
            "text": "Easy to install, a much better design than the old 2 piece, don't have to worry about bolts, etc. leaking.  Replaced a 2 piece toilet that was a problem from day one, it always leaked somewhere.  This one has dual flush with 2 buttons on top of the lid.  Bought 3 more to replace all of the other 2 piece toilets in the house.",
            "author": "patrick",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Color is off\"",
            "rating": 4,
            "date": "07/10/2018",
            "recommended": true,
            "text": "I bought two of these.It works, great, is quiet just as all the other reviewers said it would be. My issue is that it is not a bright white toilet.  I has a biscuit/ light almond look to it. So in my Carrera white tiled bathroom it looks dingy.     But in the other bathroom that has greys & beige, it looks fine.",
            "author": "Cweaver",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Excellent Toilet Overall - Great Buy\"",
            "rating": 5,
            "date": "04/10/2019",
            "recommended": true,
            "text": "I was looking for an elongated toilet that sat higher than my existing round bowl toilet that was decades old.  Unfortunately, the length of the toilet was a concern as typical elongated toilets stick out about 4 - 5 inches more than my old toilet.  Fortunately, this toilet is a happy medium that is only a 2 inches longer and it fits perfectly in the space I have.Not only that, but the install was easy for me and the included wax ring made it an easy rip/replace of the old toilet(though I needed to fix my existing flange which is outside the scope of this review).  Once in place, I filled it back up with water and it just worked.  I attached the seats and was ready to go.  I've been using it for a week and the only thing left to do is cut the floor bolts down to cap them.The toilet itself is comfortable, sturdy and flush performance is excellent for me.  It's powerful and the even the more efficient flush works pretty decent.  Overall, I'm very satisfied with the toilet.",
            "author": "Jake",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo\"",
            "rating": 1,
            "date": "07/03/2019",
            "recommended": false,
            "text": "Absolutely the worst purchase I've ever made . The fill valve was junk from day 1 , takes it hours to fill the tank and once it fills it keeps running (yes I have sufficient water pressure and volume). I emailed the Jacuzzi corporate offices 3 times and have received ZERO response from them . I was holding off leaving a review until after the company solved the issue for me but that's obviously never going to happen . Because of this the rest of my 2 bathroom remodels will have no Jacuzzi products and I will be replacing this piece of junk with another brand .",
            "author": "Chad",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 2
            }
        },
        {
            "images": [
                {
                    "smallName": "fa69c45d-fcbe-53fd-a6c2-11747beb58a9",
                    "largeName": "133e053b-28f8-55ac-bdce-c293f9818697"
                }
            ],
            "title": "\"Love It\"",
            "rating": 5,
            "date": "01/23/2019",
            "recommended": true,
            "text": "Was easy to install came with everything you needed to install. Looks space ageThe floor was from Lowes as well",
            "author": "tucker",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "a91470ed-154d-572c-9df3-ca43577f18de",
                    "largeName": "ea5993da-3b87-51d8-9ee3-9919cb191a2d"
                }
            ],
            "title": "\"Like it\"",
            "rating": 5,
            "date": "06/23/2018",
            "recommended": true,
            "text": "I love this toilet! Only used it a few times so far but it looks nice and the flush is pretty quiet!",
            "author": "Lori",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Love it\"",
            "rating": 5,
            "date": "03/30/2019",
            "recommended": true,
            "text": "Had to get a new toilet for kids bathroom. Seen this one the one piece design looked different. No problems installing was just me and the wife never installed one before. It is great smaller than the original so that's a plus. Kids tell me it feels good taking a number 2.",
            "author": "Matty",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo toilet\"",
            "rating": 5,
            "date": "04/22/2019",
            "recommended": true,
            "text": "Installed about 3 months ago. This toilet is amazing, looks as nice as a toilet can look and the water saving flush does it all.  It flushes and refills fast and the contractor found it super easy to install. I plan to buy another for my summer house. 5 stars for sure",
            "author": "Denise",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Very modern look - Recognized brand name\"",
            "rating": 4,
            "date": "04/29/2019",
            "recommended": true,
            "text": "This gives the bathroom a more modern look. It appears to be a really solid well built toilet. The seat closes very slowly. I have gotten a few laughs from folks when I told them I had a Jacuzzi toilet...the wrong images tend to pop it folks heads.  :-)",
            "author": "Richard",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Replaces a Toto\"",
            "rating": 5,
            "date": "12/03/2018",
            "recommended": true,
            "text": "We special ordered a high end Toto toilet, got it home and it was in multiple pieces due to breakage. Returned it and bought this to replace it. Better toilet, very substantial construction,  and easy to install.  Flush is great, we love it",
            "author": "BBR",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "ad23016f-86f3-5028-b4df-ebf33a71dace",
                    "largeName": "3ee7f33a-5fa4-5e2c-9535-0439620f57a9"
                }
            ],
            "title": "",
            "rating": 5,
            "date": "02/03/2019",
            "recommended": true,
            "text": "Beyond awesome!",
            "author": "Judy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Excellent One Piece Toilet\"",
            "rating": 5,
            "date": "04/27/2019",
            "recommended": true,
            "text": "We bought this one-piece toilet to replace a lower older toilet.  The higher toilet helps my wife get up easier, as well as conserve on water while flushing fully.  This is an excellent value and looks great.",
            "author": "DavidK",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"sleek and modern\"",
            "rating": 5,
            "date": "11/15/2018",
            "recommended": true,
            "text": "Love the look and function of this toilet.  one piece design makes it easy to clean.  Can't speak to how it will hold up over the years but looks great and love the dual flush water saving system",
            "author": "Tricia",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Super easy install\"",
            "rating": 5,
            "date": "11/01/2018",
            "recommended": true,
            "text": "I really like that the bowl and tank are all one piece. It comes with all the plumbing installed. Just place the wax ring, connect the water supply,bolt it down and type ready to go. Works great!",
            "author": "CK",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Quiet and Energy Efficient\"",
            "rating": 5,
            "date": "10/25/2018",
            "recommended": true,
            "text": "The Jacuzzi Dual flush toilet not only saves water, but is efficient and easy to clean.  It as easy to install as all components except the water kinecwas included.",
            "author": "Sargeaf126",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great Toilet\"",
            "rating": 5,
            "date": "05/19/2019",
            "recommended": true,
            "text": "So easy to install!  It took all of 7 minutes - and I'm in my 70's.  Having the insides already installed was a great boon.  It is quiet and works well!",
            "author": "Elisabeth",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"The best toilet for the money\"",
            "rating": 5,
            "date": "01/01/2019",
            "recommended": true,
            "text": "At $189 I find it very much underpriced. It is sleek looking, efficient and better than more expensive toilet like Kohler or American standard. You appreciate it more when you get it. I bought initially two piece Toto toilet at double the price, luckily for me the manufacturer shipped only one piece which made me return it to Lowe's and found this wonderful Juccuzi toilet in stock. I am quite more than satisfied.",
            "author": "SAMM",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Easy install\"",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "I installed one of these 1 year ago, it's working great. No moving parts! Set in place, screw down, and connect the water line....done!",
            "author": "Mick",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Throne built for a King\"",
            "rating": 5,
            "date": "09/18/2018",
            "recommended": true,
            "text": "Dual flush and super comfy, couple it with a squatty potty type thing and you too can poop in luxury and style as you lean way back and ponder the great mysteries of life. Be careful to not fall asleep whilst dropping the kids off at the pool. Easy to install.",
            "author": "Sean",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo White WaterSense Labeled Dual Elonga\"",
            "rating": 5,
            "date": "10/24/2018",
            "recommended": true,
            "text": "I love the style, and it was very easy to install, I am 70 years old, if I can do it anyone can.",
            "author": "carolynh",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Excellent one piece toilet\"",
            "rating": 5,
            "date": "10/11/2018",
            "recommended": true,
            "text": "Simple to install! Great flushing power and duel flush! Comfortable seating for one!",
            "author": "KO",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Is Not Working for Me\"",
            "rating": 2,
            "date": "04/22/2019",
            "recommended": false,
            "text": "I had this toilet installed in early January.  My plumber said it was a very nice toilet and easy to install.  I love the look, height and how it fits in my bathroom.  However, I find this toilet does not clean the toilet of solid waste adequately.  I am not sure if we have unusually low water pressure or what the issue is but I am almost at the point of having it removed and replaced with a single flush toilet. Tired of having to clean the toilet every time we need to flush solid waste.",
            "author": "VAGran",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "images": [],
            "title": "\"Do you have solid waiste? Not in this place!\"",
            "rating": 2,
            "date": "04/09/2019",
            "recommended": false,
            "text": "Not enough power despite what button you press. I upped the water level, but the flush is still insuficient for all deposits. Girls, you better adjust immediatly or you will be flushing numerous times. I rated it 2 stars because at least it does minimum work. If you want a good toilet, keep looking.",
            "author": "DottedMars",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Great product\"",
            "rating": 5,
            "date": "02/13/2019",
            "recommended": true,
            "text": "Very stylish and works great. Love the one piece design. They recommend two people to set but certainly not necessary. I did it myself and it was really simple. I think two people would have been more difficult. I would recommend this piece to anyone looking for a replacement toilet.",
            "author": "Dave",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Toilet\"",
            "rating": 5,
            "date": "08/29/2018",
            "recommended": true,
            "text": "Very happy with this commode...one piece is easier to clean and 'dual flush method' is quieter and saves water.  Height is a bit higher than my previous commodes which is excellent",
            "author": "Dotty",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"great look streamlne design\"",
            "rating": 5,
            "date": "03/25/2018",
            "recommended": true,
            "text": "This is a very sleek looking toilet, the one piece design gives it a great look with nice lines.  The dual flush was a big selling point as a water saver and it flushes perfectly.",
            "author": "paul",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great UNLESS you need it to be ADA compliant\"",
            "rating": 3,
            "date": "11/05/2018",
            "recommended": false,
            "text": "We really like this toilet but discovered this week when we went to add toilet grab bars for my mother-in-law that the stylish curves at the back prevent installing any appliances. We have to go with freestanding grab-bars unless we want to have the walls torn apart for bracing to have wall-mounted ones put in. :-/",
            "author": "Branwyn",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 2
            }
        },
        {
            "images": [],
            "title": "\"DOES NOT TAKE STANDARD PARTS\"",
            "rating": 1,
            "date": "03/15/2019",
            "recommended": false,
            "text": "If you purchase IMMEDIATELY order yourself a set of replacement guts from Jacuzzi as they are not available in stores.(Check out the install guide) Only sells for the cute factor. Do you really want a toilet that you have to explain the use of to all your guests ? If the hit the full flush button you'll actually be using 1.6 gallons a flush or MORE water than your standard toilets",
            "author": "mingokid",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 4
            }
        },
        {
            "images": [],
            "title": "\"My jacuzzi primo toilet\"",
            "rating": 5,
            "date": "09/19/2018",
            "recommended": true,
            "text": "This is a nice toilet, it is very efficient with water and very quiet when refilling.It is also chair height so it's very comfortable",
            "author": "Gparks",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Love this product\"",
            "rating": 5,
            "date": "09/16/2018",
            "recommended": true,
            "text": "Love the one piece—never have to worry about a leak between tank and base.  Plus eco friendly with the flush options.",
            "author": "Laurie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great compact design\"",
            "rating": 5,
            "date": "08/17/2018",
            "recommended": true,
            "text": "Great design perfect for small powder rooms. Easy to install and works great. I now have them in all 4 bathrooms.",
            "author": "Tina",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "",
            "rating": 3,
            "date": "11/15/2018",
            "recommended": false,
            "text": "Toilet is loud when you flush and you sometimes must flush more then once pay a little more and go with koler",
            "author": "rick",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"So sleek and clean looking!\"",
            "rating": 5,
            "date": "07/30/2018",
            "recommended": true,
            "text": "Love this toilet! Not bulky looking like two piece toilets. Flushes  perfect every time! Decent price too.",
            "author": "SSweeny",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Nice Toilet\"",
            "rating": 5,
            "date": "04/23/2019",
            "recommended": true,
            "text": "It is perfect height to use and I love the fact it is only one piece not two. It also was a great price!",
            "author": "Sue",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"large toilet\"",
            "rating": 5,
            "date": "10/05/2018",
            "recommended": true,
            "text": "Flushes well. Replaced old toilet so it's different. Buttons easy to push. Easy self install.",
            "author": "krg03",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Fit for a King\"",
            "rating": 5,
            "date": "07/07/2019",
            "recommended": true,
            "text": "Super nice oval design, sleek and easy to clean! Love the dual flush.  Quiet and comfortable!",
            "author": "Deano",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Works perfect\"",
            "rating": 5,
            "date": "10/28/2018",
            "recommended": true,
            "text": "Easy to install and works perfect-Saves a lot of water with household of 4",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"excellent size and shape\"",
            "rating": 4,
            "date": "08/27/2018",
            "recommended": true,
            "text": "the toilet fit in my space perfectly. excellent sizefor  average people.",
            "author": "lmg",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Won't Flush Excrement\"",
            "rating": 1,
            "date": "03/23/2019",
            "recommended": false,
            "text": "I liked the brand name and I liked the sleek design for ease of cleanup. I hadn't done my research as it was in the clearance section at full price. I thought it was a good deal. Unfortunately, if you plan a #2(excrement) you may be staring at it for a while.  This toilet DOES NOT flush excrement cleanly.  The bowl does not have a clean status even after multiple flushes.  DO NOT BUY unless this is for #1 urinating only.",
            "author": "Dan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 3
            }
        },
        {
            "images": [],
            "title": "",
            "rating": 5,
            "date": "08/02/2018",
            "recommended": true,
            "text": "Installed easily well packaged nice product for price point.",
            "author": "David",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/04/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "roger",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/30/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "stan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "images": [],
            "title": "\"Nice looking toilet\"",
            "rating": 5,
            "date": "12/30/2018",
            "recommended": true,
            "text": "Installed this today, being a one piece toilet it makes it a little easier not having to deal with attaching the tank, only drawback is since it is one piece instead of two it is heavy making lining it up with the screws a bit challenging.  Go with the Fluidmaster better than wax ring, since it is not wax you can make adjustments as needed.It is a nice looking toilet, looks more expensive than you will pay.",
            "author": "I-Want-That",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Pretty but doesn't flush well\"",
            "rating": 1,
            "date": "04/23/2019",
            "recommended": false,
            "text": "We have had this a year.  It doesn't clean itself.  I eliminated the low flush and increased the water as high as I could and it still doesn't clean itself.  It also has a strong structural element where the tank attaches to the base with \"ridges\" that prevent installing a bidet seat.  When buying a seat you must either get a narrow seat or add a spacer.  We are replacing it.",
            "author": "Lew",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 3
            }
        },
        {
            "images": [],
            "title": "\"Like size\"",
            "rating": 5,
            "date": "07/05/2019",
            "recommended": true,
            "text": "Needed a taller toilet due to my age and knees. This product was very reasonable in price and size.",
            "author": "Soldier",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo White WaterSense\"",
            "rating": 5,
            "date": "01/15/2019",
            "recommended": true,
            "text": "Extremely easy install. Includes all necessary hardware and the wax ring. The soft close toilet seats work great and the dual button flush not only looks better, it's easier to use, and it's saving us money in the long run.",
            "author": "Namluk",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"absolutely perfect\"",
            "rating": 5,
            "date": "08/14/2018",
            "recommended": true,
            "text": "After being a DIY yourselfer and Amateur jack of all trades for 50 years , though I can no longer do it I can still recognize quality I purchased 2 of these to replaced worn and stained toilet in my present home,",
            "author": "vinny",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great toilet\"",
            "rating": 5,
            "date": "10/25/2018",
            "recommended": true,
            "text": "I love this toilet. It was easy to install. Loved the one piece construction. It fits great in the small bathroom space that we have it in. The top flush buttons are awesome",
            "author": "Ktritten",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "",
            "rating": 5,
            "date": "02/05/2019",
            "recommended": true,
            "text": "I never thought I would be excited about a toilet but these toilets are the best.  They are quiet, efficient and the design1 very modern and upscale.",
            "author": "Maggie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Satisfied\"",
            "rating": 5,
            "date": "02/06/2019",
            "recommended": false,
            "text": "Installed in master bath; I have ordered a second for another bathroom remodel. Quiet flush; easy to clean;good quality; great price",
            "author": "Hilary",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Waiting...\"",
            "rating": 5,
            "date": "10/23/2018",
            "recommended": false,
            "text": "Arrived on time and appears intact.I have not installed it yet but will soon.Once I have and give a performance review then.",
            "author": "Mcannon1964",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Decent toilet for the price .\"",
            "rating": 4,
            "date": "04/11/2019",
            "recommended": true,
            "text": "I am not a fan of elongated, but my husband is. This one is decent. Bowl stays pretty clean  and then dual  flush is nice.",
            "author": "Eb",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi Primo: Quality Product\"",
            "rating": 4,
            "date": "01/20/2019",
            "recommended": true,
            "text": "Packed wellEasy installationWell madeQuality ProductFeatures of many more expensive single piece contempRy toilets",
            "author": "Dave",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great flusher!\"",
            "rating": 5,
            "date": "02/06/2019",
            "recommended": true,
            "text": "I bought this toilet based on it's price and reviews! Not disappointed at all! Looks and works great!",
            "author": "usafwife",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Jacuzzi toilet\"",
            "rating": 5,
            "date": "09/04/2018",
            "recommended": true,
            "text": "Excellent product, easy installation, detailed instructions, affordable price",
            "author": "Dale",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Great\"",
            "rating": 5,
            "date": "04/09/2018",
            "recommended": true,
            "text": "We are very pleased with the style - it looks so elegant. We're loving it.",
            "author": "Cher",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Love it\"",
            "rating": 5,
            "date": "04/16/2019",
            "recommended": true,
            "text": "So far I love this toilet! So do my grandchildren, easy for them to flush.",
            "author": "Wendy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Works well\"",
            "rating": 5,
            "date": "02/22/2019",
            "recommended": true,
            "text": "I'm very glad with this purchase. I'd certainly recommend it to anyone.",
            "author": "M",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Perfect!\"",
            "rating": 5,
            "date": "10/02/2018",
            "recommended": false,
            "text": "I love this toilet. Will purchase another one for the guest bathroom",
            "author": "Maria",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Decent\"",
            "rating": 4,
            "date": "01/04/2019",
            "recommended": true,
            "text": "Good product, however it's a little taller than in the description.",
            "author": "James",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Fabulous toilet great price\"",
            "rating": 5,
            "date": "06/06/2019",
            "recommended": true,
            "text": "Really good toilet, uses minimal water but flushed powerfully!",
            "author": "Rachinator",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Will buy another for next bathroom remodel job.\"",
            "rating": 5,
            "date": "12/30/2018",
            "recommended": true,
            "text": "I liked that it is one piece and the size and shape are nice.",
            "author": "Lancerlot313",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/14/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "CV",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/08/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Christy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "06/14/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jim",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/11/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "PNW",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "01/12/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Luis",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 3,
            "date": "11/11/2018",
            "recommended": false,
            "text": "There is no review to accompany this rating.",
            "author": "Hckdil",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "02/26/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jai",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/04/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "4dawsons",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Andrew",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/25/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "eddie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "11/25/2017",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Carol",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/16/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Larry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/05/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Vickye",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/21/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Gary",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/07/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Ben",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/04/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Cameron",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "10/23/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Glenda",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/12/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Mimi2",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/29/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Deb",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/19/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jasen",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/28/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "JJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 4,
            "date": "08/11/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Melissa",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Gerry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/01/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Donna",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/17/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Maria",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "KJ",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/21/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Scott",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/09/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Larry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/23/2019",
            "recommended": null,
            "text": "There is no review to accompany this rating.",
            "author": "Roger",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        }
    ],
    "reviewStats": {
        "reviewCount": 154,
        "percentRecommended": "83",
        "averageStars": "4.4",
        "starCounts": {
            "five": 110,
            "four": 24,
            "three": 5,
            "two": 5,
            "one": 10
        }
    },
    "questions": [
        {
            "question": "\"Are all of the pieces and parts required for the installation included with the toilet?\"",
            "author": "Hilary",
            "date": "08/23/2017",
            "answers": [
                {
                    "author": "jbnonc",
                    "date": "02/10/2018",
                    "text": "NO- it does NOT come with a supply line (hose that connect water source to the toilet",
                    "helpful": {
                        "yes": 61,
                        "no": 0
                    }
                },
                {
                    "author": "Baar",
                    "date": "09/13/2017",
                    "text": "Yes",
                    "helpful": {
                        "yes": 5,
                        "no": 3
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "08/29/2017",
                    "text": "Yes, Hilary. All pieces needed for assembly are included. For more installation details, please copy and paste this link into your browser: http://pdf.lowes.com/installationguides/6946532100709_install.pdf If you should have any further questions, feel free to reach us at 1(800)288-4002, Monday -Friday from 6am-5pm PT. Thank you, Ruby, Jacuzzi® Official",
                    "helpful": {
                        "yes": 10,
                        "no": 3
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "08/23/2017",
                    "text": "Yes, this listing includes all hardware parts required for installation.",
                    "helpful": {
                        "yes": 8,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"Can someone with this bowl take a picture of the inside of the tank. Trying to determine if it works off a handle and \"flapper\" or if its a powerflush\"",
            "author": "BDB",
            "date": "01/20/2018",
            "answers": [
                {
                    "author": "mingokid",
                    "date": "03/15/2019",
                    "text": "If it's like their last generation, then it DOES NOT take standard parts. The Push button has prongs on underside which activate the mechanism. With the last model you had to order the parts directly from Jacuzzi \"Not sold in stores\"",
                    "helpful": {
                        "yes": 11,
                        "no": 0
                    }
                },
                {
                    "author": "Zippy",
                    "date": "06/13/2018",
                    "text": "I believe this toilet says it works as a gravitational. Please check the specs to make sure. Of it is gravitational, there is a flapper, and it's not a power flush.",
                    "helpful": {
                        "yes": 6,
                        "no": 5
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "01/23/2018",
                    "text": "Hi BDB. Our Jacuzzi® Primo® toilet operates using a top mount button which connects to a dual flush assembly (canister not a flapper), which allows the user to choose between a 1.1 gallons per flush to save water or 1.6 gallons per flush for powerful waste removal. For additional assistance and details about this high efficiency, high performance toilet, please contact a friendly Consumer Bath Representative at 800-288-4002, Mon. – Fri., 6 a.m. to 5 p.m. PT. Please reference case number 00519841. Sarah- Jacuzzi® official",
                    "helpful": {
                        "yes": 13,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"When installed, what is the distance from the wall to the tip of the bowl? I only have about 29.5 inches to work with there. Thanks.\"",
            "author": "Terry",
            "date": "08/30/2017",
            "answers": [
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "09/06/2017",
                    "text": "Hello Terry! Thank you for your inquiry. To clarify previous comments, we have it noted as a measurement of 28.50\" from the back to the tip of the bowl. If you have more installation or specification questions, feel free to reach us at 1(800)288-4002, Monday -Friday from 6am-5pm PT. Thank you, Ruby, Jacuzzi® Official",
                    "helpful": {
                        "yes": 27,
                        "no": 1
                    }
                },
                {
                    "author": "spooky103166",
                    "date": "09/02/2017",
                    "text": "sorry earlier answer was off just a hair . assembled depth is 28.19 inches so u will have 1.31 inches to spare . as long as careful u should be fine .",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                },
                {
                    "author": "spooky103166",
                    "date": "09/02/2017",
                    "text": "in the spec sheet it shows assembled depth to be 28.9 inches so u will be very tight but should be good to go",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"it flushes ok but does the bowl hold enough water to keep it clean ?\"",
            "author": "rg",
            "date": "05/20/2019",
            "answers": [
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "05/21/2019",
                    "text": "Hello RG. Thank you for your inquiry about the Primo® Toilet. This model, SW07959, is WaterSense certified (1.1 and 1.6 gallons/flush), therefore, it does not hold or use as much water as a standard toilet. If you feel the water level in your toilet is not high enough, please feel free to contact us at 1.800.288.4002, Mon. to Fri., 6 AM to 5 PM, PST, so we may further investigate. Alyssa – Jacuzzi® Official",
                    "helpful": {
                        "yes": 2,
                        "no": 1
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "05/21/2019",
                    "text": "Hello Brian 319. Thank you for your interest in the Primo® Two-Piece Toilet. The MaP rating on this model, TC10959, is 1,000g (i.e. 1,000 grams = the amount of waste the toilet can flush cleanly). Please feel free to contact us at 1.800.288.4002, Mon. to Fri., 6 AM to 5 PM, PST, or email consumerassistance@jacuzzi.com if you have additional questions. Alyssa- Jacuzzi® Official",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"What is the weight of the toilet?\"",
            "author": "Anonymous",
            "date": "01/22/2019",
            "answers": [
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "01/23/2019",
                    "text": "Hello. Thank you for your interest in the Primo® Elongated Toilet. The assembled weight of this toilet is 76.3lbs. Please feel free to contact our friendly consumer bath representatives at 1.800.288.4002, Mon. to Fri., 6 AM to 5 PM, PST, or email consumerassistance@jacuzzi.com is you have any additional questions or concerns. Alyssa- Jacuzzi® Official",
                    "helpful": {
                        "yes": 8,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "01/23/2019",
                    "text": "This item weighs 76.3 lbs.",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"How does the seat close???I know it's self-closing,but by a nudge ? Thank-you\"",
            "author": "Anonymous",
            "date": "08/13/2018",
            "answers": [
                {
                    "author": "CommunityAnswer",
                    "date": "08/16/2018",
                    "text": "Yes, if you nudge the seat, it will activate the soft close feature.",
                    "helpful": {
                        "yes": 21,
                        "no": 0
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "08/15/2018",
                    "text": "Hello. Thank you for your submission. You are correct. The soft close feature on the Primo® toilet seat is activated with a nudge. Sarah- Jacuzzi® official",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"How does the toilet bowl hold up to mildew, mold, and algae growth?\"",
            "author": "Anonymous",
            "date": "07/21/2018",
            "answers": [
                {
                    "author": "SSweeny",
                    "date": "07/31/2018",
                    "text": "We are on well water and no issues.",
                    "helpful": {
                        "yes": 13,
                        "no": 4
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "07/27/2018",
                    "text": "Hello. Thank you for your inquiry on the Primo® elongated toilet. Mildew, mold and algae growths is related to conditions that occur in spite of the design of this product. Please note, “mold thrives in dark, moist environments, so toilet bowls are primo targets. If a toilet is dirty, the buildup of dirt and grime will also feed the mold, allowing it to grow quickly. Scaly mineral deposits inside the bowl also contribute to mold growth as they give it a surface to attach to and grow upon. Also, a lack of adequate air flow inside a bathroom can also encourage mold to form and multiply.” Daily or regular maintenance and cleaning will limit the effects of environmental contributions of which the bowl is exposed and help to keep the bowl clear and free from mildew, mold and algae growth. Sarah- Jacuzzi® official",
                    "helpful": {
                        "yes": 9,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"I trapway glazed?\"",
            "author": "Phil",
            "date": "03/04/2018",
            "answers": [
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "03/16/2018",
                    "text": "Hello Phil. Thank you for your inquiry and interest in the luxurious Primo® toilet. This toilet has a 12” trap that is completely glazed. Sarah- Jacuzzi® official",
                    "helpful": {
                        "yes": 17,
                        "no": 0
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Factory Expert",
                    "date": "03/16/2018",
                    "text": "Phil, Great question! This model has a 2\" glazed trapway.",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"does this toilet keep stools from clogging tiolet\"",
            "author": "Goofy2008",
            "date": "02/28/2018",
            "answers": [
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "03/21/2018",
                    "text": "Hello Goofy2008. Thank you for your interest and inquiry on the luxurious Primo® toilet. Featuring the dual-flush system at 1.1 gallons for the low flush and 1.6 gallons for the high flush, customer feedback suggests 89% of its buyers recommend this unit and rate this product a 4.5 out of 5 stars. Per the customer reviews, this toilet is has a great design, is very comfortable, quiet and has a powerful flush. We encourage you to check out the reviews from the buyers themselves and we hope you are inspired to purchase the Jacuzzi® Primo® toilet. Sarah- Jacuzzi® official",
                    "helpful": {
                        "yes": 23,
                        "no": 21
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Factory Expert",
                    "date": "03/16/2018",
                    "text": "Goofy2008, If you are having issues with this model clogging, please feel free to reach out to our customer service department at 800-288-4002, Mon.- Fri., 6 a.m. to 5 p.m. PT.",
                    "helpful": {
                        "yes": 10,
                        "no": 5
                    }
                }
            ]
        },
        {
            "question": "\"Can you install a bidet? Also, will the bidet interfere with the slow close lid functionality.\"",
            "author": "Spray",
            "date": "02/28/2018",
            "answers": [
                {
                    "badgeName": "1000181997",
                    "author": "Jacuzzi® Official",
                    "date": "03/22/2018",
                    "text": "Hi Spray. We appreciate your interest in the Primo® toilet. This toilet comes standard with a slow close, elongated toilet seat. If you prefer to change out the toilet seat to one that has a bidet feature, you will need to completely remove the existing toilet seat and re-install the seat of preference. When searching for a new seat, you will want to ensure the dimensions of the seat are compatible to the dimensions of the toilet. The Primo® toilet has a distance of 5.51” between the two bolts and 18.50” from bolt to end of bowl. You will also need to measure the distance of the bowl from left to right. Please feel free to contact us at 800-288-4002, Mon.- Fri., 6 a.m. to 5 p.m. PT if you have additional questions. Sarah- Jacuzzi® official",
                    "helpful": {
                        "yes": 7,
                        "no": 0
                    }
                },
                {
                    "badgeName": "1000181997",
                    "author": "Factory Expert",
                    "date": "03/16/2018",
                    "text": "Spray, This toilet does not come with a bidet. If you choose to purchase a bidet for this toilet the slow close lid should not interfere. Check and make sure the measurements will work with this model.",
                    "helpful": {
                        "yes": 6,
                        "no": 1
                    }
                }
            ]
        }
    ]
}