{
    "descriptions": {
        "overview": "This executive big man’s chair is everything the name suggests and more! The padded mesh design and thick contour built-in lumbar support give this chair a comfortable feeling with no sacrifice to style. Able to withstand 350 lbs., its durable construction only adds to the many attributes this chair has!",
        "list": [
            "Thick padded contour back with built-in lumbar support",
            "1-touch pneumatic seat height adjustment",
            "Locking tilt control with adjustable tilt tension",
            "Adjustable arms with mesh pads",
            "Heavy duty chrome finish base with dual wheel carpet casters",
            "Assembly is required",
            "Suitable for commercial use",
            "Black"
        ]
    },
    "specs": [
        {
            "title": "Collection Name",
            "spec": "WorkSmart Big and Tall"
        },
        {
            "title": "Color/Finish Family",
            "spec": "Black"
        },
        {
            "title": "Manufacturer Color/Finish",
            "spec": "Black/chrome"
        },
        {
            "title": "Back Material",
            "spec": "Upholstered"
        },
        {
            "title": "Seat Material",
            "spec": "Upholstered"
        },
        {
            "title": "Frame Material",
            "spec": "Plastic"
        },
        {
            "title": "Wood Species",
            "spec": "N/A"
        },
        {
            "title": "Finish Type",
            "spec": "Metal"
        },
        {
            "title": "Style",
            "spec": "Transitional"
        },
        {
            "title": "Trend",
            "spec": "Casual"
        },
        {
            "title": "Number of Casters/Wheels",
            "spec": "5"
        },
        {
            "title": "Type",
            "spec": "Manager"
        },
        {
            "title": "Maximum Seat Height (Inches)",
            "spec": "24.25"
        },
        {
            "title": "Minimum Seat Height (Inches)",
            "spec": "20.75"
        },
        {
            "title": "Seat Back Height (Inches)",
            "spec": "23.25"
        },
        {
            "title": "Seat Back Width (Inches)",
            "spec": "22"
        },
        {
            "title": "Seat Bottom Depth (Inches)",
            "spec": "19"
        },
        {
            "title": "Seat Bottom Width (Inches)",
            "spec": "21.5"
        },
        {
            "title": "Seat Bottom Thickness (Inches)",
            "spec": "5"
        },
        {
            "title": "Weight (lbs.)",
            "spec": "57"
        },
        {
            "title": "Weight Capacity (lbs.)",
            "spec": "250"
        },
        {
            "title": "Adjustable Height",
            "spec": 1
        },
        {
            "title": "Package Quantity",
            "spec": "1"
        },
        {
            "title": "Arms",
            "spec": "Adjustable"
        },
        {
            "title": "Folding",
            "spec": 0
        },
        {
            "title": "Massaging",
            "spec": 0
        },
        {
            "title": "Heated",
            "spec": 0
        },
        {
            "title": "Lumbar Support",
            "spec": 1
        },
        {
            "title": "Ergonomic",
            "spec": 0
        },
        {
            "title": "Casters",
            "spec": 1
        },
        {
            "title": "BIFMA/ANSI Certified",
            "spec": 1
        },
        {
            "title": "UNSPSC",
            "spec": "56101500"
        },
        {
            "title": "Swivel",
            "spec": 1
        },
        {
            "title": "Tilting",
            "spec": 1
        }
    ],
    "reviews": [
        {
            "title": "\"Heavy construction\"",
            "rating": 5,
            "date": "06/23/2015",
            "recommended": true,
            "text": "I bought this chair to replace one that I bought at a big office supply store for about $80. This one is more than twice the price but mostly worth it. This is much heavier than my previous and I think will last longer and withstand more abuse. The specifications state that it is rated for 350 pounds which seems to be plausable, I would have guessed more. I like the cover material. The padding is ample. Another vender carries this same chair with the title \"big man's chair\". The cardboard shipping box had label \"big and tall chair\".. (this does not appear in the Lowes title). The actual size does not really go along with that description. The seat depth (front to back) is a couple inches shorter than my last one which is a bit short for me (I am tall) but I have gotten used to it.. Back is nice and tall. Seat is acutually a bit narrower compared to my other two office chairs. Pleanty wide for me and for 95+% of people but I would guess a really wide bodied person (e.g. 300+ pounds) might find it too narrow. I ran into a problem during assembly, the two \"short screws\" supplied to attach the front of the seat plate to the seat cushion were too short. .There was a set of spare screws in the package with which I made do with one medium and one long screw. I sent an email to Office Star Parts on Thursday night requesting a medium scfrew. I received a package of screws Monday with enough screws of various sizes, including the one requested, to probably assemble two more chairs with some left over, so I can't really complain about that. My guess is there is some manufacturing variability which resulted in the screw problem.",
            "author": "captainlouie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 35,
                "no": 3
            }
        },
        {
            "title": "\"Good For Lumbar But Arm Rest Problems\"",
            "rating": 4,
            "date": "08/05/2013",
            "recommended": null,
            "text": "if you have lower lumbar problems this chair is great for that. however I ordered this size chair because I am a a large person. but the peice that supports the arm rest is rather wide and pushes hard against my upper leg making it uncomfortable at times. I thought about taking off the arm rests and swapping sides and mounting them backwards as the back part of the arm support is narrower an",
            "author": "Anonymous",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good Quality & Comfortable\"",
            "rating": 5,
            "date": "09/25/2016",
            "recommended": null,
            "text": "This is just an initial review, but my impression of the product is that it is made of quality materials. It was quite easy to assemble. My husband & I put it together in about 25 minutes. The directions are clear, and they give you a packet of 1 extra of each of the screws just in case you need a spare. It is very comfortable to sit in. I spend many hours doing computer work at my desk (and do take frequent breaks), but I was experiencing nerve pain in my shoulder with my old chair. So far, I have not had the shoulder pain with this chair, most likely because of the better back support & much better cushioning. I will return in a few months to give an update to report on wearability. The warranty on this model is excellent! As of this writing, beware of the Hercules Big & Tall 24/7 chairs--the warranty on those only covers them for \"normal use\" (a 250 lb person using it 40 hrs/week!). Not so with this chair.",
            "author": "Anonymous",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent\"",
            "rating": 5,
            "date": "01/28/2014",
            "recommended": null,
            "text": "I got one for myself and found it to be exactly what I wanted. My wife is rather picky about chairs, but after she took a liking to this model's comfortable design we decided to purchase a second one for her as well. We highly recommend this model.",
            "author": "Anonymous",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"5 Stars\"",
            "rating": 5,
            "date": "09/09/2014",
            "recommended": null,
            "text": "Easy to put together, comfortable. I have only had for a few days but so far so good.",
            "author": "Anonymous",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        }
    ],
    "reviewStats": {
        "reviewCount": 5,
        "percentRecommended": "20",
        "averageStars": "4.8",
        "starCounts": {
            "five": 4,
            "four": 1,
            "three": 0,
            "two": 0,
            "one": 0
        }
    },
    "questions": [
        {
            "question": "\"Can the arms be completly left off of the chair?\"",
            "author": "pas",
            "date": "07/29/2017"
        },
        {
            "question": "\"what is weight capacity of this chair?\"",
            "author": "MaryAnn",
            "date": "07/10/2017"
        }
    ]
}