{
    "descriptions": {
        "overview": "With your Google Home device, you can have your own personal assistant. With simple voice commands, you can get information about traffic, sports, finance and more. Google Home allows you stream videos directly to your television, set alarms, play music and ask for directions all from the comfort of your own home. Simply say \"OK Google\" and ask your question. Within seconds, Google Home will return you an answer. Easily control your Chromecast device or Nest thermostat (not included) with your voice. Included is a HiFi sound quality speaker and a far-field microphone.",
        "list": [
            "Google Home is powered by the Google Assistant, ask it questions, tell it to do things, it’s your own Google, always ready to help just start by saying Ok Google",
            "With a simple voice command, play tunes from services like YouTube Music and Google Play Music, enjoy even more compatible audio services by streaming directly from your phone to Google Home",
            "Get answers to things you want to know including the latest on weather, traffic, finance, sports, and more, plus get information to help you do things in your world",
            "With your permission, Google Home can help you with things like your commute, flight information, and more, plus it’s a whiz at setting alarms, starting timers, and adding items to your shopping list",
            "Simply ask Google Home to stream videos to your TV with Chromecast or to turn up your Nest thermostat",
            "Google Home’s high excursion speaker delivers HiFi sound quality, It can also hear you reliably thanks to far-field microphones"
        ]
    },
    "specs": [
        {
            "title": "Height (Inches)",
            "spec": "9.19"
        },
        {
            "title": "Width (Inches)",
            "spec": "3.79"
        },
        {
            "title": "Depth (Inches)",
            "spec": "5.62"
        },
        {
            "title": "Weight (lbs.)",
            "spec": "2.35"
        },
        {
            "title": "Battery Back-Up",
            "spec": 0
        },
        {
            "title": "Number of USB Ports",
            "spec": "1"
        },
        {
            "title": "Package Contents",
            "spec": "Power cord and quick start guide"
        },
        {
            "title": "Works with Nest",
            "spec": 1
        },
        {
            "title": "Works with Apple HomeKit",
            "spec": 0
        },
        {
            "title": "Works with SkylinkNet",
            "spec": 0
        },
        {
            "title": "Warranty",
            "spec": "1-year"
        },
        {
            "title": "Type",
            "spec": "Bridge"
        },
        {
            "title": "Installation Required",
            "spec": 1
        },
        {
            "title": "Series Name",
            "spec": "Home"
        },
        {
            "title": "Manufacturer Color/Finish",
            "spec": "White"
        },
        {
            "title": "Works with Amazon Alexa",
            "spec": 0
        },
        {
            "title": "App Compatibility",
            "spec": 1
        },
        {
            "title": "Bluetooth Compatibility",
            "spec": 1
        },
        {
            "title": "Voice Controlled",
            "spec": 1
        },
        {
            "title": "Wi-Fi Compatibility",
            "spec": 1
        },
        {
            "title": "Works with Android",
            "spec": 1
        },
        {
            "title": "Works with SmartThings",
            "spec": 1
        },
        {
            "title": "Works with iOS",
            "spec": 1
        },
        {
            "title": "Works with the Google Assistant",
            "spec": 1
        }
    ],
    "reviews": [
        {
            "images": [
                {
                    "smallName": "1e55a514-62c5-5cb0-8436-56d287458632",
                    "largeName": "651a6f16-f8f1-5f64-a49b-29fa7dfa2631"
                },
                {
                    "smallName": "c86cf00a-2478-50e8-a0a9-6bf39a7fc36a",
                    "largeName": "ecd01f08-2887-5a1c-b5ce-c7459dae0f40"
                }
            ],
            "title": "\"Google home\"",
            "rating": 5,
            "date": "12/13/2018",
            "recommended": true,
            "text": "Product arrived and I was skeptical as to whether we would use it. Boy, were we surprised. We use it for everything from checking the weather, help with homework assignments and especially playing music. The installation was super easy. The sound quality is great. So easy to use even my grand-daughter uses it to answer her questions. \n\nI would highly recommend this product. I have found out that it easily recognized all the voices in our family after following the installation instructions.\n\nEasy to install and use. Installation took less than 10 minutes from unwrapping to use.",
            "author": "TV",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 9,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "6ce0ddad-8462-525f-94d0-03af7bdedc38",
                    "largeName": "7bdf5aa5-aac9-56b6-b0a2-6b6ec7f3af75"
                },
                {
                    "smallName": "009cfaf7-468c-51f4-a727-bb6677fceb0d",
                    "largeName": "4e893c73-7d9e-599b-a630-58bd06fe6934"
                }
            ],
            "title": "\"Depending on your needs, it's a great product\"",
            "rating": 5,
            "date": "04/28/2018",
            "recommended": true,
            "text": "I have this and several Amazon Echos. I personally think this sounds better, more bassy. It also looks quite a bit better in the kitchen. Like all personal assistants it answers some questions better than others. It has a good amount of tie ins to 3rd party services and of course to Google services. I do prefer the manual rotary dial on the Echo, but the touch surface works good enough. For the price you get a lot and they are consistently expanding services. It even integrates with Lowe's Iris products. Not sure why the site keeps putting my picture sideways.",
            "author": "Tony",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "0b7afec0-53c7-5a9f-9e5b-c369fd96e7f0",
                    "largeName": "122100ad-1b65-5633-b8f4-a933fb1d3116"
                },
                {
                    "smallName": "98ed9e60-23e8-5e3b-88c4-4734f782387b",
                    "largeName": "22323638-ea55-5e60-a4d1-dcfc96af7e6f"
                }
            ],
            "title": "\"Home sweet home\"",
            "rating": 4,
            "date": "12/10/2018",
            "recommended": true,
            "text": "I've had a google home since they came out and love it. great music, controls my hue lights and answers questions like a champ. this one I customized to match our bedroom which is another nice extra. I have only 2 suggestions. first at full volume like my wife enjoys it has a lot of trouble recognizing \"hello Google\" even when I yell. second all my devices including my phone and other rooms try to answer at the same time. I still highly recommend this for yourself or a gift.",
            "author": "Bryce",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "dd4d667c-573f-51c1-96d5-b1e319c10433",
                    "largeName": "1a803b0e-33c7-508a-a3db-05cebad327a8"
                }
            ],
            "title": "\"1st user of google home\"",
            "rating": 4,
            "date": "01/17/2019",
            "recommended": true,
            "text": "I was excited when I got my google home. Having tried Alexa in the past, I wanted to see how this would compare. The packaging was amazing and the install was super simple. I had to download the app to my Android phone and Apple Ipad. \n\nThe Pros:\nI took a few minutes to set up the google home but very user friendly. Google home is the right size for the space I have it in, It's not bulky nor takes up a lot of space. I like the features that google home has. I can set an alarm or alerts. I travel often so having access to the weather quickly is a plus. I can play both spotify and pandora, google also lets you call individuals on your contact list.\n\nThe Cons:\nIf I am not using the wifi on my android I am not able to access google home on my device, It will not show up unless the wifi in on.",
            "author": "Foster",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "1f4665eb-1e1d-5f31-b4b6-96ff6dd5e650",
                    "largeName": "727dcef8-69e6-593e-929d-d176b193f73e"
                },
                {
                    "smallName": "a15da48a-7196-5b9a-a8da-31537c387d90",
                    "largeName": "74d646e5-e2fe-5879-b03f-d36be8e8cfc7"
                }
            ],
            "title": "\"Google Home Review - Google Wins\"",
            "rating": 5,
            "date": "01/11/2019",
            "recommended": true,
            "text": "Google Home: Been using this for about 5 weeks. This is the standard version of the Google Home devices. (Max is top tier, Mini is smaller version). The Home works well as a speaker and smart device. It provides weather, trivia, music, and compares well with all smart home devices. Google is easy to trust with their line of technology products.\n\nWe have two minis, a Home, and a Home Max in the house. This can be confusing if you're trying to play music as you typically set one device as the primary music speaker. If you're in the bedroom and ask to play music, it will often begin playing in the living room. I'm still trying to figure that out. It could be 'user error'.\nYou can link multiple music accounts (Pandora, Google Music, Spotify + more) to your Google Device. You do have to be specific when asking it, otherwise it will go to the default setting.\n\nPros: All standard smart home routines work great (similar to Alexa). Speakers are good and better than your phone or the Alexa Dot we were using. The morning and evening 'routines' are great. You can configure Google to give you weather, traffic, news, play selected music, or none of the above each morning or night just by saying, \"Hey Google - Good Morning or Good Night\". *Good night also asks what time to set your alarm and will play various sleeping music. These features alone make us like it more than the Alexa Dot. I do like the touch feature for volume and play/pause on the top. This faster than voice commands if you're nearby. \n\nCons: Having multiple devices can be confusing as to which speaker will play music for you but the sound quality is better than the competitor's products. Having multiple music website choices force you to be specific when asking for a specific song and if your 14 year old daughter makes changes, then it's changed for everyone. >: Ha-ha. \n\nRandom: Alexa seemed to have more corny jokes and a daily fun fact as part of her 'Good Morning' routine. I miss this but the Google Good Morning routine is better and more functional, in my opinion.\n\nSize: (see photos) It is very similar in size/shape to my wife's essential oils diffuser. Not sure if it made sense to pair them together but it works. I included a photo beside a standard water bottle to show the size because the box is larger than the actual device. This is not too bulky and could go anywhere but does require a power cord. \n\nOverall: We are really enjoying the Google Home experience. We really enjoyed the Alexa Dot but Google, in typical Google fashion, has extra perks that rate it ahead, in my opinion.",
            "author": "BAintheBoro",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "c4485272-56a7-52cb-9aed-6a6668a53aff",
                    "largeName": "bffd59f7-a531-5e04-b267-72ceae556611"
                }
            ],
            "title": "\"Fun and Entertaining, need to support Samsung Tv\"",
            "rating": 4,
            "date": "09/08/2017",
            "recommended": true,
            "text": "works pretty well for what ever we speak. it understands every thing. some times doesn't recognise when we push volume to high and play something and ask some questions. Calling feature is added which is pretty awesome. Unable to connect to my Samsung tv. would be perfect if it comments.Audio output is pretty good compared to competetion.",
            "author": "KRISHNA",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 14,
                "no": 3
            }
        },
        {
            "title": "\"Good, needs work\"",
            "rating": 5,
            "date": "03/11/2017",
            "recommended": null,
            "text": "I have tried both, I went with AMAZON DOT first and loved it but I wanted bigger speakers so I returned it. The ECHO was out of stock at the time so I decided to try out the Google home. The Google home can answers a lot more questions, stock, eta traffic, etc.. however can not understand you as well as the Amazon products. I find myself screaming at the Google home, if they can fix what you call it and how it hears you I think the google home is better choice/ but for now go AMAZON.  Both choices will get smarter and better. Love the idea for both units.",
            "author": "RUSSSSSSSS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 32,
                "no": 9
            }
        },
        {
            "title": "\"Unbelievable !!!\"",
            "rating": 5,
            "date": "02/01/2017",
            "recommended": null,
            "text": "This product will change the way you live and I see no way that's bad I have one I'm so in love with it I purchased my mother one my best friend 1 folks there is no downside I have it operating my nest thermostat my Hue lighting my Google Chrome cast and for 129.00  honestly I don't know of a single person that's not been happy with it now keeping in mind it is an attempt and see but it does learn and it will get better over time with improvements I'm on my way to Lowe's today to buy another one for another part of my house I think I'll have one in every room.",
            "author": "Palmspringsmarty",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 37,
                "no": 15
            }
        },
        {
            "title": "\"You will find you can't live without it\"",
            "rating": 5,
            "date": "02/01/2017",
            "recommended": true,
            "text": "I remember when microwaves and dishwashers and sell phones off first came out I was a skeptic oh I didn't need one of those items and now I find them absolutely invaluable well folks I'm here to tell you Google home is just like your most prized appliance but better don't take my word for it try one for yourself  I recommend them to everybody I've bought five of them so far for friends and family and three for my home.    Easy to set up an amazing how fast the responses are.  It's like having your very own Einstein living with you it's almost magical",
            "author": "Martypalmsprings",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 23,
                "no": 10
            }
        },
        {
            "title": "\"A critical piece in any home automation system\"",
            "rating": 5,
            "date": "02/11/2017",
            "recommended": true,
            "text": "I used it with SmartThings and Harmony Hub to control my lights and TV.  It can even close my garage.  Albeit if you want it to control you home you will need to spend money on other gadgets (i.e. SmartThings, Harmony Hub, etc.)  It is also very useful by itself.  It can answer many questions the Amazon Echo doesn't even come close to answering.  It only gets better with updates.  I'm waiting for the price to go down to get a second one.",
            "author": "Johnny",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 36,
                "no": 8
            }
        },
        {
            "images": [
                {
                    "smallName": "ffa96bf1-c195-5c2b-92dd-39a779e3096a",
                    "largeName": "532da5f8-4dd4-5356-814a-1693bb3606a8"
                },
                {
                    "smallName": "e2fa52ad-4ae3-5076-9dd3-9d7a62c02344",
                    "largeName": "0f284331-2e1f-5381-abf6-f16a9f7c6641"
                }
            ],
            "title": "\"Still developing\"",
            "rating": 3,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Works good for playing music at a moderate level or setting an alarm. Does the same thing as the other devices in the google series. Would hold off on buying it till you have more devices.",
            "author": "Jer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Hey Google, You Are Awesome\"",
            "rating": 5,
            "date": "08/15/2017",
            "recommended": true,
            "text": "I love my Google Home. I can ask about the weather, how to spell a word, add reminders/appointments to my Google calendar, ask it to play songs, Google all kinds of questions and tell it to add something to my grocery list. I have the Home app on my phone so when I go to the store my grocery list is already there. My kids and hubby can't easily say, \"Hey Google, add (whatever item) to my list, and it will show up even while I'm at the grocery store. Now there are no more excuses for not adding something to the list. I'm going to get a Chromecast so I can control my TV.",
            "author": "VeronicaC",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 1
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "12/08/2018",
            "recommended": true,
            "text": "I have been very impressed with the ease of set up of all the Google products. The easy start card is just that easy. \n\nThis unit is larger than the Mini and has better sound, richer base tones, and is Bluetooth capable. I t also has two mikes built in so it picks up your commands better. If this was to be your first unit I would say good choice. If it was an add on then consider the two Mini pack. The sound is not that much better.\n\nAt first these units were just neat to have, but as I get more accustomed to them I find it more and more convenient to use.\n\nI love being in a room and asking Google to play music from Pandora and just relaxing.",
            "author": "ToyMan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Home Assistant\"",
            "rating": 5,
            "date": "05/17/2017",
            "recommended": true,
            "text": "Great product, not just to get answers. I can control all kinds of products feom Lights,  Sprinklers, door locks, thermostats, cameras and much more. If you have and use a Gmail account for your calendar and mail, this will make your day much easier by letting you know what's going on in your day even to make calls and detail recipes for you to cook. I definitely recommend over older similar products. 5 stars.",
            "author": "JoeShmoe",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 17,
                "no": 3
            }
        },
        {
            "title": "\"Like Having a Smart Friend\"",
            "rating": 5,
            "date": "12/12/2018",
            "recommended": true,
            "text": "The Google Home is a great unit to have for setting alarms, listening to your favorite tunes, and asking questions like what's the temperature or how many cups in a quart. Just say \"hey Google\" and tell it to play some B.B. King on YouTube Music or Spotify or even your favorite FM station, set the volume with your voice. I've found this to be a very helpful item and I'm surprised how often I ask it something. Just a couple of weeks and it's become normal. I'm a 72 year old retiree but found this unit amazingly easy to set up and use. The Home system does require a cellphone app and wi-fi but nowadays most homes meet those requirements.",
            "author": "Jim",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "d1c2e581-daf6-56ab-98e2-ad1ff67bdae9",
                    "largeName": "4db39367-df5c-5bc3-afa9-ced22603d934"
                }
            ],
            "title": "",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "I have received this product and I'm going to start out by saying it sounds pretty darn good. The set up and features along with this product remade simple with Wi-Fi set up. When you just talk into the Google part of it with the Google commands it recognizes your sound of the voice. Via the app you can add distinct features you would like to accommodate your unit. The packaging part of the home was not a box with little to no moment. I would recommend this product to friends and family. Crank the music and relax is what the Google is made for.",
            "author": "catman600",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome Product. Very Sensitive Responsive Mic.\"",
            "rating": 5,
            "date": "01/31/2017",
            "recommended": true,
            "text": "Product works as expected and can be used handily if you are tied to the Google ecosystem. It also works with a range of third party accessories for home automation. The only downside that I can foresee is that it can only be tied to one account instead of having multiple for different people in a household.",
            "author": "Josh",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 57,
                "no": 18
            }
        },
        {
            "images": [
                {
                    "smallName": "8441a3bf-d5c6-56bd-a9d0-734161393526",
                    "largeName": "82b68e43-b578-566f-920b-39a6496c56e4"
                },
                {
                    "smallName": "b41fec13-dd55-5297-a7f1-d19b4e721103",
                    "largeName": "438834f6-f544-5779-82c8-4f7d4d4e0941"
                }
            ],
            "title": "\"The Must Have Of all Google Items\"",
            "rating": 5,
            "date": "12/18/2018",
            "recommended": true,
            "text": "The Google home device is the brains of of your goggle products in a way. It can send and control all of your Google devices as well as many other brands of wireless devices made today. A great thing that has been added is a remote battery that can last up to 8 hours of use. Here is a link to it. (https://ninety7.com/products/loft-portable-battery-base-for-google-home?gclid=CjwKCAiA0uLgBRABEiwAecFnk5RSzBeGIKnc5yx0fnDC091HWaG9163MG-r1fKGMDcI7l07yJs8eXhoCFDgQAvD_BwE&variant=52869588619)\nWith this you can take control anywhere in or out of your home and not have to worry about plugging it in for power and control. This is very easy to set up, download the Google App to what ever phone you may be using to set this up. Once you have the app downloaded and your Home Device plugged in, the App will do most of the work for you. It will ask you easy questions that you answer with the App. It will automatically connect to the WiFi you select, no passwords needed and its ready to go. As you add more devices to your system you will be able to do some amazing things that other systems can not do. You can use it as a intercom in your home. So if you have Google Minis in each bedroom you can just say ( OK GOOGLE BROADCAST) and then what ever you say will be heard on every Google Item in your home. One other great thing you can do is Broadcast from your phone from anywhere to your devices at home. Saying something like, I will be home in 10 minutes, be ready for dinner. Everyone will instantly know your on your way. I don't know any other devices that can do this for the great price you can buy this system for. You can constantly add more devices to your system as you want. What more can I ask for? Its a great price, easy to use and controls 100s of items. Many items that you can not get to work with the competitors controllers can be controlled by Google Home!",
            "author": "Bomber1955",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"confusing\"",
            "rating": 1,
            "date": "01/02/2019",
            "recommended": false,
            "text": "I will admit that I'm NOT a computer genius, but all these Google Home products are IMPOSSIBLE to get working. I tried for nearly 2 weeks to get the products to function, with no luck. The odd thing is, I had NO PROBLEM installing and using Alexia, you simply download the app and connect, not with GOOGLE. I just found out today (1-2-19) that Google does NOT allow you to download and install ANY of its products on a Laptop OR Desktop computer, you MUST use a Tablet. Which is a complete joke, now I have to go buy a tablet if I want to use any of the Google products I have, (Home assistant, google TV, Mini, Speaker, etc.).\nNOT HAPPY............................",
            "author": "fix-it-guy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 4
            }
        },
        {
            "images": [
                {
                    "smallName": "1485954f-cb28-5f71-91c6-f2dc6bd9db79",
                    "largeName": "41a9a5fd-fec8-58c2-bacd-cf9407fa2cf6"
                },
                {
                    "smallName": "ba974316-8c1e-5e2f-bb86-b7d77cbaa52e",
                    "largeName": "3b1f57a0-8b3c-5ec8-8aab-406b0d31fa9f"
                }
            ],
            "title": "\"A GREAT START TO A SMART HOME\"",
            "rating": 5,
            "date": "12/27/2018",
            "recommended": true,
            "text": "BACKGROUND: I had been researching the smart home devices and systems but was unsure which company to use. The opportunity to evaluate the Google Home was too good to pass up. By the time is was over we had seven (7) different devices. \nFIT AND FINISH: I received the Home Chalk color, an off-white, which is unobtrusive. This is the poster child of Google Home for me. Bigger than the Mini, smaller than the Max, it provides the “Just right” functionality of a smart device.\nINSTALLATION: Simple. Take the unit out of the box, download the Google Home app, plug in the power, and follow the instructions in the app. \nOPERATION: The app is the main control point for the device and offers several customization features. \nThe Home offers all the smart home capabilities of the other Google Home devices. If's sound ability is deeper and louder than the Mini, but not so awe inspiring as the Max. I have it in my office and it is perfect for quiet mood music or louder concert music. I think the sound quality is equal to the smaller Bose speakers I have been a fan and user of since the ‘90s.\nGoogle home devices are advertised as a voice recognition devices and all devices (Home, Mini, Max, Hub) provide the same Smart Home features, although Home Hub has a display. I found the Home great at voice recognition. You can train the Home to recognize your voice. Even with conversations in a room it can distinguish a voice it is trained to. When you associate different personal accounts, mail, calendar, and media streaming the Home creates a personalized response. If I ask for my schedule it give me my calendar information. My wife receives her calendar schedule. The Home will respond to other voices but will not give personalized information. \nThere is a learning curve associated with how to ask for a response. There is a lot of information on the internet, but no definitive source. (See CONS below.)\nPROS: Fairly easy to set up and use. Provides smart home control. Good sound and quality! \"Broadcast\" function acts like a home intercom! I used the broadcast function, via Google assistant to talk with my son while I was several miles away! And with a Mini in my shop my wife and I can communicate quickly.\nCONS: It is difficult to determine what the Google home systems can do. There is no easily accessible manual, list of features, or troubleshooting. To me this is a major drawback to a voice response system. Too many times I asked for something and got a response like “I'm sorry, I can't do that yet.” The main point of contact is the Google support website chat feature. I found the chat to be helpful, but very time consuming. I even asked the chat technician where I could find the answer to a question online and he was unable to find it via publicly accessible means. Ironic I can't Google an answer for a Google product!\nSUMMARY: If you want a Smart Home device, the Google Home is a good answer.",
            "author": "Pete",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Easy to set up the Home, so many ways to use it\"",
            "rating": 4,
            "date": "12/15/2018",
            "recommended": true,
            "text": "I got a Google Home to use in my family room so I can ask the Google Assistant to tell me the news and local weather and play music while I'm eating breakfast. It was very easy to setup and doesn't take up much space. I first downloaded the Google Home app on my smart phone, launched it, and added my information. Then I plugged in the Home and added it to the Home in the app after it connected to the WiFi. As a test, I asked the Assistant what the weather forecast was and it told me. Looking forward to learning about all the other ways I can use the Home and Google Assistant such as adding a Home Mini and grouping them together to play music throughout the house.",
            "author": "scooter55",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home Device\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "I am extremely pleased with the Google home device that I have received under the Lowe's loop program for evaluation and have found it to be far superior to the Alexa devices that I have in my home and office.I am also very honored and thankful to Lowe's loop program for offering me this device for evaluation and usage. The Google home Device I received works very well with other Google devices that I have throughout my home and office and I'm very pleased with its performance and would recommend it to anyone who is looking for an alternative method of controlling other Wi-Fi devices throughout their home and office .",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"This is very handy to have around\"",
            "rating": 4,
            "date": "09/28/2017",
            "recommended": true,
            "text": "Our family loves our Google Home. My 9 year old likes to ask it questions all the time, or how to spell certain words. It can not detect my daughters little 4 year old voice, which upsets her :) We mostly use our google home to listen to music or set timers. You can play a fun trivia game, set alarms etc. She is still learning a lot, but we find her very helpful in our home.",
            "author": "Shell",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 13,
                "no": 4
            }
        },
        {
            "title": "\"Very cool love my smart home\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "Set up was so easy already have a google account, download the google home app plug it in connected to WiFi so fast. About 6inches tall doesn't take up much room om my counter and looks like a fancy air freshener. Love the colors when listening to me. My favorite part she understood my New England accent all the time. I asked tons of questions and for the most answered all of them . I'm using it as my daily reminders and it's doing its job. Tried out all the different voices but like the original the best. Although this is very new in my house and still learning I think I'm going to love my new tech home very much.",
            "author": "Kathy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Space saving instant assistant\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "This is a great space saving instant assistant that you can use hands free. Right out of the box and simple set up and down load the app on my phone we were done setting up in about 15min. The longest part was deciding where we should place this Home in the house. Make play lists for every member of the house and have party play lists for kids and adult parties. Love being able to ask for help and tips while cooking so I do not have to stop what I am doing. The kids love it to help with doing homework. The sleek design fits in well where ever you place it as it has slim lines and fits easy on a bookshelf or table.",
            "author": "ArmyTaekwondoMom",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Better Than The Echo\"",
            "rating": 4,
            "date": "12/14/2017",
            "recommended": true,
            "text": "I have both the GglHome & Amz.Echo, and as far as sound, and only having to ask the device once (not multiple times like you're talking to an elderly person with a bad hearing aid) to play a particular song that I like, the Google Home is way ahead. I can't compare how each works with smart home devices because I haven't installed that feature yet, and even if the AmzEcho is ahead of the game as far as being able to connect with more devices, I would sacrifice having the few devices that the Ggl Home does works with, just because it's the more responsive device. I like the fact that after you ask the Ggl Home to play a particular song for you, it continues to play similar songs to the previous song you requested, that's cool, it doesn't do that on the echo(it just plays the one song you requested).",
            "author": "Blackhorse20",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 1
            }
        },
        {
            "title": "\"Fantastic Assistant\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "Google Home is an unobtrusive little speaker tower that sits happily on my kitchen buffet waiting for instruction. Any questions that I have are quickly answered by a pleasant female voice...”Hey Google, what is the weather forecast today?” \n“The forecast for Georgetown is....” . As I wrapped presents, I said, “Hey Google, play holiday music”, and Bing Crosby started crooning. Hey Google, turn down music... my wish is her command. Hey Google, turn on rock music in The guest bedroom... Hey Google, turn on the light in the bedroom... I can see the possibilities are endless when paired with the many Google Home products that are compatible with this marvelous home assistant..",
            "author": "HandyBecky",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Product!\"",
            "rating": 5,
            "date": "06/19/2017",
            "recommended": true,
            "text": "Helps me with everyday things from turning on my lights to telling me the weather.  Google.com",
            "author": "Alexbob",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 8,
                "no": 1
            }
        },
        {
            "title": "\"Google Home is great for the kitchen! Love it!\"",
            "rating": 5,
            "date": "12/15/2018",
            "recommended": true,
            "text": "I did an unboxing video for this product to show how easy it is to get setup and using it. It's literally plug and play. The app you use is super easy - the only trick is that you need a gmail account to get going but I had that so it was easy - I just had to login. I put this unit in my kitchen and I use it all the time - way more than I thought it would. Telling Google to play music is one of my favorites - I use different streaming services. Asking if the place I want to eat is still open. Checking traffic before I leave for work - telling Google to add something to my grocery list. Asking what time it is. There are so many things. Asking Google to tell me a joke. The list goes on and on. I set up my smart home features so I can change my thermostat and turn lights on and off. If you want easy access to an assistant this is it! I highly recommend this product.",
            "author": "candy1land",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "f56dea5c-43f9-52ba-9693-3a845b5470c6",
                    "largeName": "1b423c2c-8556-5765-9865-a7519e1b11ed"
                }
            ],
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "12/24/2018",
            "recommended": true,
            "text": "I highly recommend this product. Google Home is so easy to setup. All you have to do is download Google Home in your App Store (for apple) and Google Store (for android). From there it syncs the device to your home WiFi router and it's smooth sailing from there on out. You can set reminders, play any music, ask the Google home pretty much anything. I have this one located in my kitchen. Thanks Lowes and Google!",
            "author": "Adam",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "79dd1e5e-0663-546b-b54e-04de38ad6f55",
                    "largeName": "85f2fe12-1fd1-51d1-a5d3-450fab7ec669"
                }
            ],
            "title": "\"Good Product\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "The Google Home is a good small speaker system. The sound is good and the volume can be adjusted from very low to very loud and the sound is good at all levels. The volume is controlled by voice or by a finger on top of the device. Clockwise increases volume and counterclockwise decreases the volume. There is a pause button in the middle of the top. There is also a mic off button on the back of the device. The device is approx. 6x4x4 inches but has very rich sound for such a small speaker. The Google assistant is very entertaining to use and can provide almost anything you can ask on the Google search website. The speaker was easy to setup with the Google Home app and all you do with the speaker is plug it in to an outlet. It works with most of the music services but not with Amazon Prime. I recommend this device to anyone who loves music and likes to ask Google a lot of questions.",
            "author": "Mandrake",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Fantastic smart home device!!\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "I love the Google home system. Not only does it look great but it sounds great when you are playing music through it. You can put one in each room and play music throughout your whole house so you never miss a beat while you are doing your housework. If you don't want to give vocal commands, it does have a switch to turn off the microphone. The app is great and easy to use so set up is quick so you can get back to what you want to do. It sound just a good as my bose and it has fantastic bass. I love these speakers. You can also control you lamps with you voice so no more trying to find a light switch in the dark. The Google home system is a must have and makes a perfect gift for anyone!!",
            "author": "Unicorn241982",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "8ca80410-41db-532a-96d5-8b6dedaa8f54",
                    "largeName": "b07511c0-b344-50b0-8bcb-22b4cc321701"
                }
            ],
            "title": "\"Very cool device\"",
            "rating": 4,
            "date": "01/13/2019",
            "recommended": true,
            "text": "This is my first experience with any of these smart home devices. I gotta say that they are pretty cool and capable of doing a lot. Initial setup was very simple, I had it up and running in about 10 minutes. It weighs maybe 3lbs and feels built well. It is actually able to connect to my LG TV and control a lot of features on it. The main reason why I give it 4 stars and not 5 is the lack of instructions. The box basically comes with an instruction manual that was a few pictures showing what to do and that was it. Setting it up to connect to my TV and control it, like raising the volume, playing Youtube, etc, took me about 2 hours to figure out. I eventually figured it out but there are still some issues. Again, trying to find guides online was very difficult as there were not many. Until Google starts generating some better-detailed guides, I cannot give it 5 stars, however, I do recommend it.",
            "author": "SquaredAway249",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "01/06/2019",
            "recommended": true,
            "text": "First off let's start off with stating my tech skills, it is moderate at best. I found the set up of this product very very easy to do. Simply download the app and plug in the Home. Follow the questions on the app and just like that you have all the features. In no time at all I was playing music from the speaker. I am just hitting the tip of the iceberg on all the different features. I can get sporting scores updates. Temperature and weather forecast are as easy as \"hey google what is the temperature outside\". I would recommend this to anyone if you have WiFi access in your home/apartment. I can't wait to expand my uses for the Google Home and add additional items for the unit to control.",
            "author": "Greg",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Not bad, but the Echo is better\"",
            "rating": 2,
            "date": "03/03/2017",
            "recommended": false,
            "text": "I tried both the Amazon Echo and Google Home. I found the Google Home to be slower than Echo. I also found the Echo did not answer as many questions, although I found Google Home getting many questions incorrect. This caused me frustration. I would hear an answer but the answer seemed off. I would look it up online to find out the correct answer. I also was surprised the Google Home did not support Insteon. I could not control any of my smart switches with Google Home while the Echo worked flawlessly.",
            "author": "Bob",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 19,
                "no": 31
            }
        },
        {
            "title": "\"Really Easy to set up and fun, very useful...\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Just to set this up properly, I am a baby boomer who knew dial up modems and rotary phones. This system is super intuitive and very easy to install and set up using your existing Internet provider (ISP). Using Apps to set up takes maybe 10 mins max. Once set up, it is fun to use and when cooking with hands covered in dough, asking it to set up a timer or continue instructions on a recipe (yes it can do that) is great. Add in me being lazy and asking for a forecast or outside air temp just completes the usefulness. It will also expand and link to TV and allow voice commands or phone app commands for starting / stopping video, music, photos etc....just starting to figure out those many options.",
            "author": "TJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "545a3f88-78c1-5814-8a80-23965f59c035",
                    "largeName": "f6109fc0-fc48-5b39-9bc5-760efe4d3c3f"
                }
            ],
            "title": "\"Google Home\"",
            "rating": 4,
            "date": "12/13/2018",
            "recommended": true,
            "text": "Okay the design is sleek and it's got a modern look to it so it fits in any space. You can interchange the bottom base color standard comes in grey. Its top touch allows you to turn volume up and down in a circular motion and then touch to pause and resume music which is pretty convenient and easy to use. The only reason I didn't give it a five star was because it actual went down on me one day and I couldn't tell why (if this happens just unplug for 10 seconds and plung back in and it should work), then also if you have several of these throughout the house in a bit of a close proximity they all answer when you say Hey Google. It would be nice to have a call out like Hey Kitchen Google, Livinging Room Google etc to distinguish which specific Google you want to talk to. But overall this is a really good product and I like it in the kitchen to ask questions for recipes, ideas for dinner, and tell a joke when I need to laugh.",
            "author": "DT",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "12/20/2018",
            "recommended": true,
            "text": "The Google Home was easy to install using the Google App on my smart phone. We installed this in our great room. We have an ever changing musical concert in the house most of the day. We also use it to find out about the weather, set an alarm when we have an appointment, and use it to get all kinds of information. If we are going to a nearby attraction we can ask how far and long to get there. Very handy to have and easy to install and use. We're going to connect it with our smart TV but haven't yet. Love this thing.",
            "author": "Ned-44",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Google home\"",
            "rating": 5,
            "date": "12/12/2018",
            "recommended": true,
            "text": "I love the google home. It was easy to set up after I downloaded the google home app. I just followed the directions and in a few minutes, i was listening to music. My wife likes it because she can ask it about the weather and other things. I was surprised how good, the speaker sounds,when it plays music. The unit itself is not very big, but the sound is very good. It is supposed to be able to make phone calls for you, but we haven't figured out how to do that yet,im sure we are doing so little thing wrong. My son has the echo,but i like this one better. I think it will do more things.",
            "author": "Jim",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Google Smart product\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "This is a GREAT product. Small, discreet and not an eye sore. Very easy to setup, takes maybe 2 minutes. Most importantly, it's very easy to use. You don't have to speak loudly for it to hear you. I also have 2 Home Mini's and a Home Max spread throughout the house. You'll need to download the Google Home App to control and even create a group with whatever speakers you choose to play music on. The sound on this product is good, not great. It's little speakers so what do you expect. There are alot of features and it seems like there's more coming. Again I say, this is a GREAT product!",
            "author": "Taz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "I was skeptical at first as I have rarely seen advertising for the Google Home. But after checking reviews I was surprised at the positive comments. \nMy observations. First I was pleased at the minimal packaging what wasn't recyclable. I plugged in the unit, downloaded the app and created an gmail account. Using the app to set up the home was easy. It took less than ten minutes and the Google Home was set up and ready to go. Response time was excellent and volume control easy. I located this unit in my kitchen and have used it for music (I use Pandora) but almost any streaming service works. Recipes were easy to follow as I do the cooking. Day by day I find more reasons to be happy with my purchase.",
            "author": "JimS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Its ok.\"",
            "rating": 3,
            "date": "12/11/2018",
            "recommended": true,
            "text": "When this first came out, I thought, holy cow this is great and I can't wait to get one. Now that I have one, its like, ok now what. It was easy to set up and a breeze to maintain. I managed to link it to my nest locks and thermostats. After making sure everything worked properly, I started asking some generic questions which were answered pretty easy. I wanted to play my iTunes library through it but found out you could not do that which I find very disappointing. Ok, so after asking a bunch of questions, finding out the weather and it telling me some jokes, what do I do with it?",
            "author": "Bo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "images": [
                {
                    "smallName": "db8ec215-7f9e-5ba1-af1a-ccd20db8286c",
                    "largeName": "c54d2672-dfe6-5e0c-ad66-ca14fb77d8b7"
                }
            ],
            "title": "\"Incredible Control\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "I've only scratched the surface with the Google Home. First, its voice is very realistic. I expected something on the order of a GPS voice. In fact, it sounds so real that after asking it for the weather, or to set an alarm, I'm tempted to say \"Thank you\", following its response. I tried all the different voices, but the default is best. As a stand-alone music player it sounds very good. I removed the radio from the area. I'm impressed with its music library and happy that Google does not charge for that service. I also asked it to tell a joke or two and they were the kind that the kids can listen to. All in all, this is the kind of product that once you try it, you won't want to do without it. It is well made and somewhat heavy for its size. It is unobtrusive and looks nice enough to be placed anywhere. And, finally, though it is useful for anyone to have, it probably would be great for the elderly or handicapped. I like the Google Home and will enjoy many moments learning about it and asking it more and more questions.",
            "author": "Alrod50",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "5cfd57b2-240b-5c32-9ead-3a90dfdf8dfd",
                    "largeName": "c1b958b4-f57c-5a1d-9a72-593293757679"
                }
            ],
            "title": "\"Super product\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "This base has a great rich sound. It performs all of the things expected out of a google product and more. We have been very pleased with the performance and each day, we are finding more and more uses for it. We are very happy and satisfied with the google home.",
            "author": "JEB",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 2,
            "date": "12/10/2018",
            "recommended": false,
            "text": "I have given this 2 stars because it does not come with instructions other than plug it in, go to website. It seems everything anymore requires the user to download and print instructions. I have decided anything that does this to me gets no more than 2 stars. I should not have to spend additional monies (internet. printer, paper, etc.) to get something to function. In addition, I found no anti hacking safety, nor did I find anything that prevents others from listening in to conversations in the household. I suppose that if one had a huge house and needed to spend additional money for subscriptions to music apps etc., it might be okay. But this provides nothing I can't get online from (gulp) cable or Sirius radio at less cost.",
            "author": "Rick",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "\"Google home the better alternative\"",
            "rating": 5,
            "date": "08/25/2017",
            "recommended": true,
            "text": "Google home is great with voice recognition. Calling by WiFi. Emergency services not available yet.",
            "author": "CHRISTOPHER",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 1
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/01/2017",
            "recommended": true,
            "text": "Works with Smartthings outta the box! Great voice command assistant to control all the Z-wave devices throughout the house! \"Hey Google, lets watch Sherlock on livingroom TV\" voila! Chromecast starts playing next episode from where you left off!",
            "author": "Ty",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 12,
                "no": 8
            }
        },
        {
            "title": "\"Hey Google, thanks!\"",
            "rating": 5,
            "date": "09/06/2017",
            "recommended": true,
            "text": "Nice speaker, for small room is the best choice, decent features.She can advance your enjoy with music services like Spotify, Google Music etc. Need to understand that google home is still updating and new things are waiting, i.e. recent update that released pairing by bluetooth.",
            "author": "SunnyPRO",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Google Home the start of my smart home!\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Google Home is a breeze to setup using a downloadable phone app. I was really surprised how sensitive the microphone on it is; it picks up commands from 20 feet away using my normal voice. We have it in our kitchen and my wife loves how easy it is to get recipes or to place an order for home pizza delivery. The speaker included plays YouTube music without distortion. It also controls your thermostat with the optional Nest hardware and your lighting with the Google Mini. \nI could go on and on, but I'm glad I've added this to our home and I highly recommend it.",
            "author": "RoyMd",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best automation Gadget\"",
            "rating": 4,
            "date": "09/10/2017",
            "recommended": true,
            "text": "Helpful in many ways in automation during our busy schedule! Gives more information with single question! Can incorporate more features and easy accessibility without paid subscription!",
            "author": "Sap",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 2
            }
        },
        {
            "title": "\"working so far\"",
            "rating": 4,
            "date": "01/08/2018",
            "recommended": true,
            "text": "I haven't yet made full use of all it can do.  Mostly now I'm using it for music as I have Google Play music service.  Since I listen to mostly Hawaiian music, it sometimes has difficulty understanding.  The sound is pretty amazing considering the size of the speaker.  I've also connected it to a smartplug to control a roof gable light and it's working for that.  I'll be adding more smart things in the near future for other things.",
            "author": "TheCeladon",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 1
            }
        },
        {
            "title": "\"Great product individually and as a group\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "I think I am one of the perfect people to review this product. I was an Amazon Alexa person / household for many years.it wasn't until recently with the new home hub and show that interested me in either expanding my products around the house or converting to the Google brand. With this offer I am a convert. I received the Google products and started to set them up around the house ,moving and changing some as I got more used to them. With all this the app for the products is great and very easy to use. That was one problem I did not like about the Alexa too much to jump through to get the skills. This was the first time for me to set multiple products up and set up different speaker groups was great. Highly recommend all parts of the Google home line.",
            "author": "Machristy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great sounding Home\"",
            "rating": 5,
            "date": "12/24/2018",
            "recommended": true,
            "text": "This is a great sounding speaker. I use it in my kitchen and it's perfect for listening to music or the news ...it's a great assisant for recipes and as a timer. It's unobtrusive on the counter. I have this Home synced with my Home Max in the living room and the mini in my bedroom. They're my new favorite toys in the house! I've even purchased the minis as Christmas gifts. \nI really think that if you want a great quality sounding WiFi gadget that the Home is perfect. It's affordable, the bass sounds great! Makes a great gift too!",
            "author": "Aya",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Super assistant\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "This is a hundred times better than the old \"clapper\" sold on TV. PLUS it can do so much more. \nI am 75 years old and my daughter had given me one of these from Amazon last Christmas and after trying to set it up almost a year ago . . It was unplugged and I lost interest. It was too difficult to set up for a senior without help. THE GOOGLE HOME however has thus far been easy to set up by myself and I can see where it can make my life alot easier. I received this item to review and will be adding more comments on the additional accessories I also received to review as I get them added into the setup. It appears that Google HOME has more home accessories to help organize your home. I can hardly wait to have everything in place. This is something to get excited about!",
            "author": "InkysMom",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"It's very limited outside supported countries\"",
            "rating": 3,
            "date": "09/01/2017",
            "recommended": false,
            "text": "Won't set reminders, won't make phone calls.  All clearly explained by Google, but a shame nonetheless.  Otherwise good for playing some music, hearing news, as a good separate speaker, for web lookups and searches.",
            "author": "sp",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 6,
                "no": 6
            }
        },
        {
            "title": "\"Great Product\"",
            "rating": 5,
            "date": "12/20/2018",
            "recommended": true,
            "text": "I really like Google Home, because I think it would suit anyone. \nIt's big enough to have good sound for listening to music. \nAnd it's small enough to fit in any setting and decor. It doesn't need much shelf or table space.\nThe touch controls are super accessible on this device. Sometimes I'd rather adjust the volume manually,\ninstead of giving a verbal command.\nI appreciate being able to easily turn off the microphone, too.\nThe design of the rubber base, and the way the unit is weighted, makes it super stable.",
            "author": "Jerry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Modern Convenience\"",
            "rating": 3,
            "date": "01/16/2019",
            "recommended": true,
            "text": "This is a handy little device if you want to know the weather or the traffic in your area or have it find facts or look up information on the internet without having to use a computer. It will also sing happy birthday to you on your birthday when you wake it up. If you install other smart devices in your home like lights, locks, thermostats or sprinklers, you can control those devices through the speaker as well. It is a great device for lazy people that don't want to get up and flip a switch, lock a door or adjust the thermostat. But it can also be a great assistant to disabled persons that are unable to easily perform those functions. Personally, I am a bit leery of it being hacked and then have someone spying on me like they have done with nanny cams and baby monitors.",
            "author": "JaJu",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very Functional\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "My Google Home is very functional and a great addition to my \"smart home\" that includes smart lights, a Home Max, several mini's, Google wireless router and chromecast. It's great for music in our family room, turning on/off lights, reminders and for general information like weather and appointments. It even helps my grand children with their homework! This is a very versatile product and works seamlessly with my other smart products. The set up was very easy with the Google app. I think it's a must have item.",
            "author": "Trapper-John",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great product\"",
            "rating": 5,
            "date": "01/11/2019",
            "recommended": true,
            "text": "This google home is the one that I would definitely recommend over the others. It's like the in between of the 3 (being the mini and the max). It is louder then the mini while being much smaller and sleeker then the max. I think it is great for a smart home system. If anyone is thinking about getting into virtual assistants, this is the one to go for. Note: it doesn't seem to have the problem the google max does with shutting down my WiFi, it's my preferred google smart home system to use.",
            "author": "Cameron",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "10/30/2017",
            "recommended": true,
            "text": "Love this addition; didn't know I needed it until I got it.  Very easy to get information (weather, trivia, etc.) just by asking questions as they arise.  Also love the music function.",
            "author": "RobertIII",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 1
            }
        },
        {
            "title": "\"Easy& quick set-up\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "The first thing about all of Google's products is the packaging they are putting together is amazing. Also, there are no ridiculously complex manuals with a bunch of mundane instructions. You take it out, there is the device, a power cord and a few cards with some basic straightforward directions. Once I was plugged in this was up and going within a minute. Just launch your Google home app and add the device, if there are updates there may be a few minutes until you can use. Very impressed by its ability to recognize what I say,the only thing I do not like is that when I say \"Ok Google\" my phone is usually near me so it starts its voice recognition as well. Speaker is quite clear for its size as well. I have yet to really use to its fullest but cannot wait to see what other tips and tricks it can do.",
            "author": "JMc",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"NOT Home Alone Anymore\"",
            "rating": 5,
            "date": "01/05/2019",
            "recommended": true,
            "text": "Great standalone device to answer your questions but even better as your home automation hub. Use it with other devices (I received Google products) but understand that it is usable with some other brands as well to control lights and appliances, listen to music around the house, control the thermostat, security devices, etc. Pairing with other Google products is very simple. Would recommend for even the most novice and - if you need help to make it work - ask one of the grandkids.",
            "author": "LugNutz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerful Vibes\"",
            "rating": 5,
            "date": "12/31/2018",
            "recommended": true,
            "text": "This product is easy setup and performs well....The speaker for being small has the sound of a much larger speaker with very good quality...It picks up your voice very good even in a large room...This powerful device can do numerous tasks and control your home making you the “King Of The Couch”...With so many tasks it can do and great speaker quality this device will be the missing link in your home that you have been looking for.....You will be asking “Hey Google Whats The Price”?",
            "author": "Smoky40",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Not as good as Echo\"",
            "rating": 2,
            "date": "03/03/2017",
            "recommended": false,
            "text": "It is slower than the Amazon Echo. I found that Echo doesn't always have an answer, but Google almost always has an answer but it is wrong often times. Also Google cannot control my Insteon smart switches.",
            "author": "Bob",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 14,
                "no": 31
            }
        },
        {
            "title": "\"Super cool device\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "I gave this to my mother because she is bedridden. The setup of Google home was very simple. Voice recognition worked well even with my mothers light voice. I also set up outlet plugs so she can turn on lights. She was so thrilled that she is able to do this. She spent a lot of time exploring its functionality. I like that you can expand it with mini's into other rooms. The speaker had really nice sound for her music choices. I have used Alexa but actually prefer the Google Home.",
            "author": "rubberwheel",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Quality smart device\"",
            "rating": 5,
            "date": "12/13/2018",
            "recommended": true,
            "text": "This is the middle sized home. I have the max and the mini too And I would say for the money,\nthis one is the best value. It has all the features that you want from the home, and the sound quality is very good. I am not a tech nerd and I am probably only using a fraction of its capabilities. I'm working on it and also I want to get some more smart lightbulbs. That's one of my favorite features of this product is it can turn on and off lights with your voice. I like it.",
            "author": "Aardvarkf111d",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Nice assistant and features\"",
            "rating": 4,
            "date": "12/14/2018",
            "recommended": true,
            "text": "Google home is a nice product. Well built, good sound, and nice to use. Takes some time to get used to. With smart bulbs, you can control lights, sold separately. Addditional chromecast module is compatible making your television into a smart tv, with voice command features. One can have two and play music through out your home by making a speaker group, or can be used individually, which makes a nice option for use. Enjoying the upgrade as my home feels a bit smarter.",
            "author": "Swaz",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home Makes Life More Convenient\"",
            "rating": 5,
            "date": "12/14/2018",
            "recommended": true,
            "text": "Amazing technology in this unit. Connected to the internet it is unlimited in what you can get answers to. Weather, news, dictionary, encyclopedia - just unlimited ! Streaming music and some talk radio is what is a very convenient function. The quality of the sound is very good. We have also used it as a kitchen timer and most useful to us is the ability to create a shopping list, just keep adding items as you find you need. Very handy item, I would recommend this!",
            "author": "RA255",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Amazing product for every home\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "It came packaged very well!\nI'll admit I wasn't familiar with the product. Upon using it after such an easy set up, which is done through your iPhone or android, I was so impressed! This little device connects to all the other devices that go with google home. We can walk into our home and with one sentence all our music and or lights turn on in either one or several rooms because they can sync to one another. Great product over all for your home or as a gift.",
            "author": "Lori24",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "I have this product in the Kitchen. It is great all I have to do is say Hey Google play Christmas Music, or Hey Google play Country Music. It makes being in the Kitchen while cooking great. I can say turn light on in the bedroom and it magically comes on. Wow, what a product. Before I didn't have anything like this.\n\nThis product is small and can be located anywhere.\n\nI love this product and would recommend it, family and friends. \n\nKaye Cooper",
            "author": "aukfan2",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google home is fun\"",
            "rating": 5,
            "date": "12/18/2018",
            "recommended": true,
            "text": "The Google Home is sleek and fits well into any decor. As with all of the Google products, it needs WiFi and to be paired up with a phone or tablet and requires the Google Home App. It takes a few minutes to set up the first product, but adding additional products is fairly easy. \n\nThis is a fun, handy little device that can answer questions, give the weather, play music, etc. I would recommend this or any of the minis. While I have not done so yet, I see there are possibilities to expand other items with use of WiFi outlet adapters. Use of hands free devices such of this can be handy at times.\n\nMy only concerns might be security ( but you do have the option of shutting off the mic) and that adding many of these priducts might use up a lot of or slow down the WiFi. I'm curious about later adding the hub and a doorbell device, however.",
            "author": "SharonS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Best smart speaker\"",
            "rating": 5,
            "date": "09/11/2017",
            "recommended": true,
            "text": "I like Google Home better than Alexa because it is cheaper and better integrates with Google searches. I think Google home will catch up and beat Amazon Alexa very quickly.",
            "author": "Aziz",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 2
            }
        },
        {
            "title": "\"Great Home assistant\"",
            "rating": 5,
            "date": "12/12/2018",
            "recommended": true,
            "text": "Just used the Google Home for a short time and I'm very impressed, started with the ease of set up, just in a few minutes I was asking Google for the weather, turning on & off my lights and listening to music, I can also hook up with my Nest products and control either by voice or my phone. You do need to speak clearly when asking Google for assistants, and if you like you can even ask Google to make phone calls from your contact list.",
            "author": "ssjimmy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google 'HOME' unit\"",
            "rating": 4,
            "date": "01/12/2019",
            "recommended": true,
            "text": "This product from google is the \"HOME\" unit, It is basically a speaker system for Wi-Fi. It also has an assistant. I do have the mini which I use in another room. The system works well and is a lot of fun. My husband ranks as chief in regards to the speaker system! I'd recommend this product. Well built and I assume it will last a very long time until some updated technology is added in the future as with any system.",
            "author": "Ninzo",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Quality Device\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "While the Google Home is an excellent device, it is hard to justify spending the extra money over a Google Home Mini. The Google Home has better sound, but has the same functionality of the Mini.\nThe device setup is easy using the Google Home app available for Android and iPhone users. You can control compatible device such as lights or TV. Of course, you can ask Google about anything and get an answer immediately.",
            "author": "Jeffrey",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Hard to differentiate from the Google Mini\"",
            "rating": 4,
            "date": "12/31/2018",
            "recommended": true,
            "text": "I now have three Google Home Mini units, this Home unit and a Home Max. I, so far, haven't been able to differentiate them other than sound quality and while the Max has clearly the best quality it's not up to par for complex, large group music. It needs a much better equalizer.\n\nI'm also running two Wi-Fi networks - my original one on an Acer router and a new one on the Google Home router. That is working very well although I had to buy an extra Google router to get adequate coverage in my 1220 square foot home. Of note, the Acer router doesn't do any better reaching the farthest room.\n\nWhat would be exceptional is if Google enabled device to device communications so that at a minimum you could send messages to a device in another room and even better use VOIP to set up a home intercom system.\n\nOverall I like the Google Home setup with the exceptions noted above.",
            "author": "dtSeattle",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"I enjoy using them,,,they are so helpful.\"",
            "rating": 5,
            "date": "06/27/2019",
            "recommended": true,
            "text": "Ive used my google home for about 6 months, then bought 2 minis for the bedroom.   Google can answer almost any question, about weather,,destinations,,and local business... I use it to play the sounds at night to sleep by,,like water falls, or ocean, and it gives me reminders of things i need to purchase.  I feel like this is by far the most useful purchase I have made.. Im very happy with it.. thank you, Google",
            "author": "bobtenn",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Easy Quick Setup\"",
            "rating": 5,
            "date": "01/04/2019",
            "recommended": true,
            "text": "This is the second Google Device I have set up. I chose to put this one in our shop so I can listen to music while I'm working on projects. For the size of the home device the power is amazing. The sound is perfectly clear, no echo, no static. Set up was just as simple as the Google WiFi, like wise the update of software took the longest. I was able to add the Google Home to the music group I created so all devices play the same music at the same time. I can not believe how amazing these are. When I want to listen to music or stop it I simply say Hey Google, play our YouTube music. I would definitely purchase one of these. If I had not received it as a free product from Lowe's & Google. I'm sure in the future I will be getting another one to add to the rooms. After, setting everything up I still can't believe how simple and wuick set up was, and how fantastic the sound is!!",
            "author": "KandieWood",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home Better Sound\"",
            "rating": 4,
            "date": "01/02/2019",
            "recommended": true,
            "text": "We have several Google Home Minis and find them very useful for shopping lists, play music or Cast music on Chrome Audio, control the thermostats in the house, weather forecasts and looking up general information on the web.  The Google home has all the same features as the Minis but with better sound.  We find this particular useful in our kitchen when we don't have a speakers from our larger audio system.",
            "author": "Joe",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"What's not to like?\"",
            "rating": 5,
            "date": "01/13/2019",
            "recommended": true,
            "text": "Easy setup via the google home app. I set mine up in the kitchen. It is out of the way and great for music while cooking or setting a timer without having to wash your hand before pushing buttons on the microwave or stove. It also acts as a great conversation starter. I've only had mine a short time and I'm sure there are so many other uses I have not even thought of yet.",
            "author": "MikeC",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home Speaker\"",
            "rating": 5,
            "date": "12/15/2018",
            "recommended": true,
            "text": "The google home speaker is a nice addition to the other google products I have. The sound quality is better then the home mini, but still no better then above average. Like with the other google devices, the google assistant is what makes this device supreme. From checking your calendar, to asking random questions, it's always fun having a google assistant device around.",
            "author": "Knonchalant",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"The Google home\"",
            "rating": 4,
            "date": "12/12/2018",
            "recommended": true,
            "text": "The setup of the Google home is extremely easy as is all the Google Minis and max that I have in have created group speakers which is a great feature so that you can listen to music through the whole house if you like without having the volume to high. Wish the quality of the speaker was slightly better but not bad the minis are pretty close to the same quality of sound",
            "author": "Kona",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Fun device\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "I was a bit skeptical a first, but the Google Home device has proved to be a nice addition. My family has been playing music through voice command, asking random questions, and adjusting the light in our living room daily now. The speaker has a nice sound and the device compliments the other Google products. The device was a breeze to set up and works with my phone.",
            "author": "Reviewer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"1st Google\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "This is my first entry into this type of service or item. Packaging was solid and set up was also easy. Down loaded the Google app on my tablet. Followed the set up and was using it right away. I set my voice to the unit and started asking it to play certain music. It would say “ that station is only on Google play but we will play this”. In most cases it would play some songs but not all. I looked into Google Play and signed up for the 30 day trial of music. It is $9.99 per month after. Have been listening to all sorts of music from Christmas, jazz, country, oldies to Dean Martin! Love it !!! Also have asked for local weather and weather in other areas, time, stock prices and even asking it to repeat words in Polish so I can learn. I have not connected any other items to it but look forward to that opportunity in the future. \nThis is a great time we live in and this Google Home is a great addition to our home and comfort we enjoy.",
            "author": "Joe",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/16/2019",
            "recommended": true,
            "text": "I like the stylish look of my new Google Home. Easy to set up and responds well. I like the touch volume on the top of the unit as well. Makes it easy to adjust without interrupting the music. I enjoy the sound quality in this small profile unit. Hook it up and \"Hey Google\" your needs. Check the weather, set a timer, or a reminder for an appointment.",
            "author": "Frank",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very good for certain purposes\"",
            "rating": 4,
            "date": "12/20/2018",
            "recommended": true,
            "text": "As part of a fairly complete suite of Google Home devices, the Google Home serves quite well, in my opinion, for several personal assistant-like and smart home functions. That is, although sound has been improved, it is still not quite up to that of it's major competitor, and linking several Google Home devices to play the same input at the same time [grouped or whole house] isn't quite as simple as in the 'competitor'. On the other hand, it is somewhat easier to link to my personal music library, when loaded to Google Drive, a major obstacle now with the competitor eliminating ability to store a library with them.\n\nFunctionality as a smart home controller/input device is flawless, and in fact seems much more time-responsive than the prevalent competing devices, which lately seem to be lagging between command and smart device actuation. With few exceptions, almost all of the smart devices installed can be controlled by either system, which does provide me with redundancy.. The one exception is a bundled \"GE\" smart light bulb, that I can only control via Google, unless I want to write an IFTTT {as I understand it} routine for the other system. One stand-out is its interaction with my smart thermostat, which is much more intuitive. It is solely also capable of controlling the Chromecast device, in many ways, to include voice commands for those services which the Chromecast is enabled. (See my Chromecast review for more).\n\nTo me, the one other lack with regard to playing music, is that the Google Home devices cannot be wire-connected to either a powered speaker set or full audio system, having to link via Bluetooth. While for many this is preferable anyway, I personally am not a fan of creating a large paired set of devices to have access to a playback means. Also, I would think, but do not know for sure, that there will be even further audio spectrum clipping due to bandwidth limitations.\n\nOh, and one other function where it excels, is obviously direct access to Google Search and stored data functions. There is not as extensive a skills library, and the one entertainment app I've used seems a bit 'hokey' - the trivia game \"show\". \n\nAgain, it is a very capable device and system, and I generally like it. For one who is not a \"Prime\" member, it is a definite alternative to the major competitor, and as in a facility or home running both systems, it serves as both a niche and alternative system quite well. [One niche example is that I have only Google Home devices (a 'Mni' & light bulbs) in my basement where I no longer entertain. I could later add a Bluetooth adapter, should I decide I wanted to stream music via the Google device there.\n\nIn short, again, recommended and quite capable system that just would not be a total solution for me, but could well be for others.",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Still surprising me with more capabilities\"",
            "rating": 5,
            "date": "03/06/2019",
            "recommended": true,
            "text": "Besides all the things that are advertised, it has excelled past expectations. I have a large shop, so I put the Home Max at one end and the Home at the other end. I asked a question of the Google Home on my way to the middle of the room. The Google Home Max answered. I guess I didn't think about them being connected to each other.... duh! :)",
            "author": "CptOrion",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Small but Powerful\"",
            "rating": 4,
            "date": "12/19/2018",
            "recommended": true,
            "text": "Having seen commercials for Google Home, and purchasing a Amazon's Alexa product for a family member, I was somewhat aware of what this could do, and I had some ideas about what I wanted to be able to do with it. \n\nSetup:\nSetup is very easy, using the Google Home app, which is available for almost any device. Similar to the Google Chromecast setup you have to connect to it directly, and then I had zero issues getting it to connect to my home network. Once it shows up on your network you can also control it and add connections to other services via the Home app. \n\nConnectivity:\nThe Google home connected to my wifi with minimal fuss and seems to keep that connection well. In the Home App is also where you set the Google Home to connect to various services and devices you have around your home. In my case I connected it to other Chromecasts, and Spotify., These were all done using authentication through those sites themselves, via the Google Home app. This was also fairly easy to accomplish. \n\nUse:\nOnce I got it all set up... I wasn't quite sure what to do. I thought right away we'd use it to play music. It took a few tries, without opening any manuals or instructions, to get it to play music from spotify. It responds to both \"Hey Google' or \"OK Google\" When you say OK Google it reduces the volume of anything that's already playing. It's surprisingly sensitive, responding to me from two rooms away at a conversational volume. It obviously applies some kind of noise cancelling to it's own tunes because it's able to respond to me in the same room with it playing music at almost full volume. It does struggle a little more with accuracy in that situation however.\n\nSound Quality:\nThis thing is on par for similar devices on the market. It turns up way louder than anything it's size has any business putting out. It didn't' distort or drop out at any level. Stereo is a little tricky since the speakers are mounted inside in an opposing fashion. \n\nDesign: The google home looks like a vase with the top chopped off. There I said it. The top is angled, and for a reason: there are LEDs under the top. You can actually use touches to accomplish different things, tapping to stop music, tapping again to play. There is a circle of LEDs that show when Google Home is listening for a command (in the same primary color array as Google Chrome) and there is also a circle of LEDs showing current volume and you can touch to turn up or down. The ability to swap out the bottom/speaker grills to match your decor is a nice touch too. Mine was a pretty good fit right out of the box. \n\nOverall:\nThis thing is probably only going to become MORE useful as a smart home hub as the technology evolves and google adds more services to it. Right now you could connect MANY things to it. The number of services it connects to out of the box are useful, but not plentiful. So far it's served as a glorified speaker. Exploring in the Google Home app also gives you more examples of what can be done with it. As it is, I really like using it, and I think for the price point it blows the Alexa out of the water. Four our of Five stars, would recommend to a friend!",
            "author": "KJK",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Nice Google Home\"",
            "rating": 4,
            "date": "12/09/2017",
            "recommended": true,
            "text": "For the most parts it works good. Sometimes it gets confuse and won't answer the question. Music is really good also will find a radio station according to the song requested",
            "author": "Frank",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "01/12/2019",
            "recommended": true,
            "text": "For a smart home control, Google Home is no different in function as the Google Max and Google Mini; however, its design does allow it to it to fit nicely with other decors. Google seems to have designed the Google Home and the others to fill the needs according to the size of room that they are placed in; function wise, as far as I can tell, they work the same, however, the sound each produce does seem to increase as like their sizes.\nThe Google Home fills the musical needs of a small to medium size room perfectly; it will fill the room with music of your choice all day long. And when needed, it will allow you to control other smart home devices of your choosing.\nThe setup process is simple; that is, after you have been through the process setting up other Google smart home products. Google has never been great with clear instruction, and Google Home is not an exception, but as always Googling online is the best way to find answers for anything you may encounter.",
            "author": "SL",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Inovation\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "I am not good with these new products so my Daughter had to get it up and running, and I am so happy that she did! this product is great, the sound coming out of it when it plays music is incredible. Now that it is hooked up it is in constent use. I am now going into the future and I am enjoying it. Thank You Google!",
            "author": "Skip",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Amazing product\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Can't say that I have been fired up for one of these but now that I have it it's amazing! First of all it's super easy to set up and easy to use. I didn't know how to set up the Bluetooth pairing but turns out just say “google Bluetooth pairing “ and it tells you how to do the rest. Only downside here is that Apple Music can't be your default streaming music but you can just pair your phone or tablet with Bluetooth and stream Apple Music that way. Speakers sound great , good way to listen to music, it's a plus, I didn't expect the sound quality to be that good. Voice recognition is much better than Siri I think. I have a little Southern accent and sometimes Siri gives me weird responses to things. If you are interested in getting into smart home then this is a good start. It's stying is very unobtrusive and I'm sure I will learn how to do more things as I use it. I like that you can tell it to creat a list and then it will show up in your phone app , pretty convenient.",
            "author": "Forrest",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Little Speaker\"",
            "rating": 4,
            "date": "12/13/2018",
            "recommended": true,
            "text": "I never thought having one of these would be so helpful. We put this in the bedroom and use it to turn the lights on and off, listen to the news in the morning, and play gentle rain sounds to fall asleep to. The speaker has good tone, and you can turn the Mic off with a switch if you want complete privacy.",
            "author": "Ben",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home.. Great baby sitter\"",
            "rating": 5,
            "date": "12/16/2018",
            "recommended": true,
            "text": "Setup the Google Home, no problems encountered took about 2 min. \nThe sound quality is better than I expected for it's compact size, The grand kids have had a great time asking silly questions and turning lights off and on.... It's a very good baby sitter! Will update if problem are encountered.",
            "author": "Yohan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Easy to install and quite fun adjusting to AI\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "Love the neutral aesthetics in the design. Easily blends in to any room and so easy to setup. Decent speaker makes listening to music or news reports easy on the ears. Mic is super responsive and makes it easy and convenient when i found out that i can use this to make or take phone calls.",
            "author": "ElectricBlue23",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 1,
            "date": "12/20/2018",
            "recommended": false,
            "text": "I am unable to use this product. My IPAD does not have the software version required to interface with the Home. When and if I upgrade my IPAD, I will attempt to make this product work.",
            "author": "JoeB",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 4
            }
        },
        {
            "title": "\"Google Home (chalk)\"",
            "rating": 5,
            "date": "12/12/2018",
            "recommended": true,
            "text": "Our home has been an Amazon Echo home since it's arrival on the market. However, since obtaining the Google Home, I have been pleasantly surprised how equally adept it is at having many of the same capabilities as the Echo. It is esthetically pleasing to look at and fits into our decor nicely. It works in the same manner as the Google Mini and Google Max, answering pretty much all queries, supply weather updates, calendar activities, reminders, play music, games, control homes devices such as smart bulbs and plugs as well as thermostats, and on and on.\nIn all honesty, there are things the Google devices cannot do that the Echo can, and visa versa. I'm still learning the nuances of the Google home, so it is a learning experience for the user as well.\nI would recommend the Google Home to perspective buyers,\nI'm unsure if the Google devices can track a package much like the Echo can when you order from Amazon. If I learn how to set that feature, if it exists right now. I'll add a note to my review in the future.",
            "author": "Dclifford47",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works fantastically well\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "I wakeup every morning talking to this genius asking her what the weather is like today or how the traffic is on the way to work. How did I live for so long without this? You couldn't pry it out of my hands if you had to. Another amazing product from Google. A++++++",
            "author": "Jason",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very helpful\"",
            "rating": 5,
            "date": "12/27/2018",
            "recommended": true,
            "text": "Love the Google Home! It was very easy to connect to wifi and other smart products. It is very helpful to access information such as store and restaurant closings, etc. We are in our mid 60's with no “ tech” qualifications and it is so easy to use. Highly recommend!",
            "author": "Toshafeline",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home Very Useful\"",
            "rating": 5,
            "date": "12/24/2018",
            "recommended": true,
            "text": "Well built, voice activated. Useful for setting reminders, alarms and timers. Even grocery lists.. Create to add apps for weather, appointments. Connects to any Chromcast devices that you may already have. Sound is very clear. Easy set up, makes life more convenient",
            "author": "Linda",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Product\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Great sound for its size, slick design, if you are only getting one google home speaker this is the one you want.\nThe only complaint I have is that you have to have a smart device to set it up.\nOverall it is a great product, I would recommend it to a friend.",
            "author": "DIYCedarGuy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A helpful device.\"",
            "rating": 4,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Google Home: Beautiful design and intuitive controls. We decided to put this one in the kitchen and having the touch controls on the top was very useful. You can pause it by tapping it, and control the volume like you would on an old iPod click wheel. Setup was very simple. My phone recognized that there was a device nearby and sent me a notification to set it up without having to go through any menus or anything. We especially appreciate that it can now read recipes to you step by step, as I have a tendency to lose my place when trying to cook and read a recipe at the same time. My only complaint is with the speaker itself. It is very bass-heavy, and with the 360 degree speaker design, the sound tends to get muffled when it is placed against the wall. We originally put it under the cabinet against the backsplash, but it sounded underwater, even when we tweaked the EQ. If you move it away from the wall and other objects that might absorb or deflect the music, it sounds fantastic. Just be careful about where you put it. \n4/5",
            "author": "Jack",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great start to a smart home\"",
            "rating": 4,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Google Home is voice activated device much like other competitors except with much more capability. One of the first things you'll want to do is download the google home app on your smartphone and or tablet, this will not only make set up easy but also serve for more advanced use of all the features. The limits for using google home is pretty much your own imagination. Task like setting alarms or timers, listening to the news or music, making shopping or to do list, checking the calendar and making appointments, GTSing (google that stuff) questions, the list goes on. Other things we have enjoyed is linking to other smart devices in the house like thermostat and refrigerator. Television is another avenue we are just beginning to explore so not much detail yet but we're interested in linking google home to the sound system and exploring chromecast. At this point we've been well pleased with google home and can't wait to implement more smart options like lighting control, cameras and more! We would definitely recommend google home!",
            "author": "NCRocky",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "12/25/2018",
            "recommended": true,
            "text": "Simple set-up and easy to follow instructions. I use it in the bedroom to set a wake up alarm, play music and get the weather forecast. I figure that I am only scratching the surface of the possibilities of usage. I am satisfied with the Google Home.",
            "author": "Mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Just ok!\"",
            "rating": 3,
            "date": "01/10/2019",
            "recommended": true,
            "text": "Sorry google, we have Alexia, she seems to be more sociable. Google tends to be more serious. \nIt does give interesting information and my grandson loves the Disney games!\nGuess we need to just get more comfortable with it and learn more about it.",
            "author": "FACSteach",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home-My Life is changed for the better\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "My Google Home arrived with clear cut set up instructions. Perfect size for any room. Easy to use with voice commands. This is a must have for home audio, nice sound system for large and small rooms. I'm not tech savvy but set up is easy as 1 2 3.",
            "author": "Yolenc",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Welcome HOME\"",
            "rating": 5,
            "date": "12/21/2018",
            "recommended": true,
            "text": "Well, this is a really cool item for your automated home.\n\n So far, I have been able to connect this item to all of the electric and smart home products that I have within my home. The connections have remained stable, and in fact I have even been able to better configure my home products as a result of the required GOOGLE HOME app. the app can be downloaded via your favorite App Store.\n\nThrough the app you are able to easily connect this smart home controller to your home network, establish connections, and test to make sure everything works, one great thing is that once you have set up one Google Home product the next one is set up even easier. \n\nAs far as which HOME product to choose - go with the one that best fits your decor and produces sound that is loud enough for you.\n\nThis device provides clear sound, enough for a bed room, kitchen, or bathroom for music listening purposes, but would not be the best choice for a living room solution.\n\nMy testing will continue and I will update my review if any of my opinions change. \n\nThumbs up!",
            "author": "pruveit",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home, Hey Google\"",
            "rating": 4,
            "date": "12/10/2018",
            "recommended": true,
            "text": "This product was VERY easy to install, you just need to follow the directions and viola! \n\nAnd it's so easy to use, you just say, \"Hey Google\", then ask it any question you need help with and it gives you the answer. Love it! ;-)",
            "author": "Thomas",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Home Entertainment\"",
            "rating": 5,
            "date": "08/23/2018",
            "recommended": true,
            "text": "This is the greatest!  Ask it questions and get answers, play music, get news and weather and a lot more.  Don't know how we lived without it before.  We have a Boise radio/cd player and the sound on Google Home is even better!!!",
            "author": "NAMBRU",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Ease\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "Connection was easy. Always know when its comprehending my questions as I can see the lights rotating. Speaks clear. I have it in my kitchen comes in very handy. Can't wait to get more items for the home.",
            "author": "Cindy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works well\"",
            "rating": 4,
            "date": "12/12/2018",
            "recommended": true,
            "text": "Setup didn't go as smoothly as I had hoped as my mobile phone didn't recognize any devices, however, a second mobile did finally recognize them. Once that issue was resolved, the product worked great.",
            "author": "Traveler",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love google home\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "Google home, like the minis, are great. You have weather, news, music, or anything else you need to know at a simple request. Can also program to turn lights on and off, thermostats, and so much more",
            "author": "Familyman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good sound quality\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "This product has a good sound quality. It is easy to set up and can be controlled by an app. It works with many different brands of smart products, which can be operated independently or in groups.",
            "author": "MelNight",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home and Mini's\"",
            "rating": 5,
            "date": "12/08/2017",
            "recommended": true,
            "text": "Great products. Quality and user friendly.  Though they are like a drug!  You just want to start automating more and more stuff after you get one, you will surely end up with one in each room.",
            "author": "Ric",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent Product\"",
            "rating": 5,
            "date": "12/15/2018",
            "recommended": true,
            "text": "This has so many possibilities of which I am still learning about. A beautiful sound for such an inconspicuous device. Wish I had gotten this sooner! Highly recommend this product!",
            "author": "Pete",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Unbelievably easy to setup\"",
            "rating": 5,
            "date": "12/16/2018",
            "recommended": true,
            "text": "Very easy setup and easy to add to. Very impressed. I like this thing!! I like all the add on's. Works extremely well. Definitely worth the money. Would definitely purchase.",
            "author": "Rinconman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good product\"",
            "rating": 5,
            "date": "12/31/2018",
            "recommended": true,
            "text": "Good product , I Had no setup problems. I also own a competiors product. Can't say which is better. I guess it comes down to Purchase price",
            "author": "300k",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"It's Like the Microwave\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "When the Microwave came out folks didn't usr it.  Now folks don't know what to do without it.  I feel the same with Google Home.",
            "author": "Richard",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home is Great\"",
            "rating": 5,
            "date": "01/08/2018",
            "recommended": true,
            "text": "Got this as a Christmas present. Still learning all the neat functions. Nice Radio and fun to play trivia with it.",
            "author": "Hawkedoodle",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Lower sound quality but great AI.\"",
            "rating": 4,
            "date": "01/01/2019",
            "recommended": true,
            "text": "The sound quality of this speaker isn't as good as the Alexa.  Nonetheless, the assistant is far super to Alexa.",
            "author": "Andrew",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Welcome to 2018\"",
            "rating": 5,
            "date": "10/14/2018",
            "recommended": true,
            "text": "Google home is a get addition to my house, it acts as my alarm clock, as a reminder and it also streams music !",
            "author": "Charlie",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Product\"",
            "rating": 5,
            "date": "12/09/2017",
            "recommended": true,
            "text": "Every household should have one. Extremely smart, easy to setup and make things easier to control in your home.",
            "author": "Alex",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great product\"",
            "rating": 5,
            "date": "12/13/2018",
            "recommended": true,
            "text": "It's great not being able to open my phone all the time when I want to know something. I love it!",
            "author": "Del",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"interesting equipment\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "i'm not really tech savvy but this has been a good addition to my home. saves me steps and time",
            "author": "barb",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great product excellent\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "A great addition to any home this is an awesome system it works great and easy to work with",
            "author": "Ot",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great find\"",
            "rating": 5,
            "date": "12/12/2018",
            "recommended": true,
            "text": "Lowe's really provides the value with the Google Home. They are more than lumber and nails!",
            "author": "Chris",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome\"",
            "rating": 5,
            "date": "01/06/2019",
            "recommended": true,
            "text": "This is an awesome system. Has great response and sound. Way better than Alexis.",
            "author": "pegandVern",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "02/22/2019",
            "recommended": true,
            "text": "Can't believe the sound quality of the Google Home. Recommend this to everyone.",
            "author": "MoreMom",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Awesome Mother's Day Gift\"",
            "rating": 5,
            "date": "06/05/2019",
            "recommended": true,
            "text": "My Mom is obsessed with her new Google Home! It actually keeps her company too.",
            "author": "Lex",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent Addition to the Family\"",
            "rating": 5,
            "date": "06/25/2019",
            "recommended": true,
            "text": "This product really makes one's life easier. Speakers are decent as well.",
            "author": "Zack",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "01/07/2018",
            "recommended": null,
            "text": "Lowes quickly provided my item and this gift was a success!",
            "author": "Hojomom",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Quality\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "This was my introduction to the Google Home products seen in all the electronics ads for the holidays. You can almost tell from the packaging that Google is putting their best foot forward with these products. The home was so easy to set up I thought I must have done something wrong. You download the Google Assistant App and it walks you through about 5 or 6 easy steps and you are done. The voice assistant is easy to understand and is more responsive than Alexa. I bought the Chalk colored model and it fits well with the furniture. It's hardly noticeable. I have been shopping for products that work with Google Assistant and the Home to fully use its capabilities. I have found there are over 5,000 different products that work with the Google products.\nI also have a Google mini with a light bulb and that works with both. I can turn the light on or off with either of the Google or via the Google assistant app on my phone. I can tell this product is very expandable and has lots of uses. The speaker/microphone picks up my voice from anywhere in the room easily and the volume control is voice controlled. You can turn it up or down by simply telling it to raise or lower the volume. I'm looking forward to discovering all the possibilities.",
            "author": "Jerry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/26/2017",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jor",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Michael",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/26/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jake",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "01/11/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Myk",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "12/07/2017",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Robert",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Don",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "01/04/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Bonnie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Good things come in smaller packages\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "When unboxing the standard Google Home, I was immediately surprised at how the device was much smaller than expected, but in such a good way. I'm not particularly a fan of having super tall cylinders as smart speakers around the house, and this is the perfect size. Combine the size with Google's smooth, matte plastic and home-friendly fabric, and the Google Home is a striking little companion. The Google Home app on my iPhone made the setup of this thing really fast and really simple.\n\nThe Google Home, while not the smallest of the Google smart speaker family, might just be the most home friendly, and that's due largely to its design. This device has a really unique shape that makes it look like it belongs in the home. For me, it's a really great computer desk companion. I can bluetooth my computer audio to it, ask Google assistant questions, or play music while I work. The speaker quality in the Google Home is what I'd call “fine.” It's not super “bassy,” but it's fairly good quality if you're not blasting the volume. I think this is more of a “background music” player as opposed to the center piece of your home audio. That said, everything about the Google Assistant component works as expected, and it's a good price point. Recommended as a gift or a new addition to your own smart home.",
            "author": "Vingole",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A great way to start your smart home improvements.\"",
            "rating": 5,
            "date": "12/13/2018",
            "recommended": true,
            "text": "Google Home : \n\nThe Google Home is a nice way to get started in the smart home movement, for people who aren't tech savy. It does pretty much what you'd expect; it answers your questions, controls your devices, and the sound quality is good enough for listening to music. I also have an Amazon echo, and the Google Home sound quality is better; it seems richer with deeper bass response. Also, I like the fact that it recognizes different voices, and tailors its responses depending upon whom is asking it questions.\n\nInstallation was a little confusing at first, but once you start is relatively easy to follow. The steps are as follows:\n1. Plug in your Google Home\n2. Download the Google Home app on your smartphone\n3. Sign in with your google account. (You need to have already created a google account to use google home).\n4. Tap the setup icon on your google home, top right corner\n5. Watch the tutorial!!!\n6. Follow the directions.\n\nOnce you have it all configured, its a neat machine, I can control the GE smart light that came with the bundle, turning it on and off with just a command. So far the most useful task it can do is setting up timers and alarms. When I am cooking, I can tell it to set a timer for 30 minutes, and it sounds an audible alarm when the time is up. Haven't burned a pizza since I got it.",
            "author": "Storyteller",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great Product to build your smart home around!\"",
            "rating": 5,
            "date": "01/02/2019",
            "recommended": true,
            "text": "Fun item to have in the house. I have the home and now a couple of mini's too. All are in different rooms so no matter where I am I can ask them to do something like turn on or off or dim a light. Adjust the thermostat. Tell me the weather, time, traffic, info on just about anything I need, play music I want in 1 room or as a group in all rooms ( was a nice feature at Christmas having the whole house full of the same background Christmas music in every room at a nice comfortable volume instead of 1 location blasting the sound to all my guests). My wife and I use it to help with getting things done and remembering things by saying Hey Google add such & such to my shopping list, to do list, follow up on list, etc. Comes in very handy when you think of something out of the blue and can just tell your assistant to add it to your list or ask Google what is on your list and even pull up the list when you are out or at the store with your smart phone. Add smart bulbs, smart locks, thermostat, smart plugs, etc and you can control just about anything you want by speaking it or pulling it up on your phone app. Way too many things to list here and with technology going the way it is smart home equipment will be expanding and covering more things than I can imagine. We enjoy it very much and will continue to add to and build our system even more.",
            "author": "Jack",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very helpful in many ways\"",
            "rating": 5,
            "date": "12/17/2018",
            "recommended": true,
            "text": "First let me start by saying that I received this product free to give my personal review on it. It was in no way influenced by anyone. Let me start by saying that my husband and I are not up to date on the today's technology. In fact, I was very afraid to try and set this up when we first received it because I didn't want to break it or mess it up to where I couldn't give you my opinion on this device. We actually had our daughter come just in case we started to over think the process. She was very knowledgeable and helpful in the installation. We also found that you can go on YouTube and find videos on how to set this up from start to finish. It turned out to be very simple - only took a few minutes and it was done. I never thought we would use this product a lot hence the reason we never purchased one of our own. But it has really turned out to be a very helpful device to us. I love knowing about weather and rely on this everyday to find out all I can. The second most favorite feature has to be the music. I'm home a lot during the day by myself as my husband works and being able to play music through this has really sped up my day's while he's gone. We are excited to learn everything this little device can do and how much more it can help us on a day to day basis. We highly recommend this to anyone interested in adding more technology to their homes.",
            "author": "Tweedygirl",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A really neat smart speaker with great sound\"",
            "rating": 5,
            "date": "12/28/2018",
            "recommended": true,
            "text": "This is one of Google's “Home” smart speaker/assistants. It has a good speaker for its size, though not as good as the larger Google “Home Max Chalk” but better than the Google “Home Mini Chalk”. Like all of Google's smart home devices, this smart speaker is a lot of fun, seriously ‘cool', and so easy to setup. BTW: Google's “Home”, “Home Max” and “Home Mini” smart speakers install and work exactly the same way so if you also come across my review of them, you may notice considerable similarity. \nSo long as you have a nearby power outlet, a Google login, a smartphone to load the “Google Home” app, and a home wireless router within range, the voice activated Google “Home”speaker/personal assistant will be a breeze to install and use. Once it is setup, it's “Look ma, no hands”. All I had to say was “Hey Google” and fire-off a question or command. I even ‘paired' it with my iPhone so not only can I listen to internet-based music (ie. Pandora, YouTube, Spotify, etc.), but I can also listen to any music stored on my iPhone through the speaker of the Google “Home”, and the “Home Max”. Still, I'm glad these devices include touch as well as voice controls for start/stop, volume, and mic mute so I don't have to interrupt the music with a “Hey Google” just to pause it or adjust the volume. I also like broadcasting my voice messages throughout the house wherever a Google Home smart speaker exists.",
            "author": "Jeff",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home\"",
            "rating": 5,
            "date": "12/13/2018",
            "recommended": true,
            "text": "This is but one of the many devices Google offers as a \"Home Assistant\" and I must say I am impressed with their products. It is in my opinion, superior to the competition. The voice commands work near perfection. I have a \"low quality\" voice on other devices and applications so I was doubtful this device would be any different. I am pleasantly surprised with the results so far. Setup is easy and quick (you must have a smartphone or tablet to do this). The assistant is always \"learning\" your requests. For example as a test I ask what the market price of gold is today. The assistant at first could not answer this and is now sending links to my phone (via the Google Home app). I would expect in the near future it will learn this task. It does things like phone number lookup, ordering pizza, weather, etc.quickly and without fail. \nThe device also streams music with good fidelity and can be quite loud if needed. It links with other Google devices easily and flawlessly; however it does not appear that it can be a satellite speaker for other Google devices. Again, make sure you have a smartphone or tablet to set this device up and to control it at times. Also, I live in a rural area with DSL that goes out frequently and can be lower bandwidth and at times this can result in interruptions of device functions (not the device's fault). I really like these products and I highly, highly recommend them.",
            "author": "DaveWayOutWest",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Cool little device\"",
            "rating": 5,
            "date": "12/27/2018",
            "recommended": true,
            "text": "We recieved a google home mini, google home, a google home max, chromecast, smart light bulb and router all in the same day. Having an updated smart home has been a fun adventure offering some unexpected conveniences. \n\nThe only difference , I believe, between the speakers, is sound quality. But it is a big difference. They all sound pretty good. We listen to a lot of music, audiobooks, and podcasts. We enjoy having a speaker to listen to them. \n\nOur 8 year old loves asking the google home to play his favorite songs while he cleans his room or plays with legos. As he was playing legos, he asked it to play the Lego soundtrack and then asked it to play the Lego movie,. He was thrilled to be able to accomplish these tasks without having to ask his older sisters or myself to help him.\n\n The speakers are very convenient to ask simple questions, or find out the weather. Simple, lazy things like that. We also just discovered it acts like a intercom system with all the other devices. This feature is very convenient in our 3000 SF home - decreasing the amount of yelling required to communicate with all four of our children. \n\nWe also appreciate that calls can be made through the google home speakers. This is especially convenient because we do not have a land line and not all of our kids have cell phones. \n\nThe google home has a great sound. It's a little more bass-y sounding than the mini making it perfect for our living room, get togethers, etc.. All in all a pretty fun device that eliminates the need for other speakers.",
            "author": "Levi",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Google Home, Not Your Grandfather's Radio\"",
            "rating": 5,
            "date": "12/10/2018",
            "recommended": true,
            "text": "OK, you're considering a dive into home automation. The question, where to start. You can get intelligent lightbulbs, switches, outlets, thermostats, and TVs. Your ability to use these devices is limited to how you can interact with them. If you want to use the Google Home infrastructure, the first interface is going to be your Android or iOS device. While this works, it is somewhat cumbersome (I've been doing it that way for a year).\n\nEnter Google Home. Essentially, Home adds two addition features - the ability to speak commands and to listen to results without having to fumble for your cellphone or tablet. As a byproduct, it also adds decent audio to listen to streaming sources on the Internet and a \"coolness\" factor. It also has a limitation your cellphone or tablet doesn't have - Google Home has no display. As a result instead of viewing your options on your cellphone, you need to know what's available e.g. know that I have a light named front door that can be turned on/off (pretty easy) or the name and availability of a video stream I want to watch (maybe not too bad for a movie but might be harder for a TV episode I rarely watch).\n\nHaving said all that, there are times and features that really make voice control of your environment fantastic. While I can't say I couldn't live without it, it CAN BE very convenient.\n\nBy the way, in case you're interested, the time to install (with a pre-existing wifi network) from removing the plastic wrapper to my first command (\"Hey Google, play some jazz.\") was 8.5 minutes. Not bad for a new install!",
            "author": "drJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great little smart speaker\"",
            "rating": 5,
            "date": "12/18/2018",
            "recommended": true,
            "text": "A great little gadget. The Home was neatly packaged and right out of the box I was up and running in just a few minutes. First you have to download the app on your phone or IPad and then follow a few steps to set it up. I already have a home mini and a home max setup in the house. They connect up with each other and I will be able to control various things from anywhere in the house. Currently I only have a few lights setup on the system but I plan to expand my options soon. I can control the lights from anywhere in the house. All you have to say is \"Hey Google\" and it is at your command. \"Hey Google, turn off the lights in the living room\" and they go out. Or Hey Google play some music in the den. Hey google lower the volume. \"How cold is it outside\" Or ask it anything about sports or what time does Home Depot open. It knows. One thing I have noticed is that when you ask Google a question, the answer is almost instantaneous. Another thing it is a great little speaker and the sound is great. It seems to fill the room with music when you ask it to play a song or play your favorite radio station. The Home is a relatively attractive device. It can fit pretty much any decor without drawing unwanted attention to itself. I have mine setup up in the bedroom on my nightstand and it is barely noticeable. The microphone is very sensitive and you can access it from anywhere in the room. You don't have to repeat yourself. If you are playing music the volume will go down so you can hear the response. Overall, I think I have a long way to go when it comes to tapping its full potential but I think it is a great starting point. The Home is definitely the way to go.",
            "author": "DixieLee25",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very good sound quality\"",
            "rating": 5,
            "date": "12/30/2018",
            "recommended": true,
            "text": "I have used this to control my GE smart bulbs, ChromeCast television, Nest thermostat and one google smart plug. It connects and works flawlessly with them all. Even if you are not sure if you want a “smart home” yet, this Google Home makes a very nice stand alone speaker for streaming music from Google, Youtube, Pandora, Spotify, etc.\nYou can always add smart products to your home later and connect them to Google Home.\nThe sound is definitely quite surprising coming from such a small device. Although it lacks the mega bass and extreme volume presence of its big brother, Google Home Max, it certainly can keep the music loud enough (or quiet enough) for all occasions. I also have a google home mini which has very nice speaker quality as well. However, if you want high quality sound, but you are not prepared to pay up for the Home Max, I would recommend you spend the extra to step up to this model from the mini if you are planning on using it to stream music. While this and the home mini do the identical thing, the speakers in this Google Home are definitely, in my opinion, worth the extra investment.\nAs with all the google home products, setup is a breeze. Simply plug it to any standard wall outlet and then open the google home app on your device. The app will automatically detect your google home and ask for WiFi password and that's about it. \nOne thing which really stands out to me is how well these google home devices can hear and interpret what I say. Even my kids who speak very fast and not always so clearly are heard word for word by Google Home! Even if the music is turned way up it can detect your voice at nearly a whisper. And not just hear your voice but hear exactly what you say or ask. It is truly amazing!",
            "author": "Jake",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Home Sweet Home\"",
            "rating": 5,
            "date": "12/21/2018",
            "recommended": true,
            "text": "How often are we as adults told that we need to settle? For me, it started at five years old with a painstakingly constructed and extensive Christmas List which made my parents laugh, pat me on the head, and subsequently present me solely with the first item. Similarly, in the adult world, viewers never tire of the premise on \"The Property Brothers\" where the couple wants to purchase a waterfront home with a pool and a carriage house and ultimately settles for a beautifully remodeled spread overlooking a swamp with a hot tub and a finished basement. And I don't even have to tell you that, much like my childhood friends, I thought I would marry someone who resembled a young George Michael, but ended up instead with a partner who looks more like George Costanza (sorry baby, you know I love you). This familiar concept is what makes Google Home, a smart speaker with a whole lot more, so appealing: it perfectly caters to the fantastical aspirational side of us because you simply do not have to settle! The laundry list of things that it can do is pretty great: play music from different apps and playlists, as well as randomly, provide you with the weather forecast and time, assist with Google searches, set alarms, tell jokes, even engage in trivia and Mad Libs(!), I have been told. For a much more entertaining list than the one I have provided, please refer to the latest Google Home commercial starring Macaulay Culkin, which will most certainly make you smile. Other than the fact that my mother-in-law insists on placing Google Home in the bathroom, since she is convinced it is the air freshener (another reviewer also mentioned it resembles this), I must say that this product is truly incredible and a welcome addition to our home!",
            "author": "Renovator",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"How did I ever function without this?!\"",
            "rating": 5,
            "date": "12/18/2018",
            "recommended": true,
            "text": "Decided to venture into the world of Google Home & so happy I did! I used to use my \"Ok Google\" function randomly on my cell phone; mainly while driving, for a hands-free experience.. Never thought of using it at home for random information..But, with this amazing Google Home, I find myself using it all the time! It's great from early morning (when I'm getting ready for work, getting dressed, & need to know the traffic situation that day or the weather or sports & news.) Oh, of course, listening to music is what I use most! It connects smoothly to my favorite music streaming apps & all I have to do is say, \"Hey Google, play (this song, band, etc.)\" Google Home also works perfectly connected to my Google connected services on my cell phone, such as my calendar, for example, if I need to know my schedule the next day or info on special events coming up. It really is like having my own personal assistant..a very 'worldly & brilliant' assistant, that could literally answer any question I could think of! Even tell me a joke if I needed a corny laugh lol. \n Setting up the Google Home couldn't have been any easier! I usually look up a video online for easy installation, but I didn't even need it.. Out of the box, it comes with a card with a couple steps to set up (the wire-power connection, download the Google Home app (on your mobile device)..& the rest is beyond simple & quick..Thru the app, the connections & start up are all done automatically, with minimal input. I was so impressed at how quickly it was set up & ready to go! I love the sleek design & compactness; not much bigger than a soda can but twice as wide...& I know it might sound weird but I absolutely love the little dot lights that light on the slanted top! They light up in different colors, & spiral sometimes, for different commands, questions or purposes. To me, this looks so 'futuristic' & looks perfect with the rest of my bedroom decor! \n I got this, along with a couple other Google Home connected devices, that I'll review separately.. But just a heads-up~ Everything in the Google Home line connects as easily as this was, to set up. I'm telling you, this Google Home will open your eyes to a whole new world!",
            "author": "Tommy305",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"This is the Middle Child of the Google Home Line\"",
            "rating": 3,
            "date": "01/12/2019",
            "recommended": true,
            "text": "I am perplexed as to the current viability of the Google Home smart speaker. Since it's inception Google has added the Home Mini (much less expensive), the Home Max and now the Home Hub with a digital display (costing just slightly more than the Home speaker. It seems that this middle child has been squeezed out of the family.\n\nHere are my observations and experience. \n\nPROS: The Google Home speaker with Google Assistant will capably answer any question you can think and responds with great sound quality. Like all of the previously mentioned Google devices you can make phone calls, control smart home devices, get recipes and self-help info, control your TV, etc. Fairly capable audio with it's 2 inch driver and two internal passive radiators, \n\nAPPEARANCE / FEATURES: It looks like and air freshener. It does have a clean look and does not look overbearing in my den. The flat, slightly inclined top surface is a touch panel where you can change the volume, play and pause the music or activate the Google Home assistant with a tap. I like the four multi-colored lights that race in a circle to indicate that the device is responding - easy to see across the room. The physical button to mute the speaker (suspend listening) and avoid inadvertent responses is a great feature as well. Excellent device for streaming music services (i.e. Google Play, YouTube, Spotify, Pandora, etc.). The Home is also bilingual to accommodate two languages such as English and Spanish at the same time and recognize commands in both languages interchangeably. \"Continued Conversation\" and Multiple Actions\" enhancements have been added to improve user experience. Hands-free calling and Bluetooth allows import of contacts from your phone to make calls. Home also uses Bluetooth to sync up to other devices.\n\nCONS: Google's middle offering smart speaker still cannot integrate with Google software features. No integration with Gmail to get insight on new e-mails. Same with Google Calendar - not able to create new events (although it can read out existing events in your Google Calendar), cannot make phone calls with Google Voice or jot down some quick notes in a Google Doc. No other color options out-of-the-box unless you add an aftermarket snap on base or cover. \n\nSUMMARY: The Google Home speaker is best suited for someone that wants decent sound quality without having to spend big bucks. Pairing a Google Mini and a Bluetooth speaker may be a better option. And the price seems to be falling - thus making it more attractive.",
            "author": "Rick",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Not too big, not too small, just right!\"",
            "rating": 5,
            "date": "12/12/2018",
            "recommended": true,
            "text": "I received these items free of charge through the Lowes Loop program to review and report on.\n\nGoogle Home/Mini/Max Smart Speakers\n\nInitial Setup and Performance:\n\nThe Google Home was the last module received and was just as easy to set up. A quick check with the Google Home app found that the Home was waiting for connection. The controls integrated into the top are more versatile and responsive than those found in the Home Mini or Home Max, with the pause and volume functions on the top that worked well.\n\nVoice commands on the Home worked well, although there was often some confusion between speakers in the kitchen and living room when I tried to get the Home to play music. If the Mini could hear me better, it would start playing music rather than the Home. I don't doubt that there's a setting that would remedy this, but I haven't found it yet.\n\nSpeaking of sound quality, the three speakers (Home, Home Mini and Home Max) were as expected, with the sound quality and maximum volume increasing with size. While none of them were a substitute for a proper hifi system, each was of adequate quality for background listening. The big boy, the Max was capable of respectable sound quality and volume in a smallish room like my office although it was no match for either the monitors attached to my computer (M-Audio Studiophile DX4) or my vintage 2-channel system with large English monitors. Most surprising though was the sound quality that came from the Home speaker, the mid sized one. I could hear actual bass coming from them and I was repeatedly and pleasantly surprised by the quality of the Pandora stream being played. This is the Mama Bear of the three, just right, not too big but big enough to please.\n\nAs I have an Amazon Echo Dot placed beside the kitchen Home Mini, I was able to evaluate the relative sound quality between them, as well as the effectiveness of their responses.\n\nIn terms of the sound quality, the Echo Dot has a fairly thin and tinny sound, befitting its low price. It's good for low background listening or spoken audio, such as news. The Home Mini has a much smoother sound, and although lacking in bass, makes those spoken audio or short audio clips much more listenable. However, if you're like my wife, you will play it loud without a care for the sound quality and anything, including her transistor radio, will do that.\n\nAs far as the quality of the responses to questions go, simple stuff like \"how many milliliters in a quart\" or \"what's the nearest Italian restaurant\" are pretty easy and accurate. But the AI response for most other things is pretty lacking. One advantage of the Echo is that it can notify you when your package has shipped or arrived and Google has yet to yield that information to me. Of course, you will be expected to ask it to tell you a joke, but Google, was it necessary to have the punch line end with a figurative rimshot? The noises at the end are just juvenile and Amazon doesn't use them.\n\nImpressions and Conclusions:\n\nAny of the Home speakers will interface with the Google system and the Home Mini is small and inconspicuous for placement around the house. The original Home is the Goldilocks/Mama Bear, just right. It takes up hardly more room on a table than the Mini but has a fully-baked sound quality. Which brings us to the Home Max. Yes, it's sound quality is even better, but at a cost of size. It has transitioned from a compact smart speaker to a large unit that occupies quite a lot of space, filling a bookshelf or other similar sized space. If you want your smart speaker to substitute for a full-fledged sound system, then this is your speaker. But perhaps a better choice would be a Google-compatible receiver and speakers that would outpace the Max in sound quality.",
            "author": "SteveMac",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great addition to the home\"",
            "rating": 5,
            "date": "12/11/2018",
            "recommended": true,
            "text": "Do I need it, would I even use it?\nThis device can be a valuable addition to your house. Just thinking of all the things that this little device can do and what it replaces. It is kinda of like combining a dictionary, encyclopedia, personal organizer, clock, timer, headline news, recipe book, traffic monitor, cell phone, etc, etc into a small 4” high round decorative device. \n\nThis is probably one of the most versatile information tools you could add to your household. Literally you will have a world of information at your fingertips combined with the ability to automate your home. \n\nUnboxing: First props to google for not making me get a machete to open the box. Packaging is clean, not excessive and easy to open. In the box is the speaker, power cord and paperwork. \n\nPhysical Setup\nThe device itself is a sleek, modern looking small cylinder that will easily fit into most room décor. Find a room location, plug it in and the physically setup is done. \n\nSoftware Setup\nFor this part you will need a smartphone and a Gmail account. From your phone download the google home app. Open the app and it will walk you through a sign in process and the google home setup. Google has done an excellent job of making this process easy and painless. Just answer a few questions and google will do the rest. At the end google will ask you to train your voice. This is important as google allows you to have multiple users, each identified by their voice. Each user will receive their own personal results to inquiries. For example, if you ask google how long to get to work, google will identify who is speaking and determine, based on traffic how long it will take that person to get from home to their work. A second person with a 2nd work address will get a different result. \n\nIts setup, now what\nFor the google home to know that you are talking to it, you get its attention by saying “Hey Google or Ok Google” followed by your inquiry. The device is really smart and will understand a question in multiple forms. For example, if checking today weather, you could ask OK google, what's the weather OR will it rain today OR do I need to take my umbrella and in all cases the google home will tell you todays weather. This is where the fun begins, just start asking any questions. \n\n\nIs it worth it, would I use it\nIf you have never seen it or used it, you might be thinking, why do I need this, is it a just a novelty item. It's not, imagine anything that you might search for on your computer or other sources can now be done verbally by just asking. Get answers about weather, traffic, stock prices, news, distance to the moon or calculations like how much is 15% of 15056. You can even get driving directions, order food, find your phone, make a call, control smart devices in your house, play music, set alarms or timers, find a recipe and much more. \n\nPhone integration\nAlong with asking general questions the Google Home integrates with your phone. You can ask thing like, Hey Google call mom” or “how to I get to Autozone” then google will answer and send the driving directions to your phone. This is also handy if you misplaced your phone, just ask where is my phone and google will call your phone. Note on making calls, Google looks to your contacts in Gmail when making a call. So if you have the name mom in your Gmail contacts along with her phone number, you can tell google to call mom. If, however, you are an iPhone user you will need to copy you contacts into google so that the Google Home will have access to the names and numbers. If the number is not in your google contacts you could just tell google the number to call. \n\nSmart home integration\nThere are an ever number of growing products that work with the Google Home. These products allow the Google Home to control appliance and devices in your house. Too many to list here but in general you could control your TV, lighting, thermostat and other smart devices in your home. This will give you the ability to say “Hey google, turn on the kitchen lights” as an example. \n\nConclusion\nThe is an amazing and versatile device, from telling you jokes or readings ebooks to keeping your schedule or ordering food. Just when you might thing that you have discovered all this can do, google keeps adding functionality. For me this was a great addition to my home.",
            "author": "Tony",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Fun to use, Good sound\"",
            "rating": 5,
            "date": "12/14/2018",
            "recommended": true,
            "text": "Google Home\n\nIncluded:\nGoogle Home unit\nAC power adapter with a nice long cord.\nGet Started Card\nCard with suggestion on what to ask.\nProduct info Card\n\nNeeded \nWiFi network\nElectrical outlet\nAndroid or iOS device with Bluetooth enabled\nGoogle Home app\nA google account\n\nThe Home is powered by the Google Assistant. You can ask it question, set alarms and reminders, get news, traffic info, make calls to your contacts list, use it as an intercom with two or more Google Home units, play back music and connect to Bluetooth speakers by speaking commands to the Home unit.\n\nThe Home unit is a little shorter than a can of spray paint but about 4 inches in diameter. There are two microphone on the edges of the top. Tapping the top center pauses and resumes play of whatever is currently playing. Sliding a finger across the beveled top will give you a manual method for volume control. Of course you can always use your voice VOLUME UP/DOWN. When touching the white LED's indicate your volume level. There are 4 colored LED's which react to your voice to show you that it's thinking. I own an Amazon Alexa, and I've notice less hesitation on most commands than with the Google Home. I think (my opinion), that basically for most look up commands you are just doing a Google search....just like on a computer. Alexa has dedicated activities and I believe the faster response of Alexa is because of that. But the response is Ok with Google Home especially if you don't have anything to compare it to. Home also has much better sound.\n\nHome features a power port on the bottom to provide power, and a microphone switch on the back that enables you to turn off active listening and a power status light. On the bottom, you can see a circular rubber mat to keep it still on your table.\n\nVoice recognition very good. Good results were obtained from across the room or speaking gently 10 feet away, with only an occasional need to repeat commands.\n\n“OK GOOGLE” or “HEY GOOGLE are the start commands. \n\n“OK GOOGLE SET A TEN MINUTE TIMER FOR PIZZA”.\n\nYou string commands together such as \n\n“HEY GOOGLE PLAY BRIDGE OVER TROUBLE WATERS ON SPOTIFY”\n\nThe Google Home can take control of several thousands external things. You can find brand/devices in the settings section of the app. Stream music through music apps like Pandora (free account), Spotify (paid account only), YouTube Music, iHeartRadio and more. It can send a request to pull up a YouTube video over to your Chromecast (another smart unit). \n\nThe Home is also a smart home hub in that it can also integrate with smart devices like smart light bulbs, (I have Sengled bulbs and a Nest Thermostat and Outdoor camera). Tell Home about your devices, allow them to log into your external device account and boom your connected.\n\nConnecting through the Google Home app, the app will teach you things about the Home, like how it works and resources that provide instant access to a wide variety of free audio content. Settings is your friend, spend a little time exploring what you can connect. \n\nYou cannot connect by wire to an external speaker, but you can via Bluetooth. \n\nGoogle Home is a pretty capable audio device. Once your smart device is set up with the Home, it's simple to begin listening to music. Either give the speaker a shout for some tunes, being as specific or obscure as you'd like, or just hit the Cast button near the top to give your phone free reign to push its audio straight to the Home. Remember settings? You can select your primary music service, but if your tell it to look for a specific service it will.\n\nIt is cool that Home has the ability to both receive and send Google Cast signals, making it able to stream music from your phone and send video streams to any Google Cast-compatible connected devices.\n\nWhile Home beats the heck out of Google Home Mini for sound, it is not a Hi-Fi sound. It does some bass and some mid tones sounds and they are good– but, if you're expecting Google Home to replace your Hi-Fi setup forget it. \n\nThis unit is a nice main unit in a Home Google network. You can add Google Mini Home in other locations anywhere within range of your WiFi, outdoor shed, pool area (note NOT water proof), think intercom. \n\nHome is bilingual. In the settings, you can equip two languages such as English and Spanish at the same time and it'll recognize commands in both interchangeably. Again settings! \n\nIn setting again, you can change voice gender of the Google Assistant and the nationality, American, English or Australian. \n\nHome can customize its responses for all of your family members based on who's talking. Each of your family members needs to download the Home app to a phone, then they will be able to train the Home to recognize their voices by repeating the wake words a couple of times. \n\nThe Home supports six different accounts, and offers individualized responses to questions about calendars and traffic. The Home will also play personal playlists on request. The feature works well for the most part, as long as your family members don't sound similar. \n\nYou can search for a recipe on your phone, or just ask for a meat loaf recipe, It'll walk you through the ingredients and step-by-step directions. The Home can wait until you tell it that you're ready for the next ingredient or step, and skip forward and back in the directions as you need. \n \nIs Google listening to me? How safe is my information? How do I weigh privacy against convenience?Good questions to ask, but Home probably won't have the answers to your worries. The Home only records what you say after you activate it with a tap, or with the wake words. You'll see the LEDs light up in so you'll know that it's listening. In the Home app, you can look over your search history and delete a specific query or clear the history entirely if you'd like. There's also a mute button that stops it from listening for its wake word at all.\n\nThis a a great unit for the cost. I would recommend it for casual music listening, answering questions, getting traffic reports and most things you might ask Google on a computer.\n\nDisclosure I was provided this unit for evaluation by Lowes.",
            "author": "Acyducy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        }
    ],
    "reviewStats": {
        "reviewCount": 155,
        "percentRecommended": "94",
        "averageStars": "4.7",
        "starCounts": {
            "five": 119,
            "four": 25,
            "three": 6,
            "two": 3,
            "one": 2
        }
    },
    "questions": [
        {
            "question": "\"Does google home require the google hub?\"",
            "author": "Anonymous",
            "date": "12/31/2018",
            "answers": [
                {
                    "author": "Foster",
                    "date": "01/17/2019",
                    "text": "No, You do not need the Google Hub to use Googe Home",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                },
                {
                    "author": "Frank",
                    "date": "01/16/2019",
                    "text": "No Google Home does not require a Google hub. It sets up quickly and just needs access to a wifi network.",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                },
                {
                    "author": "Rick",
                    "date": "01/12/2019",
                    "text": "No. It works independently with the Google Home app on your mobile device.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "Cameron",
                    "date": "01/11/2019",
                    "text": "No. It only requires the google assistant app, an outlet, and WiFi.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "dtSeattle",
                    "date": "12/31/2018",
                    "text": "No it doesn't. It requires the Home app but that runs on just about anything. I use it on my iPhone.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Does it work with Apple IPhone 7\"",
            "author": "Anonymous",
            "date": "06/11/2018",
            "answers": [
                {
                    "author": "candy1land",
                    "date": "12/15/2018",
                    "text": "Yes - you just download the Google Home app and it works on any smart phone.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "Acyducy",
                    "date": "12/15/2018",
                    "text": "Yes through the Google Home App",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Lori24",
                    "date": "12/11/2018",
                    "text": "yes",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Familyman",
                    "date": "12/10/2018",
                    "text": "Just download the google home app",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "battle",
                    "date": "07/01/2018",
                    "text": "Yes. You can link them via bluetooth.",
                    "helpful": {
                        "yes": 4,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"Can you relocate the device to another room without reprograming?\"",
            "author": "Anonymous",
            "date": "05/05/2018",
            "answers": [
                {
                    "author": "Ned-44",
                    "date": "12/20/2018",
                    "text": "I haven't moved mine but don't see why you couldn't.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "KJK",
                    "date": "12/19/2018",
                    "text": "Yes, but you will need to rename it in the app.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Bomber1955",
                    "date": "12/18/2018",
                    "text": "Yes, with no problem. You may want to rename it for its new location so know what item your talking to.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Jer",
                    "date": "12/10/2018",
                    "text": "You can in the setting under the device in the google home app",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "lolrekt",
                    "date": "11/06/2018",
                    "text": "I can relocate your mom without programming it.",
                    "helpful": {
                        "yes": 2,
                        "no": 2
                    }
                }
            ]
        },
        {
            "question": "\"Can new devices be added later after initial setup?\"",
            "author": "Anonymous",
            "date": "05/05/2018",
            "answers": [
                {
                    "author": "Bomber1955",
                    "date": "12/18/2018",
                    "text": "You can add as many devices as you want to this system at anytime. Once you have your system up and running and say you decide to add a few Google Minis, speakers, WiFi extenders or remote light systems, you just need to add them to your google app on your phone to make them all work together.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "Acyducy",
                    "date": "12/15/2018",
                    "text": "Yes",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "InkysMom",
                    "date": "12/11/2018",
                    "text": "Absolutely. Build your Google HOME system as you are able.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Jer",
                    "date": "12/10/2018",
                    "text": "Yep",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "ToyMan",
                    "date": "12/08/2018",
                    "text": "Yes and as you add more products you become better at it.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Can more than one voice be use to operate it?\"",
            "author": "Glide007",
            "date": "12/09/2017",
            "answers": [
                {
                    "author": "Jake",
                    "date": "12/30/2018",
                    "text": "Yes!",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                },
                {
                    "author": "Bomber1955",
                    "date": "12/18/2018",
                    "text": "Yes, as long as you don't set it up to your voice only. You will be given this option in the set up process.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Acyducy",
                    "date": "12/15/2018",
                    "text": "Yes",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "RoyMd",
                    "date": "12/10/2018",
                    "text": "Yes, my wife and I both use it.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Unicorn241982",
                    "date": "12/10/2018",
                    "text": "When my husband connects his phone to it I receive a notification on my phone that he is connected. I hope this helps.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Do you have to have this Google Home device to work with the google minis or do the minis work separately on their own?\"",
            "author": "southerngirl",
            "date": "11/27/2017",
            "answers": [
                {
                    "author": "CptOrion",
                    "date": "03/06/2019",
                    "text": "The mini can work by itself",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "Jake",
                    "date": "12/30/2018",
                    "text": "The minis will work alone.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Bomber1955",
                    "date": "12/18/2018",
                    "text": "Both",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "TJ",
                    "date": "12/10/2018",
                    "text": "No You don not need the home to work mini. Each works well individually. How connected you want to make your home may determine if you go full on Home vs. mini.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "11/29/2017",
                    "text": "No, this is not required to use the Home Mini.",
                    "helpful": {
                        "yes": 6,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"Do u have to have a smart phone to set it up and use it\"",
            "author": "Newbie",
            "date": "07/14/2017",
            "answers": [
                {
                    "author": "Cameron",
                    "date": "01/11/2019",
                    "text": "Yes. You need a smart phone with the google home app which can be downloaded on android and ios",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                },
                {
                    "author": "Jake",
                    "date": "12/30/2018",
                    "text": "You have to have an Android or iOS device (phone or tablet) with the Google Home app installed to use this.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Acyducy",
                    "date": "12/15/2018",
                    "text": "Some sort of smart device phone, pad, tablet, PC MAC is needed so that you can use the Google Home App to set up Home.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "TJ",
                    "date": "12/10/2018",
                    "text": "Yes",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "07/16/2017",
                    "text": "This can be set up with a PC.",
                    "helpful": {
                        "yes": 14,
                        "no": 3
                    }
                }
            ]
        },
        {
            "question": "\"Can this also be used in replace of the home bridge for halo lights?\"",
            "author": "Anonymous",
            "date": "11/26/2018",
            "answers": [
                {
                    "author": "Bomber1955",
                    "date": "12/18/2018",
                    "text": "Yes it will work with Google Home",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Acyducy",
                    "date": "12/15/2018",
                    "text": "Don't know about this specific device, but typically you use the Home App to log into your Device's account and Home App will control those items.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Mike",
                    "date": "12/11/2018",
                    "text": "Yes as long as those lamps are compatible with the google applications.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "NCRocky",
                    "date": "12/10/2018",
                    "text": "Google Assistant is compatible with Halo Lights but the bridge from Halo is required",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"can it notifty a cell phone when atctived\"",
            "author": "Anonymous",
            "date": "05/01/2018",
            "answers": [
                {
                    "author": "KandieWood",
                    "date": "01/04/2019",
                    "text": "Mine does, I have 2 in my master bedroom and the dogs knocked the one for the lights over the other day. I received a notification that it had been unhooked from the WiFi and I am 30 miles away from the device..",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "TV",
                    "date": "12/13/2018",
                    "text": "Yes, All you have to do is tell it to call the person in your contacts.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "Unicorn241982",
                    "date": "12/10/2018",
                    "text": "When my husband connects his phone to it I receive a notification on my phone that he is connected. I hope this helps.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Installation requirements? Monthly fee?\"",
            "author": "Larry",
            "date": "05/19/2017",
            "answers": [
                {
                    "author": "KandieWood",
                    "date": "01/04/2019",
                    "text": "No there is no monthly fee from Google per say. You will have your monthly bill from your internet provider and your television provider. Along with paid subscriptions like YouTube, Pandora, ect.",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                },
                {
                    "author": "C",
                    "date": "06/29/2017",
                    "text": "Installation was fairly simple. The device comes with instructions for downloading the app, plugging in the device to a power outlet, and connecting GH to your wireless internet.",
                    "helpful": {
                        "yes": 36,
                        "no": 9
                    }
                },
                {
                    "author": "C",
                    "date": "06/29/2017",
                    "text": "Google Home, alone, does not require a monthly fee, but does require internet access... which may incur a monthly fee from your service provider.",
                    "helpful": {
                        "yes": 31,
                        "no": 2
                    }
                }
            ]
        }
    ]
}