{
    "descriptions": {
        "overview": "All plungers are not created equal. This mini bellows design is for use on flat surface drains like sinks, showers, and tubs.",
        "list": [
            "All plungers are not created equal, this mini bellows design is for use on flat surface drains like sinks, showers, and tubs",
            "Compact bellows design clears clogs fast",
            "Plunging tips: 1 block all Other outlets before plunging, 2 place plunger over drain creating a seal, 3 gently push down to release air, then pull up to fill with water and begin plunging with up and down motion",
            "Designed to clear even the toughest clogs"
        ]
    },
    "specs": [
        {
            "title": "Plunger Handle Material",
            "spec": "Plastic"
        },
        {
            "title": "Plunger Head Material",
            "spec": "Plastic"
        },
        {
            "title": "Plunger Head Diameter (Inches)",
            "spec": "5"
        },
        {
            "title": "Storage Caddy Included",
            "spec": 0
        },
        {
            "title": "Handle Length (Inches)",
            "spec": "3"
        },
        {
            "title": "UNSPSC",
            "spec": "47121800"
        },
        {
            "title": "Color/Finish Family",
            "spec": "Multiple colors/finishes"
        }
    ],
    "reviews": [
        {
            "title": "\"This is the BEST little Plunger Ever\"",
            "rating": 5,
            "date": "02/16/2017",
            "recommended": true,
            "text": "Am I the only one that thinks this is the best idea ever?  It makes drain clogs (especially in my shower) SO easy to clear and I love that its small so it easily fits under all of my faucets in the sink.  So easy to store and so inexpensive its an essential!",
            "author": "Lindsay",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 20,
                "no": 0
            }
        },
        {
            "title": "\"Mini plunger\"",
            "rating": 5,
            "date": "06/14/2017",
            "recommended": true,
            "text": "Saw a quick two minute video how to use plunged and whala! Amazing drain unclocked in seconds.....",
            "author": "Amateur",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 12,
                "no": 0
            }
        },
        {
            "title": "\"Lesson learned\"",
            "rating": 5,
            "date": "07/24/2018",
            "recommended": true,
            "text": "Don't put carrot peelings down the disposal. I was about to call an expensive plumber, but thought I'd at least try getting a sink plunger first. Then I saw this strange, cheap looking thing. Don't let its looks fool you. It unclogged my sink in just a few attempts (would have the first time if I'd read the directions. Doesn't work like your typical plunger, must slowly lift up to fill with water, then pump to work the clog.) Powerful suction, great design, and $3 vs whatever the plumber would have charged? Sold!",
            "author": "Howiehere",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Awesome!\"",
            "rating": 5,
            "date": "08/05/2018",
            "recommended": true,
            "text": "I had a sink that was completely stopped up.  I was On the verge of calling a plumber or taking the sink apart myself.  I picked this up at Lowe's and in a few mi utes the clog was gone.  This has excellent suction!  As previous reviews mentioned, read the directions and pull up slow to draw the water to help loosen the clog.  Best $3 I've spent in awhile!",
            "author": "JrPumber",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Cleared my slow drain!\"",
            "rating": 5,
            "date": "01/06/2018",
            "recommended": true,
            "text": "I've used many different products on my slow draining sink and this plunger has done the best job, by far!  It cleared the blockage in just a few minutes. It's the best $3 I've spent in awhile. I can't recommend it enough if you have problems with a blocked or slow draining sink.",
            "author": "Mel88",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Works Great\"",
            "rating": 5,
            "date": "05/24/2018",
            "recommended": true,
            "text": "I used this sink plunger to clear a slow-draining bathroom sink. It took about a minute of plunging and the sink is now clog-free. This product is really good with a strong suction.",
            "author": "Navi",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Really Works\"",
            "rating": 5,
            "date": "05/12/2019",
            "recommended": true,
            "text": "I very rarely write reviews on products, but this product worked so well. I had a pretty big kitchen sink clog that I was positive I was going to have to call someone to fix, but I decided to check on the site for anything that might help. I picked this plunger up, went home, blocked the garbage disposal side of my sink and used this on the other side. In less than a minute I could hear the pipe clear and the water drained from my sink. Definitely worth it!!",
            "author": "Nik",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"so CHEAP, doesn't work\"",
            "rating": 1,
            "date": "01/01/2018",
            "recommended": false,
            "text": "Got it for my kitchen sink. After 2 plunges it became misshapen. I popped it back to the original shape but it doesn't work for plunging. It is way too cheap and just bends too easily in order to get a good plunge.",
            "author": "nes2424",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 4
            }
        }
    ],
    "reviewStats": {
        "reviewCount": 8,
        "percentRecommended": "87",
        "averageStars": "4.5",
        "starCounts": {
            "five": 7,
            "four": 0,
            "three": 0,
            "two": 0,
            "one": 1
        }
    },
    "questions": [
        {
            "question": "\"Can I use this plunger to deal with a clogged garbage disposal unit\"",
            "author": "Anonymous",
            "date": "12/23/2018"
        }
    ]
}