{
    "descriptions": {
        "overview": "Advancing line while trimming is easy with the BLACK+DECKER™ 6.5 Amp 14-in POWERCOMMAND® Electric String Trimmer/Edger with EASYFEED™. Feed more line when you need with the press of a button. The powerful motor with POWERDRIVE™ transmission helps you power through tough weeds, grass, and overgrowth. Use the wheeled edge guide to put the finishing touches on your lawn around driveways, sidewalks, and flower beds.",
        "list": [
            "EASYFEED™ allows you to advance your line with the push of a button with no bumping required",
            "The 6.5 amp motor and PowerDrive™ transmission provide maximum performance when trimming through the toughest weeds, Grass and overgrowth",
            "Flips from trimming to edging in seconds with built in wheel guide for precise edging along sidewalks and driveways",
            "Lightweight design with adjustable handle and height positions provide maximum comfort and control",
            "Cord retention system prevents accidental cord disconnection",
            "14-in cut path gets the job done fast",
            "Includes (1) BESTE620 string trimmer, (1) AF-100 spool, (1) guard and (1) auxiliary handle"
        ]
    },
    "specs": [
        {
            "title": "UNSPSC",
            "spec": "27112700"
        },
        {
            "title": "Adjustable Height",
            "spec": 1
        },
        {
            "title": "Amps (Amps)",
            "spec": "6.5"
        },
        {
            "title": "Best Use",
            "spec": "Up to 1/2 acre; up to 100 feet from electrical outlet"
        },
        {
            "title": "Commercial/Residential",
            "spec": "Residential"
        },
        {
            "title": "Cutting Swath (Inches)",
            "spec": "14"
        },
        {
            "title": "Edger Capable",
            "spec": 1
        },
        {
            "title": "Line Feed",
            "spec": "Automatic"
        },
        {
            "title": "Package Contents",
            "spec": "BESTE620 6.5-amp corded EASYFEED&#8482; trimmer/edger, (1) AF-100 spool, (1) guard and (1) auxiliary handle"
        },
        {
            "title": "Recommended Line Diameter (Inches)",
            "spec": "0.065"
        },
        {
            "title": "Series Name",
            "spec": "EASYFEED"
        },
        {
            "title": "Shaft Length (Inches)",
            "spec": "48"
        },
        {
            "title": "Shaft Type",
            "spec": "Straight"
        },
        {
            "title": "Single or Dual Line Feed",
            "spec": "Single"
        },
        {
            "title": "Warranty",
            "spec": "2-year limited"
        },
        {
            "title": "Weight (lbs.)",
            "spec": "5.3"
        },
        {
            "title": "ETL Safety Listing",
            "spec": 0
        },
        {
            "title": "CA Residents: Prop 65 Warning(s)",
            "spec": "Yes"
        },
        {
            "title": "CSA Safety Listing",
            "spec": 1
        },
        {
            "title": "UL Safety Listing",
            "spec": 1
        }
    ],
    "reviews": [
        {
            "images": [
                {
                    "smallName": "ca57bec0-4726-519a-a280-3b93ed60cf40",
                    "largeName": "599f031d-e3ce-5751-9b47-f2681e7a99e7"
                }
            ],
            "title": "\"Terrible product\"",
            "rating": 1,
            "date": "07/29/2018",
            "recommended": false,
            "text": "Auto spool is terrible. It would have been better without. I havegonetheough a completely filled spool within a matter of 20 mins without much accomplished. Also the guard isnt very sturdy as ive been hit to the point of bleeding with all the spare string it needs to get rid of. In the pic it shows 4 times that it spooled too much and the remains is on the ground. Frustrated to the max! Do not buy",
            "author": "AJ",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 33,
                "no": 1
            }
        },
        {
            "title": "\"string requirement too small for motor power.\"",
            "rating": 1,
            "date": "08/01/2018",
            "recommended": false,
            "text": "The power and usability of this trimmer is good but you have to use 0.065 line which is the smallest diameter and not mush thicker than fishing leader line. if you use any other size line, it will not feed at all. If you use 0.065 line, you cannot edge, at all. In weed waking wacking mode, I can make it about 20 feet a long my side walk or driveway it eats up an entire spool of line. you have to constantly re-spool this with line because the line is way too small for how powerful the motor is. The Lowes description says 0.065 line is recommended but on the spool itself it say only use 0.065 size line so 0.065 line is required. Just for reference, 0.12 is standard size for gas trimmers.",
            "author": "Bob",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 27,
                "no": 1
            }
        },
        {
            "title": "\"Eats line and Handle Collapses on it's own\"",
            "rating": 1,
            "date": "05/27/2018",
            "recommended": false,
            "text": "Every time you stop and pull the trigger again a little line is fed out.  This is not intentional...you will go through line faster than necessary.The line feed option when needed is very convenient/effective.The forward handle is adjustable...the problem is that when you swing left and right the handle will decide to adjust on its own.  As it collapses the weed eater hits the ground and burns the grass to the ground in that spot.  It's also hard on your back adjusting each time it collapses.",
            "author": "Burned",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 53,
                "no": 3
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "05/10/2018",
            "recommended": true,
            "text": "The weedeater is a good replacement for a much heavier gas weedeater. I dont mind electric cords, I just recently bought an electric mower so take that for whatever it is worth. The weedeater is a bit short (5 foot 6 person) and the replacement cord spools are expensive, those are my criticisms. Overall it works well, consistently and is easy to handle. No more heavy and cumbersome weedeaters, oil mixtures or hot motors burning my arm. I am satisfied and would buy it again.",
            "author": "geolenx",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 24,
                "no": 0
            }
        },
        {
            "title": "\"As advertised\"",
            "rating": 4,
            "date": "02/27/2018",
            "recommended": true,
            "text": "I used this trimmer soon after purchase and am very satisfied with it's performance.  I selected this model because I have a small plot of grass and didn't wish to deal with a two cycle engine again.  I considered a battery operated trimmer but decided that an electrical cord is no more inconvenient than continually recharging the battery.  This model is light duty but does what I needed it to do.",
            "author": "Jayen",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 99,
                "no": 5
            }
        },
        {
            "title": "\"Best Medium-Duty String Trimmer\"",
            "rating": 5,
            "date": "03/24/2018",
            "recommended": true,
            "text": "I had borrowed an old style trimmer and was having too much trouble loading new line, and keeping it from feeding too fast.  This new trimmer has better balance, push button line feed when needed, a shorter length for storage, and a wheel to maintain the proper height when edging.  Overall I think the design is very nice.  It also uses an extension chord, which is more convenient for me.  I have always electric mowers, and now this trimmer.   Good Job BLACK+DECKER.",
            "author": "Douglass",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 47,
                "no": 5
            }
        },
        {
            "title": "\"Not sturdy enough\"",
            "rating": 3,
            "date": "06/11/2018",
            "recommended": false,
            "text": "I have had two of this particular model.  The first one, the cap over the string compartment became cracked and falling apart within a couple of uses.  String kept coming out in longer than needed lengths or would break off inside the spool; causing me to have to stop and restring.The second unit didn't seem to be as fragile, however, I still had to replace the cap and the spring loader.  I just had this unit burn up on me.  It would not shut off when I took my fingers off the \"trigger\".  I think I am done with Black and Decker Trimmers.",
            "author": "Trimmer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 6,
                "no": 0
            }
        },
        {
            "title": "\"Lightweight, cleans yard well\"",
            "rating": 4,
            "date": "04/10/2018",
            "recommended": true,
            "text": "The wheel os a plus for quick edging, its telescopes a little taller than the one it reolaced frim 25 years ago. The only thing i dont really like about it is it doesnt feed the line as quick and easily as my old one",
            "author": "Rockportmom",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 45,
                "no": 1
            }
        },
        {
            "title": "\"Disappointing\"",
            "rating": 2,
            "date": "04/16/2018",
            "recommended": false,
            "text": "Bought this and trimmer for my daughter to replace an earlier model Black & Decker. This model's device for releasing more string to replace what has been worn down does not work well and frequently requires removal of spool to advance the line.",
            "author": "JohnCP43",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 73,
                "no": 4
            }
        },
        {
            "title": "\"Strind Advance Does Not Work\"",
            "rating": 1,
            "date": "05/22/2018",
            "recommended": false,
            "text": "You will be stopping every two minutes to manually take the spool apart to advance the string.  It's very sad that Black and Decker makes a product like this.  DO NOT BUY.",
            "author": "Chris",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 41,
                "no": 1
            }
        },
        {
            "title": "\"Don't like the easyfeed feature\"",
            "rating": 1,
            "date": "05/23/2018",
            "recommended": false,
            "text": "Every time I release the trigger and then activate it again, a small amount of line is dispensed. This unit uses far too much line, wasting most of it, and I have no control over it.I looked for a model with the bump feed feature, but there were none available.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 30,
                "no": 1
            }
        },
        {
            "title": "\"Do not buy, very frustrating\"",
            "rating": 1,
            "date": "05/06/2018",
            "recommended": false,
            "text": "Line constantly gets pulled inside and requires you to take apart and adjust the whole spool EVERY 3 MINUETS. Taking back to Lowes as I write this review. Very disappointing. Dont waste your time or money. Hoeing the next one we chose works well.",
            "author": "Whitney",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 54,
                "no": 8
            }
        },
        {
            "title": "\"works great\"",
            "rating": 5,
            "date": "05/24/2018",
            "recommended": true,
            "text": "I first bought another brand that was 40volt cordless and it was useless, unless you have 4 batteries to get your weed eating done. Now I went with a corded one and this one rocks!! Cordless I guess will work if you have a very small yard!!",
            "author": "Bill",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 18,
                "no": 2
            }
        },
        {
            "title": "\"Light Duty\"",
            "rating": 4,
            "date": "06/16/2018",
            "recommended": false,
            "text": "Only used this trimmer 3 times, and it works alright when string is at full length.  I have a small backyard, so very light duty along fence pickets and slab and when the trimmer starts missing grass blades it's time to push the string button. Starting to wonder about the other reviews and how long the string on the spool will last.",
            "author": "JwS",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "title": "\"Had better models.\"",
            "rating": 3,
            "date": "07/24/2018",
            "recommended": false,
            "text": "I've had similar older models and this jams a lot more often than previous ones. It works when there's a string, but I don't know how many times I had to turn it upside down and take it apart to get the string out and start again",
            "author": "Rachaelbetty",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Would Love to Give 0 Stars\"",
            "rating": 1,
            "date": "08/07/2018",
            "recommended": false,
            "text": "Just all around terrible. The handle that you clip on is the absolute worst part for me. It changes position on its own every 30 sec. which can be very annoying. Its supposed to be locked into one position but that is not the case. It jumps around on you and is very frustrating. Have an older model and never had any problems, decided to upgrade and it was a terrible choice. Going back to my older one. Id stay away from this.",
            "author": "Gavin",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Problem with the adjustable handle\"",
            "rating": 1,
            "date": "06/21/2018",
            "recommended": false,
            "text": "I purchased this model (BestE620) on the 12th of June, and returned it on the 20th of June. It has a defective adjustable handle. I assembled the unit properly, however, within seconds of engaging the line trimming device, the adjustable handle will start to shift upward until it is in the very last position closest to the user. This is usually within a minute of use, and has happened multiple times. It appears that the vibration of the trimmer causes the adjustable handle button to be pushed in / disengage somehow and allows the handle to move to another position. I am extremely unhappy and dissatisfied!",
            "author": "Oriek",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Simple, Easy to Use Trimmer\"",
            "rating": 5,
            "date": "07/08/2019",
            "recommended": true,
            "text": "I love the string advance button, power and edge feature",
            "author": "Txnerd",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 3,
            "date": "07/08/2019",
            "recommended": null,
            "text": "There is no review to accompany this rating.",
            "author": "Vickie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"did not work good\"",
            "rating": 1,
            "date": "06/16/2018",
            "recommended": false,
            "text": "the string did not come out when press the easyfeed button",
            "author": "ronald",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "title": "\"Like the previous one but now E-Z feed\"",
            "rating": 5,
            "date": "06/03/2019",
            "recommended": true,
            "text": "We have had several of this type of trimmer (they burn up the year after the warranty expires, but work great) and this one is improved with the E-Z feed string advance.  Expect it to perform well.  Likely will have to surrender to battery-power after this one, but prefer corded.  If you watch what you're doing you don't trip over the cord or cut it while using the trimmer, and it only stops if the power goes off.",
            "author": "Raymond",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Simple, Easy to Use Trimmer\"",
            "rating": 5,
            "date": "07/08/2019",
            "recommended": true,
            "text": "I love the string advance button, power and edge feature",
            "author": "Txnerd",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 3,
            "date": "07/08/2019",
            "recommended": null,
            "text": "There is no review to accompany this rating.",
            "author": "Vickie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Not good enough.\"",
            "rating": 2,
            "date": "06/05/2018",
            "recommended": false,
            "text": "Very weak, not much power, and small trim string, not as good as the previous B&D electric trimmers.",
            "author": "Wiley",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Good for a small yard\"",
            "rating": 5,
            "date": "05/27/2019",
            "recommended": true,
            "text": "I needed a trimmer/edger to maintain my small yard. It does what I need it to do. Some of the reviews say that they have problems feeding new string, but I have not experienced that on mine yet. If you don't mind working around a cord (which I don't), and your yard isn't too big (which mine definitely isn't), then this will work very well for you.",
            "author": "Andrew",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Bad\"",
            "rating": 1,
            "date": "09/06/2018",
            "recommended": false,
            "text": "Locked up and started smoking at the trigger",
            "author": "Danny",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Black Decker Electric String Trimer\"",
            "rating": 5,
            "date": "09/07/2018",
            "recommended": true,
            "text": "For me this trimmer cleaned up a mess from summer. As I injured my shoulder early summer. And couldn't pull on the starter rope to use has trimmers. This model featured to me a push button string feed . Has a small spoil of string  that can be purchased in groups of 3. I figured I d go thru  to many spoils being I do multiple yards.Glad to say it easily chopped away my summers over growth and the button feed was easy snd was strong enough to not need to replace spool.Finally a new feature glad I bought into , you won t be sorry either",
            "author": "Toolbox113",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"it's ok for a cheap model.\"",
            "rating": 2,
            "date": "07/04/2018",
            "recommended": false,
            "text": "pros: lightweight, has extension       cons: string feeds out Everytime you let go of trigger. going to go through a lot of line. the handle will adjust on it's own,  cord holder doesn't hold cord like it's intended and cord falls out even when it is in holder. would have bought a bump feed but couldn't find any.",
            "author": "Chris",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Broken and returned.\"",
            "rating": 2,
            "date": "06/26/2018",
            "recommended": false,
            "text": "Used the product twice. The wheel that's used for trimming along sidewalks broke off while using trimmer. Wasn't using along sidewalk but it still broke. Returned the product to Lowe's with no hassle. Decided not to replace with the same model. Considering a gas powered trimmer.",
            "author": "Doug",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Could Use Some Improvement\"",
            "rating": 3,
            "date": "09/05/2018",
            "recommended": true,
            "text": "I purchased this trimmer solely for the fact that it was cheaper, so I wasn't expecting a perfect tool, and my expectations were not exceeded. First, the good: This trimmer is very well build and comfortable to carry and use. The handy electrical line hook takes away the fear of coming unattached from the power. The nifty feature that you can expand, compress, and rotate the cutting hub is a very nice feature, and I always compress it while storing it. Now the bad: The handle used to hold the machine up comes lose every once in a while causing the handle to rotate into an uncomfortable position while trimming, making me stop what I am doing and readjusting the handle. The spool of line sometimes get caught on itself making the feeder button not work, causing me to stop what I am doing to fix the line.Other than those two complaints, this is a smart little device to have in your lawn and garden tool kit. All Black and Decker needs to do is reengineer the handle and string hub, and this would be the perfect machine.",
            "author": "Scott",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Overview of this weed eater\"",
            "rating": 2,
            "date": "10/07/2018",
            "recommended": false,
            "text": "I bought this one and used it one time. The handle would not stay locked in place so the angle to weed eat was difficult. Took it back and exchanged it for another and this one does the same. I do like the way it edges but other than that I would not buy again",
            "author": "Applan",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "images": [
                {
                    "smallName": "42c6ac06-2fcb-5242-a42d-1ebaf93efc7a",
                    "largeName": "c1225eb7-1189-5ded-9669-5a56fc4877a5"
                }
            ],
            "title": "\"trimmer\"",
            "rating": 5,
            "date": "08/07/2018",
            "recommended": true,
            "text": "the line feed works great just press the button and done",
            "author": "stu",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Love our Black and Decker easy feed weed eater\"",
            "rating": 5,
            "date": "10/15/2018",
            "recommended": true,
            "text": "Love love love the easy feed feature. Press the button and viola no stopping just continued working. We just moved back in our home and had so much gardening to do. This made the job so much easier. Just a little more expensive - but would buy again",
            "author": "Yana",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"I love plug in stuff.\"",
            "rating": 5,
            "date": "02/12/2019",
            "recommended": true,
            "text": "This works good for me. I like the idea of the battery operated cordless stuff the only problem is the battery seems to be dead when I need to use it and the motor is not as powerful. So I'm sticking to plug in.",
            "author": "ALV8",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"It does what it needs to do\"",
            "rating": 4,
            "date": "06/15/2019",
            "recommended": true,
            "text": "I like the string trimmers from about 10 years ago better than the new ones. But this one seems to work okay. I actually like the string feed button better that the old auto-feed model I had. I use less string than the old auto-feeder. I tried to like the edging wheel, but I found all it did was prevent me from getting the string to hit where I wanted. I removed the wheel assembly, and now I can really use this trimmer. Works great!",
            "author": "Mikeb77",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "",
            "rating": 1,
            "date": "09/06/2018",
            "recommended": false,
            "text": "This thing is garbage! Dont waste your money.. I don't have a very big yard so I chose to buy this cheap magnificent piece of crap.. I will definitely return this to Lowes as soon as I calm down. I wouldn't even say I've used it once since I didn't finish the whole yard. This thing had me cursing so much that my neighbors think I've gone crazy. Would give zero stars if I could.",
            "author": "toby",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 3,
                "no": 2
            }
        },
        {
            "title": "\"worst weed wacker ever do not buy this product!\"",
            "rating": 1,
            "date": "06/26/2018",
            "recommended": false,
            "text": "my last electronic Black & Decker weed wacker was amazing I have no complaints but this one is absolutely terrible! I don't have that much yard that needs weed whacking and I never returned products but this will be returned!",
            "author": "missy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 2
            }
        },
        {
            "title": "\"Adjustable handle does not work\"",
            "rating": 1,
            "date": "07/08/2018",
            "recommended": false,
            "text": "I bought one and assembled it. The instructions were very clear and the assembly went quickly. In use, however, the adjustable handle will become unlocked unexpectedly, dropping the trimming head to the ground. I exchanged it for another of the same model and after about 5 minutes of light use, the handle lock started letting go every few seconds of use. It's a shame, because I like everything about this trimmer except for badly designed handle mechanism. We really wanted to keep it but it has this one critical flaw.",
            "author": "Garry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Spool unscrews and loose from unit\"",
            "rating": 1,
            "date": "08/09/2018",
            "recommended": false,
            "text": "The spinner is apparently spinning backwards and unscrewing from the unit.  Last time this happened all the metal came out of machine so I returned it for this one last year. I have only used it twice since I bought new one and it happened again, and now of course I can't find the receipt",
            "author": "John",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"good price for one season\"",
            "rating": 2,
            "date": "05/16/2019",
            "recommended": false,
            "text": "It was a great little weed wacker until it wasnt. It made it through the first season with flying colors and here we are at the beginning of the second season and it crapped out the first week. The motor just quit. Not sure if its worth buying it again even for the price.",
            "author": "karyk",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Effective and easy-to-use trimmer\"",
            "rating": 5,
            "date": "06/30/2019",
            "recommended": true,
            "text": "This Black and Decker is lightweight, maneuverable and cuts a nice grass edge in our yard.  I am looking forward to using this tool to edge along our new fenced in back yard, which has effectively doubled the area needing edging.",
            "author": "Allan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Tremendous Trimmer\"",
            "rating": 5,
            "date": "10/03/2018",
            "recommended": true,
            "text": "From the box to trimming. Easy to use. Works just like you want a trimmer to work.It cuts grass in small areas as well as a lawn mower.A professional grass cutter was surprised that a trimmer cut my front lawn.",
            "author": "Jazzy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/03/2019",
            "recommended": true,
            "text": "I have only used the trimmer once since I bought it but look forward to many more years of use.  This is a wonderful little trimmer.  It was a snap to put together, it is not too heavy and does a good job.",
            "author": "Bob",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Easy trimmer\"",
            "rating": 5,
            "date": "11/13/2018",
            "recommended": true,
            "text": "Used it one time and so far it worked like a breeze. Good balance for the terrace, feeding the line was super quick. Even the cord other to secure it to the handle made sense. God price. Good value",
            "author": "Bill",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Great Buy\"",
            "rating": 4,
            "date": "05/20/2019",
            "recommended": true,
            "text": "I've only had it for a few weeks and used it a couple of times, but it works very well. It's powerful enough for my yard which has tall grass and weeds on a hill on which I cannot use a lawn mower.",
            "author": "m8kithapn",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"All 3 have broken right after 2 years\"",
            "rating": 3,
            "date": "06/21/2019",
            "recommended": false,
            "text": "I have purchased the black and decker trimmer, this one currently is my 3rd one. Luckily for me i have purchased the extended protection plan on them each time I have traded them out for the protection program. They come with a 2 year warranty and each time these have broken it is the the trimmer not releasing the spool or just releasing all of the spool, not catching the bottom of the spool. Literally this is my 3rd one (i was given the replacement model when they stopped making my previous one) that broke again today. But, i honestly do love the trimmer. I'm happy to just pay for the extended warranty and just replace it with another one because what do you expect for a cheap weed trimmer. But know that this is consistanly breaking at this point and its a good idea to purchase that extended warranty so when it doea break, you get a new one instead of having to buy one. The trimmer with the wheel does amazing job though and if i didnt have warranty i would still buy it again. Its super simple to use and it protects the fence and makes it so you dont have to spend extra money on an edger.",
            "author": "leslietum",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Couldn't be more pleased.\"",
            "rating": 5,
            "date": "05/07/2019",
            "recommended": true,
            "text": "Ordered the weed eater on a Monday afternoon and received it the next day with free shipping.  Super fast shipping.  Weed eater works great.  Second one I have owned.  Good value for the price.",
            "author": "David",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"awesome string trimmer\"",
            "rating": 5,
            "date": "05/28/2018",
            "recommended": null,
            "text": "I just bought this product today my 10-year-old set it up it took him 2 minutes then he used it it is wonderful it couldn't have done a better job",
            "author": "matthew",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 4,
                "no": 4
            }
        },
        {
            "title": "\"Great Trimmer\"",
            "rating": 5,
            "date": "06/23/2019",
            "recommended": true,
            "text": "With all this rain we've been having, this trimmer is living up to it's name.  Runs great with ease and no problems with the string either.  Handles nicely...highly recommend.",
            "author": "NanaP",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"electric weed eater\"",
            "rating": 5,
            "date": "01/03/2019",
            "recommended": true,
            "text": "Electric so needs extension cord, but the perfect option for residential with not so much space. Also, lightweight, and no need to worry about crank.",
            "author": "Eli",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Electric trimmer\"",
            "rating": 5,
            "date": "06/08/2019",
            "recommended": true,
            "text": "Handles great! Having a button to extend the string was a big plus.i would recommend to anyone that likes to do their own yard work.",
            "author": "Kat",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Auto string advance\"",
            "rating": 3,
            "date": "06/29/2019",
            "recommended": false,
            "text": "The string advance doesn't work that well and I have to shut it down and manually advance it which is not fun and aggravating.",
            "author": "Doug",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"It does cut well.\"",
            "rating": 1,
            "date": "07/17/2018",
            "recommended": false,
            "text": "Problem with left hand handle.  It will not stay fixed in one position.",
            "author": "Herman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 2,
                "no": 1
            }
        },
        {
            "images": [],
            "title": "\"Gone in 30 minutes!\"",
            "rating": 1,
            "date": "05/12/2019",
            "recommended": false,
            "text": "Cheap nylon cogs melted in less than 30 minutes. A total waste of $s!",
            "author": "NotSatisfied",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Weed Eater\"",
            "rating": 4,
            "date": "10/06/2018",
            "recommended": true,
            "text": "Works well.  Line easy to refill.  Last one lasted several years.",
            "author": "Ed",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/21/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "LMC",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Works - within its limitations\"",
            "rating": 4,
            "date": "10/22/2018",
            "recommended": true,
            "text": "this is the third (or fourth) B&D trimmer that I have bought. I bought this to replace a similar older model. As these age they stop taking a new spool of string and dispensing it properly. So, expect it to last for only a few spools.  I don't trim often enough to get a gas powered trimmer engine happy or a re-chargeable battery cycling. So long extension cords work just fine.",
            "author": "Dave",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "\"OK String Trimmer\"",
            "rating": 4,
            "date": "03/20/2019",
            "recommended": false,
            "text": "I have been buying the same Black & Decker string trimmer for 4 years now, quality and performance has been consistent except the easy feed feature on this one does not work as I would have expected, still the unit itself it's pretty strong and it does a good job.",
            "author": "Chele",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"Works Great for the price\"",
            "rating": 5,
            "date": "06/02/2019",
            "recommended": false,
            "text": "We bought this weedeater after losing a part in our old one. We went over to our stepdads house who's unable to cut his own yard. With one roll of string we were able to cut 300 sq feet of a dog pen that was overgrown with weeds taller than me. And these huge thick plants we're starting to grow and I was able to knock those down. It only took us 30 minutes and you can't beat the price.",
            "author": "Emily",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Black & Decker String Trimmer 6.5 Amp 14 in.\"",
            "rating": 5,
            "date": "10/12/2018",
            "recommended": true,
            "text": "Easy to reload, easy to handle, very light, easy to adjust height and angle. This item replaced another make which was cheaper but was not very friendly. You really get what you pay for.",
            "author": "Al",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"Disappointed\"",
            "rating": 2,
            "date": "07/03/2018",
            "recommended": false,
            "text": "If you try to plug it in, you may have to shave off some of the plug so it will fit in the round hole, as I did.  The end of the cord was too big to fit in the round hole.",
            "author": "Gmann",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"Good Product\"",
            "rating": 5,
            "date": "06/12/2018",
            "recommended": true,
            "text": "I previously have a weed string trimmer that was hard to control and ran too fast. Now with this product it is easy to use and gets the job done in a jiffy!!",
            "author": "Laury",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"Excellent trimmer\"",
            "rating": 4,
            "date": "08/18/2018",
            "recommended": true,
            "text": "Everything about this trimmer is precisely what I was hoping for, except the large guard. The power it has for an electric trimmer is surprising, coming from a gas trimmer, that is. It is blows my gas trimmer away in the edging capability, which is something that I was searching for when choosing to go to an electric trimmer when my gas trimmer died.",
            "author": "Hogan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good for the price\"",
            "rating": 4,
            "date": "05/02/2019",
            "recommended": true,
            "text": "I purchased this item for about $50. It's electric and easy to use. However, the weight it all in the head of the trimmer, which makes is seem much heavier than it is. It is also a single string trimmer, so it doesn't always cut as evenly as you might prefer. If you're looking for something to hack through a ton of weeds, this is what you get!",
            "author": "alyssalogan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Edges but not easy to use\"",
            "rating": 1,
            "date": "11/18/2018",
            "recommended": false,
            "text": "It doesn't work well? The string doesn't advance.  Going to return it.",
            "author": "Santastic",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 1
            }
        },
        {
            "title": "\"BLACK+DECKER 6.5-Amp 14-in Corded Electric String\"",
            "rating": 4,
            "date": "05/17/2019",
            "recommended": true,
            "text": "I am very pleased with this lightweight, adjustable trimmer. I was able to easily set the proper height and rotate the trim method. Powerful enough to quickly manage my lawn. The trimmer loads with the push of a button but my only con would be that it if it gets too short it falls into the loader and you have to open it to reload.",
            "author": "Karen",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great for the price\"",
            "rating": 4,
            "date": "07/06/2018",
            "recommended": true,
            "text": "I have used this twice now and have had no issues.  It does a decent job at edging and is good at getting areas the mower can't get. Have had no real problems with auto feed",
            "author": "William",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "\"Works well\"",
            "rating": 4,
            "date": "02/02/2019",
            "recommended": true,
            "text": "I bought this trimmer 3 weeks ago since my old Toro trimmer had finally worn out (20 years old).  This works great.  I've had no issues with the adjustable handler or the string feed.  We've had a very wet winter in Arizona so I've used it probably 6 times in the last 3 weeks with no issues.  Love the EasyFeed system.",
            "author": "pm56",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Handle and line feed\"",
            "rating": 1,
            "date": "06/08/2018",
            "recommended": false,
            "text": "As rated by others, handle does not lock in place. Had to insert a sheet metal screw in between the teeth to keep in place. Line feed continually spits out line using up a full spool in a very short time. This is the second same product purchased due to the first one doing the exact same thing for both defects.",
            "author": "not2happy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Ok machine\"",
            "rating": 3,
            "date": "10/25/2018",
            "recommended": false,
            "text": "Our old trimmer of 8 years finally died and this appeared to be the modern replacement.  The new one is ok, but I wish it had 2 lines versus 1.  It seems like I am always advancing the line.  I don't know why they could have implemented some sort of auto advance like my old trimmer had.",
            "author": "TampaGuy",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"works fine\"",
            "rating": 5,
            "date": "06/09/2018",
            "recommended": true,
            "text": "Purchased this product today and it was very easy to set up and use.  I am a female just learning to trim and it did a great job for first trimmer.  It is very light weight and easy to handle.  On previous trimmers I would always eat the line, but the feature on this works great for me.",
            "author": "happy customer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"EASYFEED String Trimmer\"",
            "rating": 4,
            "date": "08/04/2018",
            "recommended": true,
            "text": "Works as advertised, the string feeds consistently and it trims my yard just the way I want it to.",
            "author": "jvk",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "\"Slightly better quality than its $30 brother\"",
            "rating": 3,
            "date": "06/02/2019",
            "recommended": false,
            "text": "But not really. Apparently $80 is still not enough for a decent weed wacker and I am only using it for edging my lawn and chopping little bits of grass. The string constantly needs to be manually fed through the feeder hole and it does not cut well. Really just a waste of money.",
            "author": "Lisamama",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Works super\"",
            "rating": 5,
            "date": "08/04/2018",
            "recommended": true,
            "text": "My trimmer is the best I have had in years Cuts well and is easy to reload.",
            "author": "Robert",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "\"Awesome\"",
            "rating": 5,
            "date": "07/04/2018",
            "recommended": true,
            "text": "Works like a dream. Very easy to use. Push button line feed is Awesome.",
            "author": "Zima",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "\"So easy to use and works great.\"",
            "rating": 5,
            "date": "08/05/2018",
            "recommended": true,
            "text": "Cleaned 3 yards with it in no time. Helped the neighbors withit",
            "author": "Edward",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 2
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/05/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Buck",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "07/05/2019",
            "recommended": false,
            "text": "There is no review to accompany this rating.",
            "author": "BAM",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Works really well!\"",
            "rating": 5,
            "date": "06/08/2019",
            "recommended": true,
            "text": "I bought this higher amp trimmer for my husband and he really likes it. He says it is easier to operate and works much nicer than his old one.  Black and Decker has a great reputation for making fine tools and this is no exception!",
            "author": "msmittzie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Trusted Brand\"",
            "rating": 5,
            "date": "09/05/2018",
            "recommended": true,
            "text": "Read a lot of bad reviews, but they were all wrong, as long as you use the weedeater & trimmer properly it works great & will last. Plus Black & Decker comes with a 2yr warranty so if something does break it will be replaced.",
            "author": "Burkel",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Good trimmer\"",
            "rating": 4,
            "date": "06/08/2019",
            "recommended": true,
            "text": "I find this trimmer has plenty of power and is easy to use. The string feeds easily and it is fairly light-weight.  The only drawback is fighting with the power cord if you go very far. I am getting good use out of it.",
            "author": "SUSAN",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Trimmer\"",
            "rating": 5,
            "date": "09/06/2018",
            "recommended": true,
            "text": "Works perfectly for inside wife's garden fence.  Easier to assemble from box than I expected.  Liked the price compared to HD and got my 10% off for 20 years USAF active duty service.  A nice perk.  Thank you.  Jim",
            "author": "Jim",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very powerful trimmer\"",
            "rating": 5,
            "date": "06/07/2019",
            "recommended": true,
            "text": "This trimmer is a great buy.  The added wheel for trimming makes it much easier to use.  The push button feeder is a great option.  Very powerful tool.  I recommend this trimmer to anyone looking for a great deal.",
            "author": "tkn",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great little trimmer\"",
            "rating": 4,
            "date": "09/02/2018",
            "recommended": true,
            "text": "I have a smallish yard and do not need a huge trimmer to work it. This little guy is perfect and easy to use. I gave it 4 stars because the spin and trim feature is not that great. Don't really use it anyway.",
            "author": "Ryan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/19/2019",
            "recommended": true,
            "text": "Selected because tired of unpredictable 2 cycle engines. Plug in and trim. Corded trimmer does not loose torque like battery as voltage and amperage decrease. Performers as expected. Good machine for money.",
            "author": "Vic",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 2
            }
        },
        {
            "title": "\"Surprised at what good product it is\"",
            "rating": 5,
            "date": "09/20/2018",
            "recommended": true,
            "text": "Fantastic product. Best weedeater I've ever owned. Also great at edging. Haven't owned it for a long period of time so I cannot comment on the longevity, but right now I'm extremely pleased with it.",
            "author": "Christian",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Powerful\"",
            "rating": 5,
            "date": "08/26/2018",
            "recommended": true,
            "text": "I had the battery operated one but the batteries quit charging so I decided on getting the electric one. This has so much more power than my last one. Love using it-it's such a breeze.",
            "author": "Denice",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"its doen't last\"",
            "rating": 3,
            "date": "06/04/2019",
            "recommended": false,
            "text": "bought it a year and haft ago . And now it's not working anymore . Would not recommed this one . I don't know because of the electric weed eater doesn't last or just this brand .",
            "author": "tony",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"A little work horse\"",
            "rating": 4,
            "date": "10/01/2018",
            "recommended": true,
            "text": "This trimmer works great for my home and several homes my teenage son takes care of. It only last a couple of years...maybe cause we overuse it...but we keep buying a new one.",
            "author": "Bill",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"don't buy this trimmer\"",
            "rating": 1,
            "date": "07/03/2019",
            "recommended": false,
            "text": "ran through the spool in the middle of my 3rd cut, had the same trimmer prior 4years used 2 spools in a season!",
            "author": "bikertrash",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Fell abart.\"",
            "rating": 1,
            "date": "06/16/2019",
            "recommended": false,
            "text": "First the handle kept popping out of the desired comfortable position as it us adjustable. Then the 3rd time I used it the mechanism that dispensed the cord broke off.....",
            "author": "Terry",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Just okay\"",
            "rating": 3,
            "date": "05/23/2018",
            "recommended": null,
            "text": "Very powerful trimmer. BUT, the auxiliary handle does not stay where you want it. I've read this same issue reported by others. Makes using the trimmer almost impossible.",
            "author": "Bear",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Features\"",
            "rating": 1,
            "date": "10/01/2018",
            "recommended": false,
            "text": "I bought  3 week's ago.linefeed hangs up. And runs out to fast. And line is expensive using your brand. Handle defective as I see now in reviews it's a problem.",
            "author": "Bayside63",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Light, easy to use\"",
            "rating": 4,
            "date": "08/14/2018",
            "recommended": true,
            "text": "Very good price/performance ratio. Does well trimming against fences and walls. Reasonable triming of heavy gass and weed growth, as indicated by BD add.",
            "author": "PSquare",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great trimmer at a great price!\"",
            "rating": 5,
            "date": "06/02/2019",
            "recommended": null,
            "text": "I'm a 65 year old woman and find this electric trimmer to be perfect for keeping my garden and lawn trimmed :-)  It's just what I was looking for!",
            "author": "me",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great So Far\"",
            "rating": 5,
            "date": "03/07/2019",
            "recommended": true,
            "text": "Bought and used today. No problem with assembly or use as stated by others. Cut a 3 hour job down to about 30 minutes. Exactly what I was wanting.",
            "author": "Bill57",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"First use\"",
            "rating": 4,
            "date": "04/04/2019",
            "recommended": true,
            "text": "Easy assembly.  I liked the adjestment for wand length feature.Sometimes the line retracts to the spool and I have to open it to rethread line.",
            "author": "Russ",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great purchase\"",
            "rating": 4,
            "date": "08/21/2018",
            "recommended": true,
            "text": "I bought this to replace my broken trimmer. I was skeptical because I'm usually not a fan of B&D products...but this one has served me well.",
            "author": "Tamika",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Excellent\"",
            "rating": 5,
            "date": "06/05/2019",
            "recommended": null,
            "text": "I bought this because I can't handle the weight of a gas trimmer. My husband tried it & said it's as good as a gas trimmer. Excellent value.",
            "author": "Amber",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Ate an entire spool of string in 5 minutes\"",
            "rating": 1,
            "date": "06/21/2019",
            "recommended": false,
            "text": "The 2nd time I used the trimmer the auto string feed broke and it used an entire spool in minutes. Save your money and buy a better model",
            "author": "Jeff",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Black + Decker 6.5 Amp\"",
            "rating": 5,
            "date": "08/15/2018",
            "recommended": true,
            "text": "Product works great around my house.  I wouldn't recommend it for larger jobs or thick brush, but it's perfect for grass and edging.",
            "author": "TLG",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"old model please!\"",
            "rating": 2,
            "date": "05/19/2019",
            "recommended": false,
            "text": "high pitched whineautofeed disappeared and replaced with button to let out line.  problem is you cannot see line if using machine",
            "author": "michele",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"BLACK+DECKER 6.5-Amp 14-in Corded Electric String\"",
            "rating": 5,
            "date": "06/02/2019",
            "recommended": true,
            "text": "Cuts well. I love the fact that you can advance the trimmer string from the handle eliminating the need to bump it on the ground.",
            "author": "James",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/04/2018",
            "recommended": true,
            "text": "This is very light and easy to use. Changing out the string is a breeze and you don't have to worry about it getting tangled up.",
            "author": "Mort",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Returning!!!\"",
            "rating": 2,
            "date": "05/25/2018",
            "recommended": false,
            "text": "Bought it last week and returning it! \nThe handle does not lock in place and moves when it wants to! Really frustrating!",
            "author": "Mike317",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Workd great for the price point!\"",
            "rating": 4,
            "date": "07/15/2018",
            "recommended": true,
            "text": "Quality and durable product for the price point. Simple assembly, and quick to use without the worry of gas or oil.",
            "author": "Amberley317",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/09/2018",
            "recommended": true,
            "text": "I have a small area to maintain and this trimmer is perfect.  It is lightweight and the feeder line works well.",
            "author": "Joe",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Well built\"",
            "rating": 5,
            "date": "05/01/2019",
            "recommended": true,
            "text": "With good design and well built, it is a joy to use. I suspect that I will be using it for a very long time.",
            "author": "WGJ",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Replacement\"",
            "rating": 5,
            "date": "04/08/2019",
            "recommended": true,
            "text": "Replacement for same model, that I just used and used till it wore out. Liked it do much I bought another.",
            "author": "PrincessButtercup",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Trimmer\"",
            "rating": 5,
            "date": "09/03/2018",
            "recommended": true,
            "text": "This trimmer is very easy to use.  It is lightweight and does a great job.  Great for a quip clean up.",
            "author": "janna",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Ez\"",
            "rating": 5,
            "date": "05/05/2019",
            "recommended": true,
            "text": "Bought because of price and size. For the $$ its a great bargain. Ez to use light and expandable.",
            "author": "Ed",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"B&D string trimmer is very useful\"",
            "rating": 5,
            "date": "04/05/2019",
            "recommended": true,
            "text": "The wheel that guides the trimmer is a definite asset and the weight of trimmer is just right.",
            "author": "Santee",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"B&D string trimmer\"",
            "rating": 5,
            "date": "08/30/2018",
            "recommended": true,
            "text": "This is a good value at a good price. Does all the household trimming quickly and efficiently.",
            "author": "Jim",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"easy to use\"",
            "rating": 5,
            "date": "07/04/2018",
            "recommended": true,
            "text": "I am some what handicapped and ease of use is so easy. cuts great and compact for easy storage",
            "author": "boss",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Terrible\"",
            "rating": 2,
            "date": "06/07/2019",
            "recommended": false,
            "text": "The trimmer is not all the great the edger is pretty much worthless.  I am returning",
            "author": "Xena",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Black and Decker Trimmer\"",
            "rating": 5,
            "date": "09/17/2018",
            "recommended": true,
            "text": "This is great general yard trimmer and has good power for a standard yard use.",
            "author": "Dutch",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Happy hubby\"",
            "rating": 5,
            "date": "05/17/2019",
            "recommended": true,
            "text": "This trimmer is easy to use, very durable and makes tidying up the yard easy!",
            "author": "Cmh",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good trimmer\"",
            "rating": 5,
            "date": "06/11/2019",
            "recommended": null,
            "text": "Really happy with the way this trims. Great price for a great product",
            "author": "Jake",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"The black handle kept folding up for no reason\"",
            "rating": 3,
            "date": "07/15/2018",
            "recommended": false,
            "text": "the unit would drop and then scalp the grass.   I returned the unit",
            "author": "Chuck",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Quality\"",
            "rating": 5,
            "date": "03/30/2019",
            "recommended": true,
            "text": "This does an excellent job of both edging and trimming our lawn",
            "author": "Trimmer",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "04/14/2019",
            "recommended": true,
            "text": "Works well for a small yard that doesn't need a very long cord.",
            "author": "William",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Easy to assemble\"",
            "rating": 5,
            "date": "05/14/2019",
            "recommended": true,
            "text": "I like the push button feature.  The edger capability is nice.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"works Great\"",
            "rating": 5,
            "date": "08/20/2018",
            "recommended": true,
            "text": "I say becuse it fast and effective and can get the job done",
            "author": "rose",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Good trimmer\"",
            "rating": 4,
            "date": "09/01/2018",
            "recommended": true,
            "text": "It's a bit lightweight but really does the job. Good price",
            "author": "Dee",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Black and decker trimmer\"",
            "rating": 5,
            "date": "04/17/2019",
            "recommended": null,
            "text": "Works good, took a while to get used to string advancement",
            "author": "Boss",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 1
            }
        },
        {
            "title": "\"Does the job\"",
            "rating": 4,
            "date": "06/01/2019",
            "recommended": true,
            "text": "Does a goodJob weed whacking and edging. Would buy again",
            "author": "Jmz",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Unfortunate Purchase - Handle is Defective\"",
            "rating": 2,
            "date": "06/06/2018",
            "recommended": false,
            "text": "I've purchased three of these. Each one has had a defective adjustable handle. It will lock in place and I cannot force it out of the position no matter how much force I apply. Seconds after I actually start using it, the handle will start to shift upward until it is in the very last position closest to the user. Usually within a minute of use, I am trying to re-adjust it to the fully extended position. It is almost as if the vibration of the trimmer is causing the button to be pushed in somehow and allowing the handle to move. After purchasing the second one, I decided it must be user error or I am putting it together wrong (even though there is really only one way to slide the handle on to install it). So, I had someone at the retail store I purchased it at, put it together for me. Same thing happened after I got it home and tested it for use. Now I will have to return the third one, too. I love everything else about it, otherwise. Easy to switch to the edger. The push button line feed is awesome. Lightweight. But impossible to use if the handle will not stay in place. Just too awkward to use and harder to control when it is not extended away from the user. Disappointing. This could be a great product if they fix that one issue!",
            "author": "MicheleG",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "05/02/2019",
            "recommended": true,
            "text": "handle slips height setting",
            "author": "sb",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "06/27/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "08/03/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Js",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/02/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jerry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/02/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "jed",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 3,
            "date": "11/15/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "chris",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/12/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Soso",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/04/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "John",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "10/02/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Ken",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/11/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Nana",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/05/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "VICTORIA",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/27/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "trouble",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "08/24/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "bill",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "08/24/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "bill",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/19/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Bill",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "02/24/2019",
            "recommended": null,
            "text": "There is no review to accompany this rating.",
            "author": "Will",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/17/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Nwinn",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "09/08/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Smokey",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/11/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Molly",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/06/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "don",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/09/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Tom",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "08/31/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Linda",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "08/13/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "wfm",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/18/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Tonya",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/16/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Brian",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "03/30/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Dub",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/21/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Steve",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/14/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "gogo",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/09/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Carolyn",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 1,
            "date": "05/08/2018",
            "recommended": false,
            "text": "There is no review to accompany this rating.",
            "author": "rainman",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 5,
            "date": "09/04/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Phyllis",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/18/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Teresa",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 4,
            "date": "05/20/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jan",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/08/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Bear",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 3,
            "date": "06/17/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "D",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Cut it Off!!!\"",
            "rating": 5,
            "date": "06/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "RISEY",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        }
    ],
    "reviewStats": {
        "reviewCount": 163,
        "percentRecommended": "66",
        "averageStars": "3.9",
        "starCounts": {
            "five": 81,
            "four": 34,
            "three": 14,
            "two": 11,
            "one": 23
        }
    },
    "questions": [
        {
            "question": "\"what does the 2-yr limited warranty?\"",
            "author": "Anonymous",
            "date": "05/24/2018",
            "answers": [
                {
                    "author": "MARGE",
                    "date": "04/25/2019",
                    "text": "nothing at Lowes...have to return it to Black & Decker (40 miles away) Do not buy this.",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "01/27/2019",
                    "text": "Yes, this product has a 2-year limited warranty. For detailed information, you may contact the Lowe's Service Center today. Text 84109 or call 1-888-77-LOWES. Messaging and data rates may apply.",
                    "helpful": {
                        "yes": 0,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"i need a bump cover for a gh900 black and decker lawn edger\"",
            "author": "Anonymous",
            "date": "05/17/2018",
            "answers": [
                {
                    "author": "Buck",
                    "date": "09/03/2018",
                    "text": "Lowes has these covers in store this model has a automatic line feed if you bump feed this trimmer it will be destroyed!",
                    "helpful": {
                        "yes": 0,
                        "no": 1
                    }
                },
                {
                    "author": "Val",
                    "date": "05/28/2018",
                    "text": "Get the Black and Decker Replacement Spool Cap for String Trimmers: RC-100P1. It fits the GH900 model",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Is it difficult to assemble?\"",
            "author": "Anonymous",
            "date": "06/11/2019",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "06/21/2019",
                    "text": "No, requires minimum assembly of guard and handle.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"The little plastic knobby thing inside where the spool goes fell off. Now the string comes out uncontrollably. Where can I find a replacement?\"",
            "author": "Anonymous",
            "date": "05/11/2019",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "05/14/2019",
                    "text": "Replacement parts can be found via the following link: https://servicenet.blackanddecker.com/Products/Detail?productNumber=BESTE620",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"How is the string spool changed?\"",
            "author": "Anonymous",
            "date": "05/09/2019",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "05/10/2019",
                    "text": "Unplug trimmer. Depress the tabs on the cap and remove the spool cap from the spool housing. For best results, replace spool with BLACK+DECKER model no. AF-100. Grasp empty spool with one hand and spool housing with other hand and pull spool out. Unfasten the end of the cutting line and guide the line into the eyelet. Take the new spool and push it onto the spindle in the housing. Rotate the spool slightly until it is seated. The line should protrude approximately 5-3/8\" (136 mm) from the housing. Align the tabs on the spool cap with the slots in the housing. Push the cap onto the housing until it snaps securely into place.",
                    "helpful": {
                        "yes": 6,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Can the head be replaced in this such as with a grass gator or Shakespeare brush/blade head?\"",
            "author": "Anonymous",
            "date": "04/25/2019",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "04/26/2019",
                    "text": "No, USE ONLY .065\" (1.65 mm) DIAMETER ROUND NYLON LINE. Do not use serrated or heavier gauge line, as they will overload the motor and cause overheating. BLACK+DECKER replacement spool Model No. AF-100 is recommended.",
                    "helpful": {
                        "yes": 2,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"does this require a 50 or 100 foot extenion cord\"",
            "author": "Anonymous",
            "date": "04/20/2019",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "04/22/2019",
                    "text": "For best results we recommend using an outdoor heavy duty extension cord no more the 50' in length.",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"can you use an .080 line with this trimmer\"",
            "author": "rod",
            "date": "04/05/2019",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "04/08/2019",
                    "text": "No, we recommend only using 0.065 (1.65 mm) diameter round line.",
                    "helpful": {
                        "yes": 8,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"how may I obtain the part inside this trimer's head that regulates the line feed?\"",
            "author": "Anonymous",
            "date": "09/03/2018",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "10/19/2018",
                    "text": "Please contact BLACK+DECKER at 1-800-544-6986 for further assistance.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Where do I find the model number on Black and Decker electric Easyfeed String trimmers?\"",
            "author": "Anonymous",
            "date": "08/26/2018",
            "answers": [
                {
                    "badgeName": "3dc00188-232e-5655-92ef-8279e9c09718",
                    "author": "SBD_Product Expert",
                    "date": "10/19/2018",
                    "text": "The model number is on the product label, which is located underneath the handle. The model number for this product is BESTE620.",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                }
            ]
        }
    ]
}