{
    "descriptions": {
        "list": [
            "Powerful 10 Amp motor to tackle the toughest weeds in the yard",
            "18-in cutting path to help you complete the job quicker",
            "0.080 dual line bump-feed head makes advancing the cutting line simple and easy",
            "Attachment capable design accepts attachments from multiple brands",
            "Cushion and over-mold grip and handle for operator comfort with auxiliary handle for more control when trimming"
        ]
    },
    "specs": [
        {
            "title": "Adjustable Height",
            "spec": 0
        },
        {
            "title": "Amps (Amps)",
            "spec": "10"
        },
        {
            "title": "Best Use",
            "spec": "Up to 1/2 acre; up to 100 feet from electrical outlet"
        },
        {
            "title": "Commercial/Residential",
            "spec": "Residential"
        },
        {
            "title": "Cutting Swath (Inches)",
            "spec": "18"
        },
        {
            "title": "Edger Capable",
            "spec": 0
        },
        {
            "title": "Line Feed",
            "spec": "Bump"
        },
        {
            "title": "Package Contents",
            "spec": "Power Head, String Trimmer Attachment, Auxiliary Handle, Guard"
        },
        {
            "title": "Recommended Line Diameter (Inches)",
            "spec": "0.08"
        },
        {
            "title": "Series Name",
            "spec": "N/A"
        },
        {
            "title": "Shaft Length (Inches)",
            "spec": "54"
        },
        {
            "title": "Shaft Type",
            "spec": "Straight"
        },
        {
            "title": "Single or Dual Line Feed",
            "spec": "Dual"
        },
        {
            "title": "Warranty",
            "spec": "4-year limited"
        },
        {
            "title": "Weight (lbs.)",
            "spec": "11"
        },
        {
            "title": "UNSPSC",
            "spec": "27112700"
        },
        {
            "title": "ETL Safety Listing",
            "spec": 0
        },
        {
            "title": "UL Safety Listing",
            "spec": 0
        },
        {
            "title": "CA Residents: Prop 65 Warning(s)",
            "spec": "Yes"
        },
        {
            "title": "CSA Safety Listing",
            "spec": 1
        },
        {
            "title": "",
            "spec": "This Product"
        },
        {
            "title": "",
            "spec": ""
        },
        {
            "title": "",
            "spec": ""
        },
        {
            "title": "",
            "spec": ""
        },
        {
            "title": "See product page 8 Amp 12-Inch Electric Snow Shovel",
            "spec": "See product page 9A 14-Inch Corded Chainsaw"
        },
        {
            "title": "See product page 4 Amp 22-Inch Corded Rotating Hedge Trimmer",
            "spec": "See product page 5.5A 15-Inch Corded String Trimmer"
        },
        {
            "title": "10A 18-Inch Corded String Trimmer, Gas Attachment Capable",
            "spec": "8 Amp 12-Inch Electric Snow Shovel"
        },
        {
            "title": "9A 14-Inch Corded Chainsaw",
            "spec": "4 Amp 22-Inch Corded Rotating Hedge Trimmer"
        },
        {
            "title": "",
            "spec": "Buy Now"
        },
        {
            "title": "",
            "spec": "Buy Now"
        },
        {
            "title": "Model Number",
            "spec": "21142"
        },
        {
            "title": "GBSS0800",
            "spec": "20222"
        },
        {
            "title": "22122",
            "spec": "21272"
        },
        {
            "title": "",
            "spec": "This Product"
        },
        {
            "title": "",
            "spec": ""
        },
        {
            "title": "",
            "spec": ""
        },
        {
            "title": "",
            "spec": ""
        },
        {
            "title": "See product page 8 Amp 12-Inch Electric Snow Shovel",
            "spec": "See product page 9A 14-Inch Corded Chainsaw"
        },
        {
            "title": "See product page 4 Amp 22-Inch Corded Rotating Hedge Trimmer",
            "spec": "See product page 5.5A 15-Inch Corded String Trimmer"
        },
        {
            "title": "10A 18-Inch Corded String Trimmer, Gas Attachment Capable",
            "spec": "8 Amp 12-Inch Electric Snow Shovel"
        },
        {
            "title": "9A 14-Inch Corded Chainsaw",
            "spec": "4 Amp 22-Inch Corded Rotating Hedge Trimmer"
        },
        {
            "title": "",
            "spec": "Buy Now"
        },
        {
            "title": "",
            "spec": "Buy Now"
        },
        {
            "title": "Model Number",
            "spec": "21142"
        },
        {
            "title": "GBSS0800",
            "spec": "20222"
        },
        {
            "title": "22122",
            "spec": "21272"
        }
    ],
    "reviews": [
        {
            "title": "\"I recommend it,and here is why.\"",
            "rating": 5,
            "date": "05/22/2019",
            "recommended": true,
            "text": "The machine is heavier than any I had before but quieter than any also. Motor is in the handle so will not get vents clogged which is what killed the others I have had.Never had a 2 line one before so i'm sure that will be fun first time I have to replace line. And speaking of that the head you take off to load string is reverse threaded. Think that might have been the problem I saw someone had in revues.When you assemble it (which was easy) put handle lower than you normally would to compensate for weight.I was impressed with 4 year limited warranty. I truly believe this will last longer than any I have owned before.",
            "author": "Hammer",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 17,
                "no": 3
            }
        },
        {
            "title": "\"powerful\"",
            "rating": 4,
            "date": "10/12/2017",
            "recommended": true,
            "text": "This trimmer is very strong. It is comparable to a 25cc at full throttle. So power is not the issue. Just dealing with a cord and that fact that the switch is just on/off, no variable speed. It does the job easily. I like \"no gas\" \"no smell\" \"no battery\". my extension cords are wound up on a garden hose reel. It is easy to work with. Variable speed would make it perfect.but very happy with it.",
            "author": "mike",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 69,
                "no": 0
            }
        },
        {
            "title": "\"Love it!\"",
            "rating": 5,
            "date": "10/10/2018",
            "recommended": true,
            "text": "I bought this trimmer to replace my gas powered one because of constant struggles to get the gas one started. I can't tell you how happy I was to be able to just start it right up and the power it has is amazing. I was able to get all the trimming I wanted to do finished in a few hours. Even reloading the string on it was a breeze. I can't wait to see how it works with the other attachments I have from my old trimmer.",
            "author": "Jules",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 30,
                "no": 0
            }
        },
        {
            "title": "\"Greenworks Weed Trimmer\"",
            "rating": 4,
            "date": "07/20/2018",
            "recommended": true,
            "text": "This is more powerful than I expected from a corded trimmer, but it will throw debris into your face so make sure to wear safety equipment.",
            "author": "Steve",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 37,
                "no": 0
            }
        },
        {
            "title": "\"Does really well.\"",
            "rating": 5,
            "date": "08/03/2017",
            "recommended": true,
            "text": "Definitely competes with gas trimmers. Even though Walmart sells these as well, neither store sells these on site. They have to be ordered online. Far superior power over battery operated. Just need a long cord. Handles a quarter acre field nicely.",
            "author": "trlinde",
            "verifiedPurchaser": true,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 135,
                "no": 15
            }
        },
        {
            "images": [],
            "title": "\"String Head screwed on too tight\"",
            "rating": 1,
            "date": "01/18/2019",
            "recommended": false,
            "text": "I bought this equip brand new and tried to used it yesterday. The original string runs out and time to replace w/new. PROBLEM: Following the instruction, I was UNABLE to remove/unscrew the string head. I called the tel no listed on the manual and she told me to spray with wd40. I waited for a few minutes and tried again w/negative. I brought it back to Lowes for some help. The Lowes Reps tried a few times, can't remove it either.  I'll buy a Ryobi instead.",
            "author": "Dom",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 15,
                "no": 3
            }
        },
        {
            "title": "\"As expected\"",
            "rating": 5,
            "date": "09/18/2018",
            "recommended": true,
            "text": "Read many reviews. This had plenty of power, which was as expected from a 10amp. Very happy with product.",
            "author": "Walsh",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 21,
                "no": 2
            }
        },
        {
            "title": "\"Great power\"",
            "rating": 5,
            "date": "04/12/2019",
            "recommended": true,
            "text": "This works great and has a lot of power.  A little on the heavy side if you have a large area that might take you a while, but if you adjust the strap just right it takes a lot of the strain off your arms. But if it's a quick job or you're just doing some edging the weight is negligible. Seems to be pretty good quality, well made.",
            "author": "Lars",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 5,
                "no": 0
            }
        },
        {
            "title": "\"Most powerful electric trimmer I've found\"",
            "rating": 5,
            "date": "08/10/2018",
            "recommended": null,
            "text": "I was sick of messing with gummed up carbs from my trimmers sitting for long periods and my previous attempt with a corded trimmer left a lot to be desired, but after noting this was about 2x as powerful, I took a chance.  Fantastic.  Lighter than my gas powered trimmer, about as powerful, and takes all the old attachments.  I was a little worried about using the edger attachment, but it worked just fine.  After about 45 min of continuous use, there were no signs of overheating or anything which was my big concern.  Can't recommend this enough - just take time to plan your route and the cord is a non-issue.",
            "author": "A2ZNN",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"First impression is positive\"",
            "rating": 5,
            "date": "06/26/2018",
            "recommended": true,
            "text": "Plenty of power. Line is a little wimpy. May have to see what I can do to improve the diameter of the line. I have read on-line that string replacement can be challenging. I have not had it long enough to have to replenish the string. My main complaint is that the trimmer head rotates counterclockwise- so debris is thrown against my feet since I am right handed. If I could figure out how to make it rotate the opposite direction I would. That would be a big improvement. Other than that I am quite happy with it the 3 times I have used it so far. Check back with me at the end of the mowing season.",
            "author": "grayrock",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Better than Gas and Battery\"",
            "rating": 5,
            "date": "05/04/2019",
            "recommended": true,
            "text": "I have thrown some tough brush at this and it continues to prove itself. Be sure to get take advantage of the attachment capable feature. I have the blade attachment and it cuts through everything and I never run out of gas or battery. It just keeps cutting.",
            "author": "Andy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 3,
                "no": 0
            }
        },
        {
            "title": "\"Extremely powerful\"",
            "rating": 3,
            "date": "06/22/2017",
            "recommended": false,
            "text": "The strongest corded electric string trimmer made, maybe the only one as powerful as strong gasoline-powered products.  \n\nThe user manual describes a different string spool assembly cover and says the spool can be accessed by unscrewing a plastic cap at the end.  Actually it's held together by a pair of snaps on the sides that have to be squeezed together to release the cover.   A 6\" long metal rod is included but not documented.  It's for holding the driveshaft so it doesn't turn when removing the entire string spool assembly but is not needed for just changing the string.",
            "author": "NickNameless",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"What a serious trimmer!!\"",
            "rating": 5,
            "date": "05/13/2019",
            "recommended": true,
            "text": "Who knew an electric trimmer could be this powerful!  I needed a trimmer that's lighter weight than a gas trimmer so opted for an electric.  I did have my concerns about its efficiency.  This trimmer tossed my concerns immediately.  It is very powerful and does a terrific job on high grass and weeds!",
            "author": "Highgrass",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Excellent trimmer\"",
            "rating": 5,
            "date": "06/24/2019",
            "recommended": true,
            "text": "I love this trimmer.  Instructions could be a little clearer (at least for me), but once I got it together it worked like a dream.  The balance is amazing.  I tried my old Black & Decker after this and thought my arm would come off.  Gave the B&D away and kept this one.  Oh, and it does a great job!  Also, it's a lot safer - less likely to turn on by accident.  I bought this online and picked it up at the store.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"greenworks 10 amp weedeater\"",
            "rating": 5,
            "date": "05/12/2019",
            "recommended": true,
            "text": "nice, very powerful for the price, have bought other greenworks products and they are all very good",
            "author": "charlie",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 2,
                "no": 0
            }
        },
        {
            "title": "\"Not bad.  Not bad at all.\"",
            "rating": 5,
            "date": "05/22/2019",
            "recommended": true,
            "text": "I have a suburban house with an average to large yard.  Did I need a gas powered trimmer that I needed to worry about draining the tank and starting problems in a couple years? Or did I need a battery charged trimmer that I had to get the battery or batteries charged up in the appropriate time to have  enough charge?  OR how bad is it to just drag a cord around?  It will always have power, I never have to worry about maintenance, I can just pick it up and go, and not even think about it for years and years.  Small price to pay to trim my yard every two weeks if that.  And with that said, I like the power.  Great power in fact.  Looks like a real trimmer as well and not a cheap toy.  About the only thing I could complain a little about would be the head.  It's too small to use very thick string, but thats ok depending on how much and how big your job is.  I imagine you could replace the head if need be with another, but for a regular yard it's perfect.",
            "author": "Mike",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"This thing's a beast!\"",
            "rating": 5,
            "date": "05/04/2019",
            "recommended": true,
            "text": "I cleared heavy brush mixed with woody stems I thought I'd need to go back and cut separately with absolutely no problem. Never even slowed down. Cuts as well as a bladed weed cutter.",
            "author": "Cat",
            "verifiedPurchaser": false,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"Great for close-at-hand weeding\"",
            "rating": 5,
            "date": "06/03/2019",
            "recommended": true,
            "text": "This trimmer is amazing! It has more power than some gas powered ones I've owned. No tugging at ropes or draining gas :-)",
            "author": "Terry",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "\"More powerful then I expected.\"",
            "rating": 5,
            "date": "05/30/2019",
            "recommended": true,
            "text": "Plenty of power.  String lasted long. I'll be testing the edger attachment next.",
            "author": "Bill",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 1,
                "no": 0
            }
        },
        {
            "title": "",
            "rating": 3,
            "date": "04/28/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Peter",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "04/22/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Jeff",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Lots of power, low vibration\"",
            "rating": 5,
            "date": "05/14/2018",
            "recommended": true,
            "text": "I have three gasoline powered string trimmers that I cannot use anymore due to the damage to my hands caused by the vibration of the internal combusion engines.  The usual corded string trimmer you find at the box stores is just too weak to do any serious work.  This unit does the job.   It has plenty of power, is easy to restring, is well balanced (no heavy motor hanging on the end), and vibration is very low.  I use a 100' 12 gauge extension cord with a 25' 16 gauge \"pigtail\" ( lighter and easier to handle), all wound on a thrift store hose reel with wheels.  No more tingly hands!   That being said, the machine is far from silent and it literally screams at you to the point where you may consider using some hearing protection.  The cutting spool also rotates counterclockwise which means that your primary cutting direction should be from right to left to avoid stuff being thrown back at you.",
            "author": "Rsee",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Power and Strength!\"",
            "rating": 5,
            "date": "04/11/2018",
            "recommended": true,
            "text": "We have some pretty tough vegetation here in south Texas, and .065 string just doesn't do the job - would go through over half a spool in one cutting! So glad to have the thicker string offered in a corded electric trimmer. I've never had a bump feed trimmer before, so I need to get more familiar with that function, but this tremor is powerful and durable...perfect for tougher stuff!",
            "author": "Yard Amateur",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"No more pull cords to drive me insane\"",
            "rating": 4,
            "date": "08/11/2018",
            "recommended": true,
            "text": "I purchased Greenworks 18-Inch 10 Amp Corded String Trimmer (Attachment Capable) 21142 just over a couple of months ago and congratulate myself every time I use it.The only drawback is that I also purchased the compatible replacement spool (29622) that doesn't fit (or even look like it fits).",
            "author": "ACMIL",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Thrilled with this trimmer\"",
            "rating": 5,
            "date": "06/13/2018",
            "recommended": true,
            "text": "I used my trimmer for the first time yesterday and was blown away by its quality.  It is extremely well built and very balanced -- easy to hold.  The power is terrific: loads of torque.\n\nIt's pleasant to see this level of quality at this price point.",
            "author": "mrcqm",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great trimmer from a great company\"",
            "rating": 5,
            "date": "07/18/2018",
            "recommended": true,
            "text": "best string trimmer i have ever used.the first time i turned it on i krow i had all the power i would ever need.i have tall grass,but the best was the baby oak trees about 6 ins. tall.it went throught them like butter.",
            "author": "johnnythunder",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Finally, a strong electric trimmer!\"",
            "rating": 4,
            "date": "07/30/2017",
            "recommended": true,
            "text": "An electric that handles and performs like a gas trimmer, but without the noise and fumes. Holds heavy weight line, capable of going after overgrown grass and weeds without wimping out.",
            "author": "John Mc",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Great lawn tool\"",
            "rating": 5,
            "date": "08/09/2018",
            "recommended": true,
            "text": "I have had my trimmer over a year and find it is easy using convenient adjustment I can quickly use it for vertical edging on sidewalks and then horizontal near the foundation.",
            "author": "thgiefpw",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerful\"",
            "rating": 4,
            "date": "08/11/2018",
            "recommended": true,
            "text": "It took some time to learn how to handle this trimmer. You have to be careful bc of the power. The downside is it being corded, but that's why it is so powerful.",
            "author": "TerS",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"The Right Tool\"",
            "rating": 5,
            "date": "04/29/2018",
            "recommended": true,
            "text": "As someone that use my ears for work, the 10 amp 18 inch corded string trimmer is quiet compared to a gas trimmer and for that I'm thankful.",
            "author": "Big D",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Work great\"",
            "rating": 5,
            "date": "06/09/2019",
            "recommended": true,
            "text": "Works great on all grass types. Had really tall grass and weeds and went right trough it. String is also easy to replace.",
            "author": "Kristy",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Powerful corded weed weedeater\"",
            "rating": 5,
            "date": "04/28/2018",
            "recommended": true,
            "text": "So powerful it twists with torque in my hands. Power of a gas weedeater but quiet electric! Very happy!",
            "author": "Jer7of9",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Strong Trimmer\"",
            "rating": 5,
            "date": "07/10/2017",
            "recommended": true,
            "text": "Cuts better than my other trimmers I use.  Easy rewindable and removeable line spool.",
            "author": "Puff C47",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"Very powerful\"",
            "rating": 5,
            "date": "05/21/2017",
            "recommended": true,
            "text": "Have only had my unit for a few days and am impressed with the quality and power.",
            "author": "littlejohn",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "title": "\"When batteries just don't get it\"",
            "rating": 4,
            "date": "08/10/2018",
            "recommended": true,
            "text": "Purchased this model to compete with gas trimmers and avoid charging batteries.",
            "author": "Glenn 91150",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        },
        {
            "images": [],
            "title": "\"Greenworks 10-Amp 18-in Corded Electric String Tri\"",
            "rating": 3,
            "date": "04/27/2019",
            "recommended": true,
            "text": "I put it together and it seems to work, but I haven't used it on the lawn yet.",
            "author": "none",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true,
            "helpful": {
                "yes": 0,
                "no": 6
            }
        },
        {
            "title": "",
            "rating": 4,
            "date": "07/30/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Bobby",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false
        },
        {
            "title": "",
            "rating": 4,
            "date": "05/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Don",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/11/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Ja",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "DD",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "10/10/2018",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "MG",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/28/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "DB",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "DD",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/10/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Outdoorman",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "05/30/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Josh",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/03/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "DD",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "",
            "rating": 5,
            "date": "06/08/2019",
            "recommended": true,
            "text": "There is no review to accompany this rating.",
            "author": "Benjamin",
            "verifiedPurchaser": true,
            "sweepstakesEntry": true
        },
        {
            "title": "\"Good, with issues\"",
            "rating": 3,
            "date": "07/06/2017",
            "recommended": false,
            "text": "I bought this 3 years ago. In that time I've had trouble keeping the head from loosening from vibration, the bolt that holds the two-part handle together sheared off. ( Good steel bolts don't do this ), the steel handle became extremely warm from some sort of internal friction.  Try as I might I cannot quite get the tool to balance so the weight is even and the tool swings comfortably while using it.  There is no well-thought-out loops or attachment points for a shoulder strap that would take the weight of the motor/hand-piece and support it.  This MAY give it that balance I have not been able to achieve.  The safety/trigger arrangement is small and difficult to hold down.  It tends to cramp my fingers after long use.  It makes it safe as it takes EFFORT to hold it down so accidentally starting the motor is highly unlikely but using it is not pleasant.  The string feed, like most string feeds, is basically garbage so I switched it out for nylon knife-like cutter blades.  These last a long time.  Recently the guard decided to fall off without warning and the bolt and clamp that held it flew off in different directions and without a metal detector I will not be able to find them.  I came here to seek parts but they are not offered.  I may contact customer service, so at this point it would be unfair to say Greenworks does not offer them.  \nThe motor is quite powerful, which is good, but it's design could be better, the weight more evenly distributed, solid loops could be added to attach a shoulder strap and a shoulder strap could be provided or offered to help with the weight of this awkward thing that tends to strain your lower back over time. Love it and despise it, but too cheap to throw it out and so far unable to find a great way to customize it to my satisfaction.",
            "author": "Grass Hacker",
            "verifiedPurchaser": false,
            "sweepstakesEntry": false,
            "helpful": {
                "yes": 0,
                "no": 0
            }
        }
    ],
    "reviewStats": {
        "reviewCount": 48,
        "percentRecommended": "91",
        "averageStars": "4.6",
        "starCounts": {
            "five": 35,
            "four": 8,
            "three": 4,
            "two": 0,
            "one": 1
        }
    },
    "questions": [
        {
            "question": "\"Can a shoulder harness/sling be used with this model?\"",
            "author": "Anonymous",
            "date": "04/20/2019",
            "answers": [
                {
                    "author": "Anonymous",
                    "date": "06/01/2019",
                    "text": "Recently purchased this model. I was pleasantly surprised when I removed it from the box and there was a shoulder strap included that clips to place on the pole",
                    "helpful": {
                        "yes": 7,
                        "no": 0
                    }
                },
                {
                    "author": "kathy",
                    "date": "06/01/2019",
                    "text": "I just got this model a few days ago and was surprised when I opened the box and discovered that there is a shoulder strap included that clips to the pole. It is not listed on box or in the description. Strap definitely helps as this model weighs about 10 pounds.",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                },
                {
                    "author": "RedVegas4",
                    "date": "06/01/2019",
                    "text": "You could attach a 3-point AR-15 Rifle Sling to this model and it should work probably for $20. or less.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "04/22/2019",
                    "text": "Hello there, Unfortunately no, a harness is not compatible with this model string trimmer.",
                    "helpful": {
                        "yes": 4,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"Is there any way to attach a shoulder strap to this unit?\"",
            "author": "Anonymous",
            "date": "05/30/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "06/06/2019",
                    "text": "Hello there, Unfortunately this string trimmer does not have a harness hook that would allow a harness to attach to this unit.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                },
                {
                    "author": "RedVegas4",
                    "date": "06/01/2019",
                    "text": "Yes there is - maybe a little unusual answer but it will work and I plan to do it. Utilize a 3-point shoulder strap for an AR-15 rifle. You can purchase one anywhere you can find AR-15 rifle accessories. Probably $20. or less.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"What is the length of this trimmer, is it adjustable? Also, is the line auto feed, or a bump feed? I've seen it listed as both.\"",
            "author": "Mammahen",
            "date": "09/10/2017",
            "answers": [
                {
                    "author": "lunamoth",
                    "date": "08/05/2018",
                    "text": "Bump-feed head.",
                    "helpful": {
                        "yes": 21,
                        "no": 1
                    }
                },
                {
                    "author": "CommunityAnswer",
                    "date": "09/11/2017",
                    "text": "Yes, this item measures 31.5 x 12.99 x 5.12 inches and the length is adjustable.",
                    "helpful": {
                        "yes": 14,
                        "no": 5
                    }
                }
            ]
        },
        {
            "question": "\"when bumping the unit on ground for line advance, is there a chance of damage to the machine?\"",
            "author": "Anonymous",
            "date": "07/02/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "07/04/2019",
                    "text": "Hello there, No, this string trimmer is meant to bumped on the ground to advance the cutting line. Eventually the bump would have to be replaced due to wear and tear.",
                    "helpful": {
                        "yes": 1,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"what extra attachments are available, and from where are they available?\"",
            "author": "Anonymous",
            "date": "07/01/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "07/04/2019",
                    "text": "Hello there, This string trimmer is compatible with Greenworks, Ryobi and Trimmer Plus brand attachments. For further details please contact our helpline at 1-888-909-6757.",
                    "helpful": {
                        "yes": 3,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"Will this timer accept a blade attachment?\"",
            "author": "Anonymous",
            "date": "06/30/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "07/04/2019",
                    "text": "Hello there, This string trimmer is compatible with Greenworks, Ryobi and Trimmer Plus brand attachments. For further details please contact our helpline at 1-888-909-6757.",
                    "helpful": {
                        "yes": 0,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"What is the recommended gauge of a 100 ft power cord which I am planning to use for this trimmer ?\"",
            "author": "Anonymous",
            "date": "06/12/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "06/18/2019",
                    "text": "Hello there, If you plan on using an 100 ft cord, we advise to use one at 10 AWG (gauge). Please see the following link with the instruction manual, with the chart located on page 8: http://pdf.lowes.com/operatingguides/841821008468_oper.pdf",
                    "helpful": {
                        "yes": 4,
                        "no": 0
                    }
                }
            ]
        },
        {
            "question": "\"What attachments work with this, and where do we find them?\"",
            "author": "Anonymous",
            "date": "05/19/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "05/23/2019",
                    "text": "Hello there, Greenworks, Ryobi and TrimmerPlus attachments are compatible with this string trimmer. These can be found either through Lowe's or through our website at greenworkstools.com.",
                    "helpful": {
                        "yes": 8,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"Does the speed-feed head fit?\"",
            "author": "Anonymous",
            "date": "05/17/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "05/21/2019",
                    "text": "Hello there, This string trimmer is only able to be used with the string trimmer head that is provided with the machine.",
                    "helpful": {
                        "yes": 3,
                        "no": 1
                    }
                }
            ]
        },
        {
            "question": "\"Does the Speed-Feed 400 Universal Trimmer Head fit?\"",
            "author": "Anonymous",
            "date": "05/16/2019",
            "answers": [
                {
                    "badgeName": "1000237789",
                    "author": "Greenworks Tools",
                    "date": "05/20/2019",
                    "text": "Hello there, Only the string trimmer head that is provided with this string trimmer is compatible with this unit.",
                    "helpful": {
                        "yes": 1,
                        "no": 1
                    }
                }
            ]
        }
    ]
}